[
    {
      "level": "chapter",
      "number": "1",
      "title": "The Benefits of Bodhicitta from Engaging in the Bodhisattva's Conduct",
      "verses_span": "1-36",
      "summary": {
        "content_summary": "ལེའུ་འདིས་ཐོག་མར་བསྟན་བཅོས་རྩོམ་པའི་དགོས་པ་དང་ཀུན་སློང་བསྟན་ཏེ། དེ་ནས་བྱང་ཆུབ་ཀྱི་སེམས་བསྐྱེད་པའི་རྟེན་དལ་འབྱོར་གྱི་མི་ལུས་རིན་པོ་ཆེ་རྙེད་པར་དཀའ་ཚུལ་བསམ་ནས་སྙིང་པོ་ལེན་པར་བསྐུལ་མ་བྱེད། དེ་ནས་བྱང་ཆུབ་སེམས་ཀྱི་ཕན་ཡོན་རྒྱ་ཆེ་བ་དཔེ་དང་ལུང་རིགས་དུ་མའི་སྒོ་ནས་བསྟན་ཏེ་ཀློག་པ་པོའི་རྒྱུད་ལ་སྤྲོ་བ་དང་དད་པ་མཆོག་ཏུ་བསྐྱེད། དེ་རྗེས་སྨོན་འཇུག་སེམས་བསྐྱེད་གཉིས་ཀྱི་ཁྱད་པར་དང་ཕན་ཡོན་གྱི་ཁྱད་པར་གསལ་བར་བྱས་ཏེ། མཐར་བྱང་ཆུབ་ཀྱི་སེམས་དང་ལྡན་པའི་གང་ཟག་གི་རླབས་ཆེན་གྱི་ཡོན་ཏན་བརྗོད་པས། ཀློག་པ་པོ་རྣམས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པའི་སྒོ་དབྱེ་བར་མཛད་དོ།",
        "key_concepts": [
          "ཕྱག་འཚལ་བ།",
          "རྩོམ་པའི་དགོས་པ།",
          "དལ་འབྱོར་རྙེད་དཀའ།",
          "བྱང་ཆུབ་སེམས་ཀྱི་ཕན་ཡོན།",
          "སྨོན་འཇུག་གི་དབྱེ་བ།",
          "བྱང་ཆུབ་སེམས་དཔའི་ཆེ་བ།"
        ],
        "transformative_goal": "ཀློག་པ་པོའི་རྒྱུད་ལ་བྱང་ཆུབ་ཀྱི་སེམས་རིན་པོ་ཆེ་ལ་མོས་གུས་དང་སྤྲོ་བ་དཔག་ཏུ་མེད་པ་བསྐྱེད་དེ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པའི་འདུན་པ་ནུས་ལྡན་ཞིག་བསྐྲུན་པ།",
        "function_in_hierarchy": "ལེའུ་འདི་ནི་བསྟན་བཅོས་ཡོངས་ཀྱི་སྒོ་འབྱེད་ལྟ་བུ་ཡིན་ཏེ། བརྗོད་བྱ་གཙོ་བོ་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་རིན་ཐང་དང་ནུས་པ་གསལ་སྟོན་བྱས་ནས། ཀློག་པ་པོ་རྣམས་ལམ་འདི་ལ་ཞུགས་འདོད་ཀྱི་ཀུན་སློང་བསྐྱེད་པའི་གཞི་འདིང་བར་བྱེད།",
        "inter_node_relationships": [],
        "implicit_concepts": [
          "ཀུན་སློང་གི་གལ་ཆེན་རང་བཞིན།",
          "ལམ་གྱི་རིམ་པའི་གནད་འགག",
          "དད་པ་དང་ཤེས་རབ་ཟུང་འབྲེལ།"
        ],
        "pedagogical_strategy": "ཐོག་མར་ཕན་ཡོན་བསྟན་ནས་ཡིད་འཕྲོག་པ། དེ་ནས་རིམ་བཞིན་གོ་རིམ་དང་དབྱེ་བ་གསལ་བར་བྱེད་པའི་ཐབས་ལམ་སྤྱོད་པ།",
        "intended_impact_on_reader": "འཇིག་རྟེན་གྱི་དགེ་བ་ཕལ་པ་རྣམས་ལས་བྱང་ཆུབ་ཀྱི་སེམས་ནི་རླབས་ཆེ་ཞིང་ཁྱད་པར་དུ་འཕགས་པའི་ངེས་ཤེས་བརྟན་པོ་སྐྱེས་ཏེ། དེ་ཉིད་རྒྱུད་ལ་བསྐྱེད་པར་འདོད་པའི་འདུན་པ་དྲག་པོ་སྐྱེ་བར་བྱེད་པ།",
        "audience_assumptions": "ཀློག་པ་པོ་ནི་ཐར་པ་དོན་དུ་གཉེར་ཞིང་། དམ་པའི་ཆོས་ཀྱི་ཕན་ཡོན་ལ་ཡིད་ཆེས་དང་དོན་གཉེར་ཡོད་མཁན་ཞིག་ཡིན་པར་ཆ་འཇོག་བྱེད།"
      },
      "children": [
        {
          "level": "section",
          "number": "1.1",
          "title": "Introduction to the Text",
          "verses_span": "1-4",
          "summary": {
            "content_summary": "ཚན་པ་འདིས་ཐོག་མར་དཀོན་མཆོག་གསུམ་ལ་ཕྱག་འཚལ་ཏེ་བསྟན་བཅོས་རྩོམ་པའི་བར་ཆད་ཞི་བ་དང་ཀློག་པ་པོ་རྣམས་ལ་དད་པ་བསྐྱེད་པར་མཛད། དེ་ནས་རྩོམ་པ་པོའི་ཀུན་སློང་བསྟན་ཏེ། རང་བཟོ་དང་ཁེངས་པའི་དྲི་མ་མེད་པར། རང་གི་ཉམས་ལེན་གྱི་ཆེད་དུ་རྒྱལ་བའི་གསུང་གི་སྙིང་པོ་བསྡུས་པ་ཡིན་པ་དང་། སྐལ་བ་མཉམ་པ་གཞན་ལའང་ཕན་པ་འབྱུང་སྲིད་པའི་རེ་བ་བཅངས་ཡོད་པ་གསལ་སྟོན་བྱས་ཡོད།",
            "key_concepts": [
              "མཆོད་བརྗོད།",
              "རྩོམ་པའི་དམ་བཅའ།",
              "ཁེངས་པ་བསྐྱུངས་པ།",
              "རང་གཞན་གྱི་དོན།"
            ],
            "transformative_goal": "ཀློག་པ་པོའི་རྒྱུད་ལ་བསྟན་བཅོས་འདི་ལ་ཡིད་ཆེས་དང་གུས་པ་བསྐྱེད་པ། དེ་དང་ཆབས་ཅིག་རྩོམ་པ་པོའི་ཀུན་སློང་དག་མ་ལ་བརྟེན་ནས་རང་ཉིད་ཀྱང་ཆོས་ལ་འཇུག་པའི་ཚེ་ཀུན་སློང་དག་པོ་ཞིག་དགོས་པའི་བློ་བསྐྱེད་པ།",
            "function_in_hierarchy": "ལེའུ་ཡི་འགོ་འཛུགས་པའི་ཚན་པ་འདིས་བསྟན་བཅོས་ཀྱི་རྒྱབ་ལྗོངས་དང་དགོས་པ་གསལ་སྟོན་བྱས་ཏེ། བརྗོད་བྱ་དངོས་ལ་མ་ཞུགས་གོང་ནས་ཀློག་པ་པོ་དང་བསྟན་བཅོས་བར་གྱི་འབྲེལ་བ་བཟང་པོ་ཞིག་འཛུགས་པར་བྱེད།",
            "inter_node_relationships": [],
            "implicit_concepts": [
              "སྲོལ་རྒྱུན་གྱི་བསྟན་བཅོས་རྩོམ་ཚུལ།",
              "ཀུན་སློང་དག་པའི་གལ་གནད།",
              "ཉམས་ལེན་དང་མཁས་པ་གཉིས་ཀྱི་འབྲེལ་བ།"
            ],
            "pedagogical_strategy": "སྲོལ་རྒྱུན་གྱི་རྩོམ་གཞུང་གི་ཆགས་སྟངས་བཞིན་ཐོག་མར་ཕྱག་འཚལ་བ་དང་། དེ་ནས་རྩོམ་པའི་ཀུན་སློང་དང་དགོས་པ་གསལ་སྟོན་བྱེད་པའི་རིམ་པར་བསྒྲིགས་པ།",
            "intended_impact_on_reader": "བསྟན་བཅོས་འདི་ནི་རྩོམ་པ་པོའི་མཁས་པ་ངོམས་པའི་ཆེད་དུ་མ་ཡིན་པར། ཉམས་ལེན་དོན་གཉེར་གྱི་སྙིང་ནས་བརྩམས་པ་ཞིག་ཡིན་པའི་ངེས་ཤེས་སྐྱེས་ཏེ། གུས་པ་དང་དད་པའི་སྒོ་ནས་གཞུང་དོན་ལ་འཇུག་པའི་འདུན་པ་བསྐྱེད་པ།",
            "audience_assumptions": "ཀློག་པ་པོས་བསྟན་བཅོས་ཀྱི་འགོར་ཕྱག་འཚལ་བ་དང་རྩོམ་པའི་དགོས་པ་སྟོན་པའི་སྲོལ་རྒྱུན་ལ་རྒྱུས་མངའ་ཡོད་པར་ཆ་འཇོག་བྱེད།"
          },
          "children": [
            {
              "level": "subsection",
              "number": "1.1.1",
              "title": "Homage",
              "verses_span": "1",
              "summary": {
                "content_summary": "ཚིགས་བཅད་འདིས་བསྟན་བཅོས་རྩོམ་པའི་ཐོག་མར་བདེ་བར་གཤེགས་པ་སངས་རྒྱས། དེའི་ཆོས་ཀྱི་སྐུ་སྟེ་དམ་པའི་ཆོས། དེ་བཞིན་དེའི་སྲས་བོ་བྱང་ཆུབ་སེམས་དཔའ་སོགས་དགེ་འདུན་དང་བཅས་པའི་དཀོན་མཆོག་གསུམ་གཙོས་ཕྱག་གི་འོས་སུ་གྱུར་པ་ཐམས་ཅད་ལ་གུས་པས་ཕྱག་འཚལ་བར་མཛད་ཡོད།",
                "key_concepts": [
                  "བདེ་གཤེགས།",
                  "ཆོས་ཀྱི་སྐུ།",
                  "རྒྱལ་སྲས།",
                  "ཕྱག་འཚལ་བ།"
                ],
                "transformative_goal": "ཕྱག་འཚལ་བའི་ཡུལ་དཀོན་མཆོག་གསུམ་གྱི་ཡོན་ཏན་དྲན་པའི་སྒོ་ནས་རང་རྒྱུད་ལ་དད་པ་དང་མོས་གུས་བསྐྱེད་པ།",
                "function_in_hierarchy": "འདི་ནི་བསྟན་བཅོས་ཀྱི་མགོ་རྩོམ་པའི་མཆོད་བརྗོད་ཡིན་ལ། དེས་བསྟན་བཅོས་རྩོམ་པ་མཐར་ཕྱིན་པའི་བར་ཆད་མེད་པར་བྱེད་པ་དང་། ཀློག་མཁན་རྣམས་ཀྱི་རྒྱུད་ལ་དད་པ་བསྐྱེད་པའི་ཐབས་སུ་འགྱུར།",
                "inter_node_relationships": [],
                "implicit_concepts": [
                  "སྐྱབས་ཡུལ་ངོས་འཛིན།",
                  "དགེ་བའི་ལས་ཀྱི་སྔོན་འགྲོ།"
                ],
                "pedagogical_strategy": "སྲོལ་རྒྱུན་གྱི་གཞུང་ལུགས་བཞིན་དུ། བརྗོད་བྱ་དངོས་མ་བཤད་པའི་སྔོན་དུ་མཆོད་བརྗོད་ཀྱིས་འགོ་འཛུགས་པ།",
                "intended_impact_on_reader": "ཀློག་པ་པོའི་ཡིད་ལ་བསྟན་བཅོས་ཀྱི་བརྗོད་བྱ་ནི་དཀོན་མཆོག་གསུམ་དང་འབྲེལ་བའི་དོན་ཟབ་མོ་ཡིན་པའི་བག་ཆགས་བཞག་སྟེ། གུས་པའི་སེམས་ཀྱིས་གཞུང་དོན་ལ་ཉན་པའི་འདུན་པ་བསྐྱེད་པ།",
                "audience_assumptions": "ཀློག་པ་པོས་དཀོན་མཆོག་གསུམ་གྱི་གོ་དོན་རགས་ཙམ་ཤེས་ཀྱི་ཡོད་པར་ཆ་འཇོག་བྱེད།"
              },
              "children": []
            },
            {
              "level": "subsection",
              "number": "1.1.2",
              "title": "Author's Intention",
              "verses_span": "2-4",
              "summary": {
                "content_summary": "ཚན་པ་འདིས་རྩོམ་པ་པོའི་ཀུན་སློང་གསུམ་གསལ་སྟོན་བྱེད། དང་པོ་ནི་རང་བཟོ་མིན་པར་ལུང་ལྟར་སྙིང་པོ་བསྡུས་པ་ཡིན་ཚུལ། གཉིས་པ་ནི་མཁས་པ་ངོམས་པའི་ཁེངས་པ་སྤངས་ཏེ་རང་གི་ཡིད་གོམས་པའི་ཆེད་དུ་ཡིན་ཚུལ། གསུམ་པ་ནི་རང་གི་དད་ཤུགས་འཕེལ་བ་དང་སྐལ་མཉམ་གཞན་ལའང་ཕན་པའི་རེ་བ་ཡོད་ཚུལ་བཅས་བསྟན་ཡོད།",
                "key_concepts": [
                  "ལུང་བཞིན་བརྗོད་པ།",
                  "ཁེངས་པ་སྤང་བ།",
                  "རང་གི་ཡིད་ལ་བསྒོམ་པ།",
                  "སྐལ་བ་མཉམ་པ་གཞན།"
                ],
                "transformative_goal": "ཆོས་ལ་འཇུག་སྐབས་ཀུན་སློང་དག་དགོས་པའི་གལ་གནད་རྟོགས་པ། ཁེངས་པ་དང་ང་རྒྱལ་སྤངས་ནས་སྙིམ་པའི་བསམ་པས་ཉམས་ལེན་བྱེད་དགོས་པའི་བློ་བསྐྱེད་པ།",
                "function_in_hierarchy": "མཆོད་བརྗོད་ཀྱི་རྗེས་སུ་བསྟན་བཅོས་ཀྱི་ནང་དོན་དང་དེའི་ཁུངས་བསྟན་ཏེ། རྩོམ་པ་པོའི་ཀུན་སློང་དག་མ་བརྒྱུད་ནས་བསྟན་བཅོས་ཀྱི་རིན་ཐང་དང་ཡིད་ཆེས་རུང་བའི་རང་བཞིན་གསལ་བར་བྱེད།",
                "inter_node_relationships": [],
                "implicit_concepts": [
                  "གང་ཟག་གི་ཚད་མ།",
                  "ཐོས་བསམ་སྒོམ་གསུམ།",
                  "ཞུམ་པ་དང་ཁེངས་པ་སྤང་བ།"
                ],
                "pedagogical_strategy": "རང་ཉིད་དམན་ས་བཟུང་ནས་བསྟན་བཅོས་ཀྱི་ཁུངས་དང་དགོས་པ་སྟོན་པའི་ཐབས་ལམ་བེད་སྤྱོད་བྱས་ཏེ། ཀློག་པ་པོའི་རྒྱུད་ལ་ང་རྒྱལ་མི་སྐྱེ་བར་དད་པ་སྐྱེ་བར་བྱེད་པ།",
                "intended_impact_on_reader": "རྩོམ་པ་པོའི་བསམ་པ་དག་ཅིང་ཟབ་པ་ལ་ཡིད་རངས་ཏེ། གཞུང་འདི་ལ་སློབ་སྦྱོང་བྱེད་པའི་འདུན་པ་སྔར་ལས་ཀྱང་ཤུགས་དྲག་ཏུ་བསྐྱེད་པ།",
                "audience_assumptions": "ཀློག་པ་པོས་བསྟན་བཅོས་ཀྱི་བརྗོད་བྱ་དང་དགོས་པ་སོགས་ཆོས་བཞིའི་གལ་གནད་ལ་དོ་སྣང་བྱེད་པར་སาดпускается."
              },
              "children": []
            }
          ]
        },
        {
          "level": "section",
          "number": "1.2",
          "title": "Generating the Unarisen Bodhicitta and its Benefits",
          "verses_span": "5-16",
          "summary": {
            "content_summary": "ཚན་པ་འདིས་བྱང་ཆུབ་སེམས་བསྐྱེད་པའི་གཞི་རྟེན་དང་དེའི་ཕན་ཡོན་བསྟན་ཡོད། དང་པོ་དལ་འབྱོར་གྱི་ལུས་རྟེན་རྙེད་དཀའ་བ་དང་དགེ་བའི་བློ་སྐྱེ་དཀའ་བ་བསྟན་ནས་སེམས་བསྐྱེད་པའི་རྨང་གཞི་བཏིང་། དེ་ནས་བྱང་ཆུབ་སེམས་ཀྱི་ཕན་ཡོན་དེ་དགེ་བ་གཞན་ལས་ཁྱད་པར་འཕགས་ཚུལ། མིང་དང་དོན་གནས་འགྱུར་ཚུལ། དཔེ་དྲུག་གི་སྒོ་ནས་དེའི་ནུས་པ་བླ་ན་མེད་པ་བཅས་གསལ་བར་བཀྲལ་ཏེ། ཀློག་པ་པོའི་རྒྱུད་ལ་སེམས་བསྐྱེད་པའི་སྤྲོ་བ་དང་འདུན་པ་ཤུགས་དྲག་བསྐྱེད་པར་མཛད་དོ།",
            "key_concepts": [
              "དལ་འབྱོར་རྙེད་དཀའ།",
              "དགེ་བའི་བློ་གྲོས།",
              "ཕན་ཡོན་སྤྱི།",
              "དཔེ་དྲུག",
              "བྱང་སེམས་ཀྱི་ནུས་པ།"
            ],
            "transformative_goal": "དལ་འབྱོར་ཐོབ་པའི་དོན་སྙིང་རྟོགས་ཤིང་། བྱང་ཆུབ་ཀྱི་སེམས་ནི་དགེ་བ་ཀུན་གྱི་རྩེ་མོ་དང་། སྡིག་པ་ཀུན་གྱི་གཉེན་པོ་མཆོག་ཡིན་པའི་ངེས་ཤེས་བརྟན་པོ་བསྐྱེད་དེ། སེམས་དེ་ཉིད་རྒྱུད་ལ་བསྐྱེད་པའི་ཐབས་ལ་བརྩོན་པར་བྱེད་པ།",
            "function_in_hierarchy": "འགོ་བརྗོད་པའི་རྗེས་སུ་ཀློག་པ་པོ་ལ་བྱང་ཆུབ་སེམས་ལ་འཇུག་པའི་ཀུན་སློང་བསྐྱེད་པའི་ཆེད་དུ། ཐོག་མར་རྟེན་གྱི་རིན་ཐང་བསྟན་པ་དང་། དེ་ནས་བརྟེན་པ་སེམས་ཀྱི་ཕན་ཡོན་རྒྱ་ཆེར་བཤད་དེ། ལམ་ལ་འཇུག་པའི་སྤྲོ་བ་སྲིང་བར་བྱེད།",
            "inter_node_relationships": [],
            "implicit_concepts": [
              "རྒྱུ་འབྲས་ཀྱི་རྣམ་བཞག",
              "སེམས་ཀྱི་ནུས་པ།",
              "གོ་སྐབས་དོན་ལྡན་དུ་བེད་སྤྱོད་པ།"
            ],
            "pedagogical_strategy": "ཐོག་མར་རྟེན་གྱི་རིན་ཐང་བསྟན་ནས་ཛ་དྲག་གི་བསམ་པ་བསྐྱེད་པ། དེ་ནས་ཕན་ཡོན་གྱི་རིན་ཐང་བསྟན་ནས་སྤྲོ་བའི་བསམ་པ་བསྐྱེད་པའི་ཐབས་ལམ་སྤྱོད་པ།",
            "intended_impact_on_reader": "དལ་འབྱོར་གྱི་མི་ལུས་འདི་ཆུད་ཟོས་སུ་མི་གཏོང་བར་སྙིང་པོ་ལེན་དགོས་པའི་བསམ་པ་དྲག་པོ་སྐྱེ་བ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ནི་སྙིང་པོའི་ནང་གི་ཡང་སྙིང་ཡིན་པར་ཤེས་ཏེ་དེ་ལ་བློ་སེམས་རྩེ་གཅིག་ཏུ་གཏོད་པ།",
            "audience_assumptions": "ཀློག་པ་པོས་དལ་འབྱོར་དང་ངན་སོང་གི་གོ་དོན་རགས་ཙམ་ཤེས་ཀྱི་ཡོད་པ་དང་། ཕན་ཡོན་ལ་བརྟེན་ནས་ཆོས་ལ་སྤྲོ་བ་སྐྱེ་བའི་བསམ་པའི་བག་ཆགས་ཡོད་པར་ཆ་འཇོག་བྱེད།"
          },
          "children": [
            {
              "level": "subsection",
              "number": "1.2.1",
              "title": "The Basis of Bodhicitta",
              "verses_span": "5-6",
              "summary": {
                "content_summary": "ཚན་པ་འདིས་བྱང་ཆུབ་ཀྱི་སེམས་བསྐྱེད་པའི་རྟེན་གཉིས་བསྟན་ཡོད། དང་པོ་ནི་ཆོས་སྒྲུབ་པའི་རྟེན་མཆོག་དལ་འབྱོར་གྱི་མི་ལུས་འདི་རྙེད་པར་ཤིན་ཏུ་དཀའ་བས་སྙིང་པོ་ལེན་དགོས་པར་བསྐུལ་བ། གཉིས་པ་ནི་མི་ལུས་ཐོབ་ཀྱང་དགེ་བ་ལ་སེམས་འཇུག་པ་ནི་མུན་ནག་ནང་གི་གློག་འགྱུ་བ་ལྟར་ཤིན་ཏུ་དཀོན་ཞིང་ཡུད་ཙམ་ཡིན་པས། དགེ་བའི་བློ་སྐྱེས་ཚེ་དམ་འཛིན་བྱེད་དགོས་པར་གདམས་པ།",
                "key_concepts": [
                  "དལ་འབྱོར།",
                  "སྐྱེས་བུའི་དོན།",
                  "གློག་འགྱུ།",
                  "བསོད་ནམས་བློ་གྲོས།"
                ],
                "transformative_goal": "དལ་འབྱོར་རྙེད་པའི་གོ་སྐབས་འདི་ཉིད་རྩ་ཆེན་དུ་བརྩིས་ནས་ཆུད་ཟོས་སུ་མི་གཏོང་བའི་བསམ་པ་བརྟན་པོ་བསྐྱེད་པ་དང་། དགེ་བའི་བློ་སྐྱེས་པའི་སྐད་ཅིག་ཙམ་ལའང་གཅེས་སྤྲས་བྱེད་ཤེས་པར་བྱེད་པ།",
                "function_in_hierarchy": "འདིས་བྱང་ཆུབ་སེམས་བསྐྱེད་པའི་གཞི་རྟེན་གྱི་གལ་གནད་དང་རྙེད་དཀའ་བའི་རང་བཞིན་བསྟན་ནས། འོག་ནས་འབྱུང་བའི་སེམས་བསྐྱེད་དེ་ཉིད་ཅིའི་ཕྱིར་དགོས་ཤིང་རིན་ཐང་ཆེ་བའི་རྒྱུ་མཚན་གྱི་རྨང་གཞི་འདིང་བར་བྱེད།",
                "inter_node_relationships": [],
                "implicit_concepts": [
                  "མི་རྟག་པ།",
                  "འཁོར་བའི་རང་བཞིན།",
                  "གོ་སྐབས་འཛིན་པ།"
                ],
                "pedagogical_strategy": "དཔེ་དང་དོན་སྦྱར་ནས་གོ་དཀའ་བའི་གནས་ལུགས་སྟོན་པ། དང་པོ་རྒྱུ་མཚན་དངོས་བསྟན་པ་དང་། གཉིས་པར་དཔེའི་སྒོ་ནས་གནད་དོན་སེམས་ལ་འཇགས་ཐབས་བྱེད་པ།",
                "intended_impact_on_reader": "རང་ཉིད་ལ་ད་ལྟ་ཡོད་པའི་གོ་སྐབས་འདི་ནི་ཤིན་ཏུ་རྩ་ཆེ་ཞིང་བརླག་སླ་བའི་ངོ་བོ་ཅན་ཞིག་ཡིན་པར་ཤེས་ཏེ། དུས་ཚོད་སྐར་མ་གཅིག་ཀྱང་ཆུད་ཟོས་སུ་མི་གཏོང་བར་དོན་ལྡན་དུ་བསྒྱུར་དགོས་པའི་ཛ་དྲག་གི་བསམ་པ་སྐྱེ་བ།",
                "audience_assumptions": "ཀློག་པ་པོས་འཁོར་བའི་སྡུག་བསྔལ་གྱི་རང་བཞིན་རགས་ཙམ་ཤེས་ཤིང་དེ་ལས་ཐར་འདོད་ཀྱི་བློ་ཡོད་པར་ཆ་འཇོག་བྱེད།"
              },
              "children": [
                {
                  "level": "sub-subsection",
                  "number": "1.2.1.1",
                  "title": "The Precious Human Body",
                  "verses_span": "5",
                  "summary": {
                    "content_summary": "ཚིགས་བཅད་འདིས་དལ་བ་དང་འབྱོར་བས་བརྒྱན་པའི་མི་ལུས་རིན་པོ་ཆེ་འདི་ནི་རྒྱུ་དང་། དཔེ། གྲངས་ཀྱི་སྒོ་ནས་བསམ་ན་རྙེད་པར་ཤིན་ཏུ་དཀའ་བ་ཞིག་ཡིན་ལ། མངོན་མཐོ་དང་ངེས་ལེགས་ཀྱི་དོན་ཆེན་སྒྲུབ་ནུས་པའི་རྟེན་འདི་ཐོབ་པའི་སྐབས་སུ་དམ་ཆོས་ཀྱི་ཕན་པ་མ་བསྒྲུབས་ན། ཕྱིས་སུ་འདི་འདྲའི་རྟེན་བཟང་འཐོབ་པར་མི་འགྱུར་ཞེས་བསྐུལ་མ་མཛད་ཡོད།",
                    "key_concepts": [
                      "དལ་འབྱོར།",
                      "རྙེད་པར་དཀའ་བ།",
                      "སྐྱེས་བུའི་དོན།",
                      "ཕན་པ་བསྒྲུབ་པ།"
                    ],
                    "transformative_goal": "རང་གིས་ཐོབ་པའི་མི་ལུས་འདི་ནི་གོ་སྐབས་རྩ་ཆེན་ཞིག་ཡིན་པར་ངོས་ཟིན་ནས། དེ་ཉིད་ཆུད་ཟོས་སུ་མི་གཏོང་བར་སྙིང་པོ་ལེན་དགོས་པའི་བསམ་པ་བརྟན་པོ་སྐྱེད་པ།",
                    "function_in_hierarchy": "འདི་ནི་སེམས་བསྐྱེད་པའི་གཞི་རྟེན་དང་པོ་སྟེ་ལུས་རྟེན་གྱི་རིན་ཐང་བསྟན་ནས། དེ་ཉིད་ཆོས་སྒྲུབ་པའི་ཆེད་དུ་བེད་སྤྱོད་གཏོང་དགོས་པའི་རྒྱུ་མཚན་འགོད་པར་བྱེད།",
                    "inter_node_relationships": [],
                    "implicit_concepts": [
                      "རྒྱུ་འབྲས་ཀྱི་རྣམ་བཞག",
                      "མི་རྟག་པའི་བསམ་པ།"
                    ],
                    "pedagogical_strategy": "ཐད་ཀར་གདམས་ངག་གི་ཚུལ་དུ་བརྗོད་དེ། རྒྱུ་མཚན་དང་འབྲས་བུ་གསལ་པོར་བསྟན་ནས་ཀློག་པ་པོའི་བློ་ལ་བསྐུལ་མ་བྱེད་པ།",
                    "intended_impact_on_reader": "ད་ལྟའི་དལ་འབྱོར་གྱི་མི་ལུས་འདི་ལ་བརྟེན་ནས་ཆོས་མ་བསྒྲུབས་ན་ཕངས་ཤིང་བློ་གནོང་དགོས་པའི་ཚོར་བ་སྐྱེས་ཏེ། ཆོས་སྒྲུབ་པའི་བརྩོན་འགྲུས་བསྐྱེད་པ།",
                    "audience_assumptions": "ཀློག་པ་པོས་དལ་འབྱོར་བཅོ་བརྒྱད་ཀྱི་གོ་དོན་རགས་ཙམ་ཤེས་ཀྱི་ཡོད་པར་ཆ་འཇོག་བྱེད།"
                  },
                  "children": []
                },
                {
                  "level": "sub-subsection",
                  "number": "1.2.1.2",
                  "title": "Rarity of Aspiration for Virtue",
                  "verses_span": "6",
                  "summary": {
                    "content_summary": "ཚིགས་བཅད་འདིས་དཔེ་མུན་ནག་སྤྲིན་རུམ་ན་གློག་འགྱུ་བ་སྐད་ཅིག་ཙམ་གྱིས་སྣང་བ་སྟོན་པ་ལྟར། དོན་སེམས་ཅན་རྣམས་ཀྱི་རྒྱུད་ལ་སངས་རྒྱས་ཀྱི་མཐུ་དང་རང་གི་བསོད་ནམས་ཀྱི་སྟོབས་ཀྱིས་དགེ་བ་སྒྲུབ་འདོད་ཀྱི་བློ་གྲོས་ནི་བརྒྱ་ལམ་ན་ཐང་འགའ་ཙམ་ལས་མི་འབྱུང་བས། དེ་ནི་ཤིན་ཏུ་དཀོན་པས་གཅེས་སྤྲས་བྱེད་དགོས་པར་བསྟན་ཡོད།",
                    "key_concepts": [
                      "གློག་འགྱུ།",
                      "སངས་རྒྱས་མཐུ།",
                      "བསོད་ནམས་བློ་གྲོས།",
                      "ཐང་འགའ་འབྱུང་།"
                    ],
                    "transformative_goal": "དགེ་བའི་བསམ་བློ་སྐད་ཅིག་ཙམ་སྐྱེས་པ་ལའང་རིན་ཐང་ཆེན་པོར་བལྟས་ནས། དེ་མ་ཉམས་པར་གོང་ནས་གོང་དུ་སྤེལ་བའི་བརྩོན་པ་ལྷུར་ལེན་པར་བྱེད་པ།",
                    "function_in_hierarchy": "འདི་ནི་སེམས་བསྐྱེད་པའི་གཞི་རྟེན་གཉིས་པ་སྟེ། སེམས་རྟེན་དགེ་བའི་བློ་སྐྱེ་བ་ཉིད་ཀྱི་རྙེད་དཀའ་བའི་རང་བཞིན་བསྟན་ནས། འོག་ནས་འབྱུང་བའི་བྱང་ཆུབ་ཀྱི་སེམས་ནི་དེ་དག་ལས་ཀྱང་ཆེས་རྙེད་པར་དཀའ་བའི་ཤུགས་བསྟན་བྱེད།",
                    "inter_node_relationships": [],
                    "implicit_concepts": [
                      "ཉོན་མོངས་པའི་དབང་དུ་གྱུར་པ།",
                      "རྒྱུ་རྐྱེན་འཛོམས་པའི་གལ་གནད།"
                    ],
                    "pedagogical_strategy": "དཔེ་གསལ་པོ་དང་ཤུགས་ཆེན་པོ་ཞིག་བཀོད་དེ། དོན་གྱི་གནད་འགག་དེ་ཀློག་པ་པོའི་སེམས་ལ་ཟུག་པར་བྱེད་པ།",
                    "intended_impact_on_reader": "རང་རྒྱུད་ལ་དགེ་བའི་བསམ་པ་ཅུང་ཟད་སྐྱེས་ཀྱང་དེ་ལ་དགའ་བ་བསྒོམས་ཏེ། དེ་མ་བརླག་པར་སྲུང་སྐྱོབ་དང་གོང་འཕེལ་གཏོང་བའི་འདུན་པ་བསྐྱེད་པ།",
                    "audience_assumptions": "ཀློག་པ་པོས་རང་རྒྱུད་ལ་མི་དགེ་བའི་བློ་རྒྱུན་ཆགས་སུ་སྐྱེ་བ་དང་དགེ་བའི་བློ་སྐྱེ་དཀའ་བའི་ཉམས་མྱོང་ཡོད་པར་ཆ་འཇོག་བྱེད།"
                  },
                  "children": []
                }
              ]
            },
            {
              "level": "subsection",
              "number": "1.2.2",
              "title": "General Benefits of Bodhicitta",
              "verses_span": "7-16",
              "summary": {
                "content_summary": "ཚན་པ་འདིས་བྱང་ཆུབ་སེམས་ཀྱི་ཕན་ཡོན་སྤྱིར་བསྟན་ཡོད། དང་པོ་དགེ་བ་གཞན་ཀུན་ལས་བྱང་ཆུབ་སེམས་ཁྱད་པར་དུ་འཕགས་ཤིང་སྡིག་པ་ཆེན་པོའི་གཉེན་པོ་མཆོག་ཡིན་པར་བསྟན། གཉིས་པར་སེམས་དེ་སྐྱེས་པ་ཙམ་གྱིས་མིང་དང་དོན་གཉིས་ཀ་གནས་འགྱུར་ཏེ་རྒྱལ་བའི་སྲས་སུ་འགྱུར་ཞིང་ཕྱག་བྱའི་གནས་སུ་འགྱུར་ཚུལ་བཤད། གསུམ་པར་དཔེ་དྲུག་གི་སྒོ་ནས་དེའི་ནུས་པ་སྣ་ཚོགས་ཏེ། ལུས་དམན་པ་མཆོག་ཏུ་བསྒྱུར་བ་དང་། རིན་ཐང་བྲལ་བ། དགེ་རྩ་མི་ཟད་པར་འཕེལ་བ། སྡིག་པ་སྦྱོང་ནུས་པ་སོགས་བློས་མི་དཔོག་པའི་ཕན་ཡོན་རྣམས་གསལ་བར་མཛད་ཡོད།",
                "key_concepts": [
                  "ཟིལ་གྱིས་གནོན་པ།",
                  "རྒྱལ་བའི་སྲས།",
                  "གསེར་འགྱུར་རྩི།",
                  "ཆུ་ཤིང་།",
                  "དུས་མཐའི་མེ།",
                  "ཕན་ཡོན་དཔག་ཏུ་མེད་པ།"
                ],
                "transformative_goal": "བྱང་ཆུབ་ཀྱི་སེམས་ནི་ཆོས་ཀུན་གྱི་རྒྱལ་པོ་དང་དགེ་བ་ཀུན་གྱི་རྩེ་མོ་ཡིན་པའི་ངེས་ཤེས་བརྟན་པོ་བསྐྱེད་དེ། དེ་ལ་བརྟེན་ནས་རང་གཞན་གྱི་དོན་ཆེན་འགྲུབ་ནུས་པའི་ཡིད་ཆེས་དང་སྤོབས་པ་བསྐྱེད་པ།",
                "function_in_hierarchy": "རྟེན་གྱི་རིན་ཐང་བསྟན་པའི་རྗེས་སུ། བརྟེན་པ་བྱང་ཆུབ་སེམས་ཀྱི་ཕན་ཡོན་རྒྱ་ཆེར་བརྗོད་དེ། ཀློག་པ་པོའི་རྒྱུད་ལ་དེ་ཉིད་བསྐྱེད་འདོད་ཀྱི་ཀུན་སློང་མཚན་ཉིད་ཚང་བ་ཞིག་བསྐྲུན་པར་བྱེད།",
                "inter_node_relationships": [],
                "implicit_concepts": [
                  "སེམས་ཀྱི་སྟོབས།",
                  "ཐེག་ཆེན་གྱི་ཁྱད་ནོར།",
                  "རིགས་ཀྱི་འགྱུར་བ།"
                ],
                "pedagogical_strategy": "ཐོག་མར་རིགས་པས་ཁྱད་ཆོས་སྤྱིར་བསྟན་པ། དེ་ནས་མཚན་གྱི་འགྱུར་བ་བསྟན་པ། མཐར་དཔེ་སྣ་ཚོགས་ཀྱིས་དེ་དག་དོན་ཐོག་ཏུ་གསལ་བར་བྱེད་པའི་རིམ་པས་སློབ་ཁྲིད་བྱེད་པ།",
                "intended_impact_on_reader": "བྱང་ཆུབ་ཀྱི་སེམས་ནི་སྲིད་ཞིའི་རྒུད་པ་ཀུན་ལས་སྐྱོབ་པའི་སྐྱབས་མཆོག་དང་། ཡོན་ཏན་ཀུན་འབྱུང་བའི་གཏེར་ཆེན་པོ་ཡིན་པར་ངེས་པ་རྙེད་དེ། སེམས་དེ་བསྐྱེད་རྒྱུ་ནི་རང་གི་མི་ཚེའི་ནང་གི་བྱ་བ་གལ་ཆེ་ཤོས་ཡིན་པའི་བསམ་པ་སྐྱེ་བ།",
                "audience_assumptions": "ཀློག་པ་པོས་དཔེ་རྣམས་ཀྱི་གོ་དོན་སྤྱིར་བཏང་ཤེས་ཀྱི་ཡོད་པ་དང་། དེ་དག་གིས་མཚོན་པའི་དོན་ཟབ་མོ་ལ་བསམ་བློ་གཏོང་ཐུབ་པར་ཆ་འཇོག་བྱེད།"
              },
              "children": [
                {
                  "level": "sub-subsection",
                  "number": "1.2.2.1",
                  "title": "Benefits Superior to Other Virtues",
                  "verses_span": "7-9",
                  "summary": {
                    "content_summary": "ཚན་པ་འདིས་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཁྱད་འཕགས་ཀྱི་ཕན་ཡོན་གསུམ་བསྟན་ཡོད། དང་པོ་ནི་སྡིག་པ་སྟོབས་ཆེན་གྱི་གཉེན་པོར་བྱང་ཆུབ་ཀྱི་སེམས་ལས་ལྷག་པ་མེད་ཚུལ། གཉིས་པ་ནི་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་བསྐལ་པ་དུ་མར་དགོངས་ནས་ཕན་པའི་མཆོག་ཏུ་གཟིགས་ཤིང་། དེས་སེམས་ཅན་རྣམས་བདེ་བླག་ཏུ་བདེ་མཆོག་ཐོབ་པར་བྱེད་ཚུལ། གསུམ་པ་ནི་རང་གཞན་གྱི་སྡུག་བསྔལ་སེལ་བ་དང་བདེ་བ་སྒྲུབ་པར་འདོད་པ་ཀུན་གྱིས་སེམས་དེ་རྟག་ཏུ་གཏང་མི་བྱ་བར་བསྟན་ཡོད།",
                    "key_concepts": [
                      "ཟིལ་གྱིས་གནོན་པ།",
                      "ཐུབ་དབང་གིས་དགོངས་པ།",
                      "བདེ་མཆོག",
                      "རྟག་ཏུ་གཏང་མི་བྱ།"
                    ],
                    "transformative_goal": "དགེ་བ་ཕལ་པ་ལ་ཆོག་ཤེས་མི་བྱེད་པར། དགེ་བ་ཀུན་གྱི་རྒྱལ་པོ་བྱང་ཆུབ་ཀྱི་སེམས་ལ་བློ་སེམས་རྩེ་གཅིག་ཏུ་གཏོད་པའི་བསམ་པ་བརྟན་པོ་སྐྱེད་པ།",
                    "function_in_hierarchy": "འདི་ནི་ཕན་ཡོན་སྤྱིའི་ནང་གི་གནད་དོན་དང་པོ་སྟེ། བྱང་ཆུབ་ཀྱི་སེམས་ནི་དགེ་བ་གཞན་དང་མི་འདྲ་བར་ཁྱད་པར་དུ་འཕགས་པའི་རང་བཞིན་བསྟན་ནས། དེ་ལ་དམིགས་བསལ་གྱི་དོ་སྣང་བྱེད་དགོས་པའི་རྒྱུ་མཚན་འགོད་པ།",
                    "inter_node_relationships": [],
                    "implicit_concepts": [
                      "ལམ་གྱི་གཙོ་བོ།",
                      "ཐབས་དང་ཤེས་རབ།"
                    ],
                    "pedagogical_strategy": "རིགས་པའི་སྒོ་ནས་བསྒྲུབ་པ། སངས་རྒྱས་ཀྱི་ལུང་དྲངས་ནས་བསྒྲུབ་པ། ཉམས་ལེན་གྱི་གདམས་ངག་ཏུ་བསྡུས་ནས་བསྒྲུབ་པ་བཅས་ཐབས་ལམ་གསུམ་སྤྱོད་པ།",
                    "intended_impact_on_reader": "བྱང་ཆུབ་ཀྱི་སེམས་ནི་སྡིག་པ་སྟོབས་ཆེན་འཇོམས་པའི་མཚོན་ཆ་དང་། སངས་རྒྱས་ཀྱི་གོ་འཕང་སྒྲུབ་པའི་ཐབས་མཆོག་ཡིན་པའི་ངེས་ཤེས་གཏིང་ཚུགས་པ་ཞིག་སྐྱེ་བ།",
                    "audience_assumptions": "ཀློག་པ་པོས་དགེ་བ་དང་སྡིག་པའི་གོ་དོན་ཤེས་ཤིང་། སྡུག་བསྔལ་སེལ་བ་དང་བདེ་བ་སྒྲུབ་པའི་འདོད་པ་ཡོད་པར་ཆ་འཇོག་བྱེད།"
                  },
                  "children": []
                },
                {
                  "level": "sub-subsection",
                  "number": "1.2.2.2",
                  "title": "Benefits of Changing Name and Meaning",
                  "verses_span": "10",
                  "summary": {
                    "content_summary": "ཚིགས་བཅད་འདིས་བྱང་ཆུབ་ཀྱི་སེམས་སྐྱེས་པ་ཙམ་གྱི་ཕན་ཡོན་བསྟན་ཡོད། སེམས་དེ་རྒྱུད་ལ་སྐྱེས་པའི་སྐད་ཅིག་དེ་ཉིད་ལ། སྔར་འཁོར་བའི་བཙོན་རར་ལས་ཉོན་གྱིས་བསྡམས་པའི་སེམས་ཅན་ཉམ་ཐག་དེ་ཉིད་ཀྱི་མིང་ལ་ \"བདེ་གཤེགས་ཀྱི་སྲས་\" ཞེས་འགྱུར་བ་དང་། དོན་དུ་འཇིག་རྟེན་ལྷ་མིར་བཅས་པའི་ཕྱག་གི་གནས་སུ་འགྱུར་བའི་ཕན་ཡོན་བླ་ན་མེད་པ་ཡོད་པར་བསྟན་ཡོད།",
                    "key_concepts": [
                      "སྐད་ཅིག་གིས།",
                      "བདེ་གཤེགས་སྲས།",
                      "ཕྱག་བྱར་འགྱུར།",
                      "མིང་དོན་གནས་འགྱུར།"
                    ],
                    "transformative_goal": "རང་ཉིད་སོ་སྐྱེ་ཉམ་ཐག་ཅིག་ཡིན་སྙམ་པའི་ཞུམ་པའི་བསམ་པ་དོར་ནས། བྱང་ཆུབ་ཀྱི་སེམས་བསྐྱེད་པ་ལ་བརྟེན་ནས་རང་གི་ངོ་བོ་དང་རིན་ཐང་གཉིས་ཀ་གནས་འགྱུར་ཐུབ་པའི་སྤོབས་པ་བསྐྱེད་པ།",
                    "function_in_hierarchy": "བྱང་ཆུབ་སེམས་ཀྱི་ཁྱད་འཕགས་ཀྱི་རང་བཞིན་བསྟན་པའི་རྗེས། དེའི་ནུས་པ་དེ་གང་ཟག་གི་ཐོག་ཏུ་མངོན་ཚུལ་གསལ་པོར་བསྟན་ཏེ། ཕན་ཡོན་དེ་དག་སྤྱི་བཤད་ཙམ་མ་ཡིན་པར་རང་རྒྱུད་ལའང་འཐོབ་ཐུབ་པའི་གདེང་སྤྲོད་པ།",
                    "inter_node_relationships": [],
                    "implicit_concepts": [
                      "རིགས་ཀྱི་འཕོ་འགྱུར།",
                      "སེམས་ཀྱི་ནུས་པའི་རླབས་ཆེན།"
                    ],
                    "pedagogical_strategy": "སྔ་ཕྱིའི་གནས་བབ་གཉིས་བསྡུར་ཏེ། བྱང་ཆུབ་སེམས་ཀྱི་ནུས་པ་དང་ཕན་ཡོན་ཤུགས་ཆེན་པོའི་སྒོ་ནས་མངོན་པར་བྱེད་པ།",
                    "intended_impact_on_reader": "བྱང་ཆུབ་ཀྱི་སེམས་བསྐྱེད་པ་ནི་སོ་སྐྱེའི་གནས་ལས་རྒྱལ་སྲས་ཀྱི་གོ་འཕང་དུ་འཕོ་བའི་ཐེམ་སྐས་ལྟ་བུ་ཡིན་པར་ཤེས་ཏེ། དེ་ལ་བསྐྱེད་པའི་འདུན་པ་སྔར་བས་ཀྱང་ཆེ་རུ་འགྲོ་བ།",
                    "audience_assumptions": "ཀློག་པ་པོས་འཁོར་བ་དང་རྒྱལ་སྲས་ཞེས་པའི་ཐ་སྙད་ཀྱི་གོ་དོན་རགས་ཙམ་ཤེས་ཀྱི་ཡོད་པར་ཆ་འཇོག་བྱེད།"
                  },
                  "children": []
                },
                {
                  "level": "sub-subsection",
                  "number": "1.2.2.3",
                  "title": "Benefits Shown Through Examples",
                  "verses_span": "11-16",
                  "summary": {
                    "content_summary": "ཚན་པ་འདིས་བྱང་ཆུབ་སེམས་ཀྱི་ཕན་ཡོན་རྒྱ་ཆེ་བ་དེ་དཔེ་དྲུག་གི་སྒོ་ནས་གསལ་བར་བྱས་ཡོད། དཔེ་དེ་དག་ནི་གསེར་འགྱུར་རྩིས་ལུས་དམན་པ་མཆོག་ཏུ་བསྒྱུར་བ། རིན་པོ་ཆེ་ལྟར་རིན་ཐང་བྲལ་བ། དཔག་བསམ་ཤིང་ལྟར་འབྲས་བུ་མི་ཟད་པར་འཕེལ་བ། དཔའ་བོའི་སྐྱེལ་མ་ལྟར་སྡིག་པ་ལས་སྐྱོབ་པ། དུས་མཐའི་མེ་ལྟར་སྡིག་པ་ཆེན་པོ་སྲེག་པ། དེ་བཞིན་མདོ་གཞན་ལས་བཤད་པ་ལྟར་ཕན་ཡོན་དཔག་ཏུ་མེད་པ་དང་ལྡན་ཚུལ་བཅས་ཡིན།",
                    "key_concepts": [
                      "དཔེའི་སྒོ་ནས་བསྟན་པ།",
                      "གསེར་འགྱུར་རྩི།",
                      "རིན་ཆེན།",
                      "ལྗོན་ཤིང་།",
                      "དཔའ་བོ།",
                      "དུས་མཐའི་མེ།"
                    ],
                    "transformative_goal": "དཔེ་སྣ་ཚོགས་ལ་བརྟེན་ནས་བྱང་ཆུབ་སེམས་ཀྱི་ཕན་ཡོན་གྱི་ཕྱོགས་མང་པོ་ཞིག་རྟོགས་ཏེ། དེ་ལ་ཡིད་ཆེས་དང་དད་པ་གཡོ་བ་མེད་པ་ཞིག་བསྐྱེད་པ།",
                    "function_in_hierarchy": "འདིས་བྱང་ཆུབ་སེམས་ཀྱི་ཕན་ཡོན་སྤྱིར་བསྟན་པ་རྣམས་ལ་དཔེའི་སྒོ་ནས་རྒྱབ་རྟེན་དང་ར་སྤྲོད་བྱས་ཏེ། གནད་དོན་དེ་དག་ཀློག་པ་པོའི་སེམས་ལ་གསལ་པོར་འཇགས་ཐབས་བྱེད་པ།",
                    "inter_node_relationships": [],
                    "implicit_concepts": [
                      "ཐབས་མཁས་ཀྱི་སློབ་སྟོན།",
                      "བློས་མི་དཔོག་པའི་ཆོས་ཉིད།"
                    ],
                    "pedagogical_strategy": "དཔེ་སོ་སོའི་ཁྱད་ཆོས་མི་འདྲ་བ་བེད་སྤྱོད་བྱས་ཏེ། བྱང་ཆུབ་སེམས་ཀྱི་ཕན་ཡོན་གྱི་ཆ་ཤས་མི་འདྲ་བ་རེ་རེ་བཞིན་གསལ་བཤད་བྱེད་པའི་ཐབས་ལམ་སྤྱོད་པ།",
                    "intended_impact_on_reader": "བྱང་ཆུབ་སེམས་ཀྱི་རིན་ཐང་དང་ནུས་པ་ནི་ཕྱོགས་གཅིག་ནས་བསམ་གྱིས་མི་ཁྱབ་པ་མ་ཟད། ཕྱོགས་མང་པོ་ནས་བློ་ཡུལ་ལས་འདས་པ་ཞིག་ཡིན་པར་ངེས་པ་རྙེད་དེ། དེ་ལ་གུས་པ་དང་གདེང་ཚོད་ཆེན་པོ་སྐྱེ་བ།",
                    "audience_assumptions": "ཀློག་པ་པོས་དཔེ་དེ་དག་གི་རིག་གནས་ཀྱི་རྒྱབ་ལྗོངས་དང་དེས་མཚོན་པའི་དོན་ལ་གོ་བ་ལེན་ཐུབ་པར་ཆ་འཇོག་བྱེད།"
                  },
                  "children": [
                    {
                      "level": "sub-sub-subsection",
                      "number": "1.2.2.3.1",
                      "title": "Example of Alchemical Elixir",
                      "verses_span": "11",
                      "summary": {
                        "content_summary": "ཚིགས་བཅད་འདིས་དཔེ་གསེར་འགྱུར་གྱི་རྩིས་ལྕགས་སོགས་དངོས་པོ་དམན་པ་རྣམས་རིན་ཐང་ཆེ་བའི་གསེར་དུ་བསྒྱུར་ཐུབ་པ་ལྟར། དོན་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱིས་མི་གཙང་བའི་ཕུང་པོ་དམན་པ་འདི་ཉིད་བླངས་ནས་རིན་ཐང་བྲལ་བའི་རྒྱལ་བའི་སྐུ་རུ་བསྒྱུར་ནུས་པས། ནུས་པ་དེ་ལྡན་གྱི་བྱང་ཆུབ་སེམས་རིན་པོ་ཆེ་དེ་རབ་ཏུ་བརྟན་པོར་བཟུང་དགོས་པར་གདམས་ཡོད།",
                        "key_concepts": [
                          "གསེར་འགྱུར་རྩི།",
                          "མི་གཙང་ལུས།",
                          "རྒྱལ་བའི་སྐུ།",
                          "རབ་བརྟན་ཟུང་།"
                        ],
                        "transformative_goal": "རང་གི་ལུས་དམན་པ་ལ་སྙིང་པོ་མེད་པར་མི་བལྟ་བར། བྱང་ཆུབ་སེམས་ཀྱིས་ཟིན་ན་དེ་ཉིད་སངས་རྒྱས་ཀྱི་སྐུ་སྒྲུབ་པའི་རྟེན་མཆོག་ཏུ་འགྱུར་བའི་ཡིད་ཆེས་བསྐྱེད་པ།",
                        "function_in_hierarchy": "འདི་ནི་དཔེ་དྲུག་གི་དང་པོ་སྟེ། བྱང་ཆུབ་སེམས་ཀྱི་\"བསྒྱུར་བའི་ནུས་པ་\"བསྟན་ནས། དེས་གཞི་དམན་པ་ཞིག་མཆོག་ཏུ་ཇི་ལྟར་གནས་སྒྱུར་ཐུབ་པའི་ཚུལ་གསལ་སྟོན་བྱེད།",
                        "inter_node_relationships": [],
                        "implicit_concepts": [
                          "རྟེན་གྱི་རུང་བ།",
                          "སེམས་ཀྱི་བསྒྱུར་ནུས།"
                        ],
                        "pedagogical_strategy": "ཀུན་གྱིས་རིན་ཐང་ཆེན་པོར་བརྩི་བའི་གསེར་འགྱུར་རྩིའི་དཔེ་བཀོད་དེ། བྱང་ཆུབ་སེམས་ཀྱི་རིན་ཐང་དང་ནུས་པ་དེ་བས་ཀྱང་ཆེ་བར་ཤུགས་ཀྱིས་སྟོན་པ།",
                        "intended_impact_on_reader": "རང་གི་ལུས་དང་སེམས་ལ་སྤོབས་པ་སྐྱེས་ཏེ། བྱང་ཆུབ་སེམས་ལ་བརྟེན་ནས་འགྱུར་བ་ཆེན་པོ་གཏོང་ཐུབ་པའི་གདེང་ཚོད་རྙེད་པ།",
                        "audience_assumptions": "ཀློག་པ་པོས་གསེར་འགྱུར་རྩིའི་སྐོར་གྱི་གཏམ་རྒྱུད་དང་དེའི་རིན་ཐང་ཤེས་ཀྱི་ཡོད་པར་ཆ་འཇོག་བྱེད།"
                      },
                      "children": []
                    },
                    {
                      "level": "sub-sub-subsection",
                      "number": "1.2.2.3.2",
                      "title": "Example of a Jewel",
                      "verses_span": "12",
                      "summary": {
                        "content_summary": "ཚིགས་བཅད་འདིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཉིད་ཀྱིས་བསྐལ་པ་དུ་མར་ལེགས་པར་བརྟགས་ན། ཆོས་ཐམས་ཅད་ཀྱི་ནང་ནས་བྱང་ཆུབ་ཀྱི་སེམས་ནི་རིན་ཐང་ཆེ་ཤོས་སུ་གཟིགས་པས། འགྲོ་བ་རྣམས་སྲིད་པའི་སྡུག་བསྔལ་ལས་གྲོལ་བར་འདོད་ན་རིན་ཆེན་ལྟ་བུའི་བྱང་ཆུབ་ཀྱི་སེམས་དེ་བརྟན་པོར་བཟུང་དགོས་པར་བསྟན་ཡོད།",
                        "key_concepts": [
                          "འགྲོ་བའི་དེད་དཔོན།",
                          "ཚད་མེད་བློས།",
                          "རིན་ཆེ་བ།",
                          "རིན་ཆེན་བྱང་ཆུབ་སེམས།"
                        ],
                        "transformative_goal": "བྱང་ཆུབ་ཀྱི་སེམས་ནི་རང་གི་བློས་བཏགས་པ་ཙམ་མ་ཡིན་པར། སངས་རྒྱས་ཀྱིས་ཀྱང་རིན་ཐང་ཆེ་ཤོས་སུ་གཟིགས་པའི་ནོར་བུ་དམ་པ་ཡིན་པར་ངེས་ཤེས་སྐྱེད་དེ། དེ་ལ་གཅེས་སྤྲས་དང་གདེང་ཚོད་ཆེན་པོ་བྱེད་པ།",
                        "function_in_hierarchy": "འདི་ནི་དཔེ་དྲུག་གི་གཉིས་པ་སྟེ། བྱང་ཆུབ་སེམས་ཀྱི་\"རིན་ཐང་གི་རང་བཞིན་\"བསྟན་ནས། དེ་ནི་དོན་གཉེར་བྱ་ཡུལ་ཀུན་གྱི་མཆོག་ཡིན་པར་གསལ་སྟོན་བྱེད།",
                        "inter_node_relationships": [],
                        "implicit_concepts": [
                          "སངས་རྒྱས་ཀྱི་ཚད་མ།",
                          "ནོར་གྱི་མཆོག"
                        ],
                        "pedagogical_strategy": "ཚད་མའི་སྐྱེས་བུ་སངས་རྒྱས་ཀྱི་དགོངས་པ་དཔང་པོར་བཞག་སྟེ། བྱང་ཆུབ་སེམས་ཀྱི་རིན་ཐང་ལ་ཐེ་ཚོམ་མེད་པར་བྱེད་པ།",
                        "intended_impact_on_reader": "རང་གི་བློ་ངོར་བྱང་ཆུབ་སེམས་ཀྱི་གནས་བབ་དེ་ཆོས་གཞན་ཀུན་ལས་མཐོ་བར་བཞག་སྟེ། དེ་ཉིད་ཐོབ་པར་བྱ་རྒྱུ་ནི་རིན་ཆེན་རྙེད་པ་ལས་ཀྱང་གལ་ཆེ་བར་མཐོང་བ།",
                        "audience_assumptions": "ཀློག་པ་པོས་སངས་རྒྱས་ནི་ཚད་མའི་སྐྱེས་བུ་ཡིན་པར་ཡིད་ཆེས་བྱེད་པར་ཆ་འཇོག་བྱེད།"
                      },
                      "children": []
                    },
                    {
                      "level": "sub-sub-subsection",
                      "number": "1.2.2.3.3",
                      "title": "Example of a Fruit-bearing Tree",
                      "verses_span": "13",
                      "summary": {
                        "content_summary": "ཚིགས་བཅད་འདིས་བྱང་ཆུབ་སེམས་ཀྱིས་མ་ཟིན་པའི་དགེ་བ་གཞན་ཀུན་ནི་ཆུ་ཤིང་ལྟར་འབྲས་བུ་ལན་གཅིག་བསྐྱེད་ནས་ཟད་འགྲོ་བ་དང་འདྲ་ལ། བྱང་ཆུབ་སེམས་ཀྱིས་ཟིན་པའི་དགེ་བ་ནི་དཔག་བསམ་གྱི་ལྗོན་ཤིང་ལྟར། རྟག་ཏུ་འབྲས་བུ་འབྱིན་ཞིང་མི་ཟད་པར་མ་ཟད་གོང་ནས་གོང་དུ་འཕེལ་བར་འགྱུར་བའི་ཁྱད་པར་བསྟན་ཡོད།",
                        "key_concepts": [
                          "ཆུ་ཤིང་།",
                          "ཟད་པར་འགྱུར་བ།",
                          "ལྗོན་ཤིང་།",
                          "མི་ཟད་འཕེལ་བར་འགྱུར།"
                        ],
                        "transformative_goal": "དགེ་རྩ་བསྒྲུབ་པའི་ཚེ་ཡུན་ཐུང་གི་འབྲས་བུ་ཙམ་ལ་མི་བལྟ་བར། ཡུན་རིང་ཞིང་རྒྱུན་མི་ཆད་པའི་འབྲས་བུ་ཐོབ་པའི་ཆེད་དུ་དགེ་བ་ཐམས་ཅད་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱིས་ཟིན་པར་བྱེད་དགོས་པའི་བློ་བསྐྱེད་པ།",
                        "function_in_hierarchy": "འདི་ནི་དཔེ་དྲུག་གི་གསུམ་པ་སྟེ། བྱང་ཆུབ་སེམས་ཀྱི་\"དགེ་རྩ་འཕེལ་བའི་ནུས་པ་\"བསྟན་ནས། དེས་དགེ་བ་རྣམས་མི་ཟད་པའི་གཏེར་དུ་ཇི་ལྟར་བསྒྱུར་བའི་ཚུལ་གསལ་སྟོན་བྱེད།",
                        "inter_node_relationships": [],
                        "implicit_concepts": [
                          "ཐབས་ཀྱིས་ཟིན་པའི་དགེ་བ།",
                          "བསོད་ནམས་ཀྱི་རྒྱུན་མི་ཆད་པ།"
                        ],
                        "pedagogical_strategy": "དཔེ་གཉིས་ཀྱི་ཁྱད་པར་གསལ་པོར་བསྡུར་ཏེ། བྱང་ཆུབ་སེམས་ཀྱིས་ཟིན་མ་ཟིན་གྱི་དགེ་བའི་འབྲས་བུའི་ཁྱད་པར་ཆེན་པོ་དེ་ཤུགས་ཀྱིས་མངོན་པར་བྱེད་པ།",
                        "intended_impact_on_reader": "རང་གིས་དགེ་བ་ཆུང་ངུ་ཞིག་བསྒྲུབས་ཀྱང་དེ་ཉིད་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱིས་ཟིན་པར་བྱས་ན། དེའི་ཕན་ཡོན་ནམ་མཁའ་ལྟར་རྒྱ་ཆེ་ཞིང་མཐའ་མེད་དུ་འགྱུར་བའི་ཡིད་ཆེས་སྐྱེ་བ།",
                        "audience_assumptions": "ཀློག་པ་པོས་དགེ་བ་དང་དེའི་འབྲས་བུའི་སྐོར་ལ་རྒྱུས་མངའ་ཡོད་པར་ཆ་འཇོག་བྱེད།"
                      },
                      "children": []
                    },
                    {
                      "level": "sub-sub-subsection",
                      "number": "1.2.2.3.4",
                      "title": "Example of a Brave Escort",
                      "verses_span": "14",
                      "summary": {
                        "content_summary": "ཚིགས་བཅད་འདིས་དཔེར་ན་ཉེས་པ་ཆེན་པོ་ཅན་ཞིག་སྐྱེལ་མ་དཔའ་བོ་ལ་བརྟེན་ནས་འཇིགས་པ་ཆེན་པོ་ལས་ཐར་བ་ལྟར། དོན་མཚམས་མེད་ལྔ་ལྟ་བུའི་སྡིག་པ་ཤིན་ཏུ་མི་བཟད་པ་བྱས་ན་ཡང་། བྱང་ཆུབ་ཀྱི་སེམས་རིན་པོ་ཆེ་གང་ལ་བརྟེན་ན་དེའི་འབྲས་བུ་ངན་པ་ལས་ཡུད་ཀྱིས་སྒྲོལ་བར་འགྱུར་བས། སྡིག་པ་ལ་འཇིགས་པའི་བག་ཅན་རྣམས་ཀྱིས་དེ་ལ་ཅིས་མི་བརྟེན་ཏེ་བརྟེན་དགོས་པར་བསྟན་ཡོད།",
                        "key_concepts": [
                          "སྡིག་པ་མི་བཟད་པ།",
                          "དཔའ་ལ་བརྟེན་པ།",
                          "འཇིགས་པ་ཆེན་པོ།",
                          "ཡུད་ཀྱིས་སྒྲོལ།"
                        ],
                        "transformative_goal": "རང་གིས་སྔར་སྡིག་པ་ཇི་ཙམ་བསགས་ཀྱང་ ተስፋམི་ཆད་པར། བྱང་ཆུབ་ཀྱི་སེམས་ནི་དེ་དག་སྦྱོང་བའི་ཐབས་མཆོག་ཡིན་པར་ཡིད་ཆེས་ཀྱིས་བརྟེན་པར་བྱེད་པ།",
                        "function_in_hierarchy": "འདི་ནི་དཔེ་དྲུག་གི་བཞི་པ་སྟེ། བྱང་ཆུབ་སེམས་ཀྱི་\"སྐྱོབ་པའི་ནུས་པ་\"བསྟན་ནས། དེས་སྡིག་པ་ཆེན་པོའི་འབྲས་བུ་ལས་ཇི་ལྟར་སྐྱོབ་པའི་ཚུལ་གསལ་སྟོན་བྱེད།",
                        "inter_node_relationships": [],
                        "implicit_concepts": [
                          "བཤགས་པའི་སྟོབས།",
                          "ཐབས་མཁས་ཀྱི་ཉམས་ལེན།"
                        ],
                        "pedagogical_strategy": "འཇིག་རྟེན་པའི་དཔེ་ཞིག་བཀོད་དེ། དེ་དང་བསྡུར་ན་བྱང་ཆུབ་སེམས་ཀྱི་སྐྱོབ་པའི་ནུས་པ་དེ་བས་ཀྱང་ཆེ་བར་སྟོན་པའི་ཐབས་ལམ་སྤྱོད་པ།",
                        "intended_impact_on_reader": "སྔར་བྱས་ཀྱི་སྡིག་པ་ལ་འགྱོད་པ་སྐྱེས་པ་དང་ཆབས་ཅིག བྱང་ཆུབ་ཀྱི་སེམས་ནི་དེ་ལས་ཐར་བའི་སྐྱབས་གཅིག་པུ་ཡིན་པའི་གདེང་ཚོད་དང་ཡིད་ཆེས་བརྟན་པོ་སྐྱེ་བ།",
                        "audience_assumptions": "ཀློག་པ་པོས་ལས་འབྲས་དང་སྡིག་པའི་རྣམ་སྨིན་ལ་འཇིགས་སྐྲག་ཡོད་པར་ཆ་འཇོག་བྱེད།"
                      },
                      "children": []
                    },
                    {
                      "level": "sub-sub-subsection",
                      "number": "1.2.2.3.5",
                      "title": "Example of the Fire at the End of Time",
                      "verses_span": "15",
                      "summary": {
                        "content_summary": "ཚིགས་བཅད་འདིས་བྱང་ཆུབ་ཀྱི་སེམས་དེས་ནི་དཔེ་བསྐལ་པའི་མཐའི་མེས་སྣོད་བཅུད་ཀྱི་འཇིག་རྟེན་ཐམས་ཅད་སྐད་ཅིག་གཅིག་ལ་ལྷག་མེད་དུ་སྲེག་པ་བཞིན་དུ། དོན་དུ་སྡིག་པ་ཆེན་པོ་རྣམས་ཀྱང་སྐད་ཅིག་གཅིག་ལ་རྩ་བ་ནས་དྲུངས་འབྱིན་ཏེ་ངེས་པར་སྲེག་པའམ་དག་པར་བྱེད་ནུས་པར་བསྟན་ཡོད།",
                        "key_concepts": [
                          "དུས་མཐའི་མེ།",
                          "སྡིག་ཆེན།",
                          "སྐད་ཅིག་གཅིག",
                          "ངེས་པར་སྲེག"
                        ],
                        "transformative_goal": "བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་སྡིག་སྦྱོང་གི་ནུས་པ་ལ་ཡིད་ཆེས་གཙང་མ་བསྐྱེད་དེ། དེ་ལ་བརྟེན་ནས་རང་རྒྱུད་ཀྱི་སྡིག་སྒྲིབ་དག་པར་བྱེད་པའི་བརྩོན་པ་ལྷུར་ལེན་པ།",
                        "function_in_hierarchy": "འདི་ནི་དཔེ་དྲུག་གི་ལྔ་པ་སྟེ། བྱང་ཆུབ་སེམས་ཀྱི་\"སྡིག་པ་དྲུངས་འབྱིན་གྱི་ནུས་པ་\"བསྟན་ནས། དེའི་ནུས་པ་ནི་ཤུགས་ཆེ་ཞིང་མྱུར་ལ་ཁྱབ་ཆེ་བའི་རང་བཞིན་གསལ་སྟོན་བྱེད།",
                        "inter_node_relationships": [],
                        "implicit_concepts": [
                          "སྟོབས་བཞིའི་བཤགས་པ།",
                          "སེམས་ཀྱི་རང་བཞིན་འོད་གསལ་བ།"
                        ],
                        "pedagogical_strategy": "བསམ་ཡུལ་ལས་འདས་པའི་དཔེ་ཤུགས་ཆེན་ཞིག་བཀོད་དེ། བྱང་ཆུབ་སེམས་ཀྱི་ནུས་པ་ཡང་དེ་བཞིན་བློ་ཡུལ་ལས་འདས་པ་ཡིན་པར་སྟོན་པ།",
                        "intended_impact_on_reader": "བྱང་ཆུབ་སེམས་ཀྱི་ནུས་པ་ལ་གདེང་ཚོད་དང་སྤོབས་པ་ཆེན་པོ་སྐྱེས་ཏེ། སྡིག་པ་སྦྱོང་བ་ལ་འབད་པ་བྱེད་པའི་སྤྲོ་བ་འཕེལ་བ།",
                        "audience_assumptions": "ཀློག་པ་པོས་བསྐལ་པའི་མེའི་སྐོར་གྱི་ནང་ཆོས་ཀྱི་འདོད་ཚུལ་ཤེས་ཀྱི་ཡོད་པར་ཆ་འཇོག་བྱེད།"
                      },
                      "children": []
                    },
                    {
                      "level": "sub-sub-subsection",
                      "number": "1.2.2.3.6",
                      "title": "Reference to Other Texts",
                      "verses_span": "16",
                      "summary": {
                        "content_summary": "ཚིགས་བཅད་འདིས་བྱང་ཆུབ་སེམས་ཀྱི་ཕན་ཡོན་འདིར་བསྟན་པ་ཙམ་དུ་མ་ཟད། དེ་ལས་ཀྱང་རྒྱ་ཆེ་ཞིང་དཔག་ཏུ་མེད་པ་རྣམས་ནི་རྒྱལ་ཚབ་བྱམས་མགོན་གྱིས་གཞོན་ནུ་ནོར་བཟང་ལ་སྡོང་པོ་བཀོད་པའི་མདོ་ལས་རྒྱ་ཆེར་བཤད་ཡོད་པས་དེ་ལས་ཤེས་པར་བྱ་ཞེས་ཞལ་འཕངས་པའམ་ལུང་གཞན་ལ་གཏུགས་པར་མཛད་ཡོད།",
                        "key_concepts": [
                          "ཕན་ཡོན་དཔག་ཏུ་མེད་པ།",
                          "བྱམས་མགོན།",
                          "ནོར་བཟང་།",
                          "ཞལ་འཕང་བ།"
                        ],
                        "transformative_goal": "བྱང་ཆུབ་སེམས་ཀྱི་ཕན་ཡོན་ལ་མཐའ་དང་ཚད་མེད་པར་རྟོགས་ཏེ། དེ་ལ་སློབ་སྦྱོང་དང་ཉམས་ལེན་བྱེད་པའི་འདུན་པ་རྒྱུན་མི་ཆད་པར་བྱེད་པ།",
                        "function_in_hierarchy": "འདི་ནི་དཔེ་དྲུག་གི་མཐའ་མ་སྟེ། འདིར་བཤད་པ་ནི་མཚོན་བྱེད་ཙམ་ཡིན་པ་དང་། ཕན་ཡོན་གྱི་རྒྱ་ཆེ་བ་ནི་མདོ་སྡེ་རྒྱ་ཆེན་པོ་དག་ན་ཡོད་པར་བསྟན་ནས། གཞུང་འདིའི་བརྗོད་བྱ་དེ་མདོ་སྡེ་ཆེན་པོ་དག་དང་མཐུན་པའི་ར་སྤྲོད་བྱེད་པ།",
                        "inter_node_relationships": [],
                        "implicit_concepts": [
                          "མདོ་སྡེའི་བསྟན་པ།",
                          "ཐོས་པའི་ཤེས་རབ།"
                        ],
                        "pedagogical_strategy": "གཞུང་གཞན་ལ་ཞལ་འཕངས་ནས་རང་གི་བསྟན་བཅོས་ལ་ཁུངས་བཙུན་པ་དང་། བརྗོད་བྱ་ལ་རྒྱ་ཆེ་བའི་རང་བཞིན་སྟོན་པ།",
                        "intended_impact_on_reader": "གཞུང་འདི་ལ་ཡིད་ཆེས་བརྟན་པོ་སྐྱེ་བ་དང་ཆབས་ཅིག མདོ་སྡེ་རྒྱ་ཆེན་པོ་རྣམས་ལ་སློབ་སྦྱོང་བྱེད་པའི་འདུན་པ་ཡང་སྐྱེ་བ།",
                        "audience_assumptions": "ཀློག་པ་པོས་བྱམས་པ་དང་ནོར་བཟང་གི་གཏམ་རྒྱུད་དང་། སྡོང་པོ་བཀོད་པའི་མདོ་སོགས་ལ་དོ་སྣང་བྱེད་པར་ཆ་འཇོག་བྱེད།"
                      },
                      "children": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "level": "section",
          "number": "1.3",
          "title": "Distinction between Aspiration and Engagement Bodhicitta",
          "verses_span": "17-29",
          "summary": {
            "content_summary": "ཚན་པ་འདིས་བྱང་ཆུབ་ཀྱི་སེམས་ལ་སྨོན་པ་དང་འཇུག་པ་ཞེས་དབྱེ་བ་གཉིས་ཡོད་ཚུལ་གསལ་བར་བྱས་ཡོད། དང་པོར་འགྲོ་འདོད་དང་འགྲོ་བཞིན་པའི་དཔེས་དེ་གཉིས་ཀྱི་ངོ་བོའི་ཁྱད་པར་བསྟན། དེ་ནས་ཕན་ཡོན་གྱི་ཁྱད་པར་བསྟན་ཏེ། སྨོན་སེམས་ལ་ཕན་ཡོན་ཆེ་ཡང་འཇུག་སེམས་ལྟར་བསོད་ནམས་རྒྱུན་ཆགས་སུ་མི་འབྱུང་ཚུལ་བཤད། མཐར་དེ་དག་གི་ཕན་ཡོན་གྱི་ཁྱད་པར་དེ་ལག་བཟང་གིས་ཞུས་པའི་མདོའི་ལུང་དང་། སེམས་ཅན་ལ་ཕན་འདོགས་པའི་བསམ་པའི་རིན་ཐང་གི་རིགས་པ་རྒྱ་ཆེར་བཀོད་ནས་བསྒྲུབས་ཡོད།",
            "key_concepts": [
              "སྨོན་པའི་སེམས།",
              "འཇུག་པའི་སེམས།",
              "ཕན་ཡོན་གྱི་ཁྱད་པར།",
              "རྒྱུན་ཆགས་ཀྱི་བསོད་ནམས།",
              "ལུང་གིས་སྒྲུབ་པ།",
              "རིགས་པས་སྒྲུབ་པ།"
            ],
            "transformative_goal": "སྨོན་འཇུག་སེམས་བསྐྱེད་གཉིས་ཀྱི་ཁྱད་པར་དང་གོ་རིམ་གསལ་པོར་རྟོགས་ནས། སྨོན་པ་ཙམ་གྱིས་ཆོག་ཤེས་མི་བྱེད་པར་འཇུག་པའི་སྡོམ་པ་དང་དུ་བླངས་ནས་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ལ་དངོས་སུ་བསླབ་པའི་འདུན་པ་བརྟན་པོ་བསྐྱེད་པ།",
            "function_in_hierarchy": "བྱང་ཆུབ་སེམས་ཀྱི་ཕན་ཡོན་སྤྱིར་བསྟན་པའི་རྗེས་སུ། དེ་ལ་དབྱེ་བ་ཕྱེ་ནས་ཁྱད་པར་གསལ་བར་བྱེད་པའི་ཚན་པ་འདིས་ཉམས་ལེན་གྱི་གོ་རིམ་དང་གནད་འགག་ཞིབ་ཚགས་སུ་བསྟན་ནས། ཀློག་པ་པོའི་ཤེས་རབ་ཀྱི་རྩལ་སྤེལ་བར་བྱེད།",
            "inter_node_relationships": [],
            "implicit_concepts": [
              "བསམ་པ་དང་སྦྱོར་བའི་ཁྱད་པར།",
              "སྡོམ་པའི་གལ་གནད།",
              "ཐབས་ལ་མཁས་པ།"
            ],
            "pedagogical_strategy": "ཐོག་མར་དབྱེ་བ་དང་དཔེས་གསལ་བཤད་བྱེད་པ། དེ་ནས་དེ་དག་གི་ཁྱད་པར་དངོས་བརྗོད་པ། མཐར་ལུང་དང་རིགས་པ་གཉིས་ཀྱིས་དེ་ཉིད་བརྟན་པོར་སྒྲུབ་པའི་ཐབས་ལམ་རིམ་ཅན་སྤྱོད་པ།",
            "intended_impact_on_reader": "སྨོན་འཇུག་སེམས་བསྐྱེད་གཉིས་ཀྱི་གོ་དོན་ལ་གོ་འཛོལ་མེད་པར་གསལ་པོར་ཤེས་ཤིང་། འཇུག་པའི་སེམས་བསྐྱེད་ཀྱི་བསོད་ནམས་དཔག་ཏུ་མེད་པ་ལ་ཡིད་སྨོན་སྐྱེས་ཏེ། དེ་ཉིད་དང་དུ་ལེན་པའི་སྤོབས་པ་སྐྱེ་བ།",
            "audience_assumptions": "ཀློག་པ་པོས་བྱང་ཆུབ་སེམས་ཀྱི་གོ་དོན་སྤྱིར་བཏང་ཤེས་ཀྱི་ཡོད་པ་དང་། དེའི་ནང་གསེས་ཀྱི་དབྱེ་བ་དང་ཁྱད་པར་ལ་ཤེས་འདོད་ཡོད་པར་ཆ་འཇོག་བྱེད།"
          },
          "children": [
            {
              "level": "subsection",
              "number": "1.3.1",
              "title": "Distinction between Aspiration and Engagement",
              "verses_span": "17-19",
              "summary": {
                "content_summary": "ཚན་པ་འདིས་བྱང་ཆུབ་ཀྱི་སེམས་ལ་ངོ་བོའི་སྒོ་ནས་དབྱེ་ན་སྨོན་པའི་སེམས་དང་འཇུག་པའི་སེམས་ཞེས་རྣམ་པ་གཉིས་སུ་ཡོད་པར་བསྟན། དེ་གཉིས་ཀྱི་ཁྱད་པར་ནི་དཔེར་ན་ཡུལ་ཞིག་ཏུ་འགྲོ་བར་འདོད་པའི་བསམ་པ་དང་དངོས་སུ་ལམ་དུ་ཞུགས་ནས་འགྲོ་བཞིན་པ་གཉིས་ཀྱི་ཁྱད་པར་ཇི་ལྟ་བ་བཞིན་ཡིན་པས། མཁས་པ་རྣམས་ཀྱིས་དེ་བཞིན་དུ་ཤེས་པར་བྱ་དགོས་པར་བསྟན་ཡོད།",
                "key_concepts": [
                  "སྨོན་པའི་སེམས།",
                  "འཇུག་པའི་སེམས།",
                  "རྣམ་པ་གཉིས།",
                  "འགྲོ་འདོད་དང་འགྲོ་བའི་དཔེ།"
                ],
                "transformative_goal": "སྨོན་འཇུག་སེམས་བསྐྱེད་གཉིས་ཀྱི་གོ་དོན་དང་ཁྱད་པར་གསལ་པོར་ཤེས་ནས། རང་གི་ཉམས་ལེན་གྱི་གནས་སྐབས་ངོས་ཟིན་པ་དང་། སྨོན་པ་ནས་འཇུག་པའི་ཕྱོགས་སུ་བསྐྱོད་དགོས་པའི་འདུན་པ་སྐྱེད་པ།",
                "function_in_hierarchy": "འདི་ནི་དབྱེ་བ་འབྱེད་པའི་ཚན་པའི་འགོ་འཛུགས་ས་ཡིན། དེས་ཐོག་མར་སྤྱིའི་དབྱེ་བ་ངོས་བཟུང་ནས། དཔེ་གསལ་པོ་ཞིག་གི་སྒོ་ནས་དེ་གཉིས་ཀྱི་གོ་དོན་རགས་པར་གསལ་སྟོན་བྱེད།",
                "inter_node_relationships": [],
                "implicit_concepts": [
                  "ཐོས་བསམ་གྱི་གོ་རིམ།",
                  "ལམ་གྱི་གནས་སྐབས།"
                ],
                "pedagogical_strategy": "ཐོག་མར་ངོས་འཛིན་བྱེད་པ། དེ་ནས་དཔེ་བཀོད་ནས་གསལ་བཤད་བྱེད་པའི་ཐབས་ལམ་སྤྱོད་པ།",
                "intended_impact_on_reader": "སྨོན་འཇུག་སེམས་གཉིས་ཀྱི་གོ་དོན་ཐད་གོ་རྟོགས་གསལ་པོ་དང་ཐེ་ཚོམ་མེད་པ་ཞིག་ཐོབ་པ།",
                "audience_assumptions": "ཀློག་པ་པོས་ཐེག་ཆེན་གྱི་ལམ་གྱི་གོ་རིམ་ལ་སློབ་སྦྱོང་བྱེད་པའི་འདུན་པ་ཡོད་པར་ཆ་འཇོག་བྱེད།"
              },
              "children": [
                {
                  "level": "sub-subsection",
                  "number": "1.3.1.1",
                  "title": "Two Kinds of Bodhicitta",
                  "verses_span": "17-18",
                  "summary": {
                    "content_summary": "ཚིགས་བཅད་འདིས་བྱང་ཆུབ་ཀྱི་སེམས་ལ་མདོར་བསྡུས་ན་རྣམ་པ་གཉིས་སུ་དབྱེ་རུ་ཡོད་དེ། གཅིག་ནི་སངས་རྒྱས་ཀྱི་གོ་འཕང་ཐོབ་པར་སྨོན་པའི་ \"བྱང་ཆུབ་སྨོན་པའི་སེམས་\" དང་། གཅིག་ཤོས་ནི་དེའི་ཐབས་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ལ་དངོས་སུ་འཇུག་པའི་ \"བྱང་ཆུབ་འཇུག་པའི་སེམས་\" ཉིད་ཡིན་ནོ།",
                    "key_concepts": [
                      "བྱང་ཆུབ་སེམས།",
                      "རྣམ་པ་གཉིས།",
                      "སྨོན་པའི་སེམས།",
                      "འཇུག་པའི་སེམས།"
                    ],
                    "transformative_goal": "བྱང་ཆུབ་སེམས་བསྐྱེད་ཀྱི་ལམ་ལ་གོ་རིམ་གཉིས་ཡོད་པ་གསལ་པོར་རྟོགས་ཏེ། ཉམས་ལེན་གྱི་རིམ་པ་ལ་གོ་འཛོལ་མེད་པར་བྱེད་པ།",
                    "function_in_hierarchy": "འདིས་བྱང་ཆུབ་ཀྱི་སེམས་ལ་ཐེངས་དང་པོར་ནང་གསེས་ཀྱི་དབྱེ་བ་གཉིས་ངོས་འཛིན་བྱས་ཏེ། འོག་ནས་དེ་དག་གི་ཁྱད་པར་ཞིབ་ཏུ་བཤད་པའི་གཞི་འདིང་བར་བྱེད།",
                    "inter_node_relationships": [],
                    "implicit_concepts": [
                      "ལམ་གྱི་རིམ་པ།",
                      "བསམ་པ་དང་སྦྱོར་བ།"
                    ],
                    "pedagogical_strategy": "ཐད་ཀར་ངོས་འཛིན་དང་དབྱེ་བ་འབྱེད་པའི་ཐབས་ལམ་བེད་སྤྱོད་བྱས་ཏེ། གནད་དོན་གསལ་པོར་འབུར་དུ་འདོན་པ།",
                    "intended_impact_on_reader": "བྱང་ཆུབ་ཀྱི་སེམས་ཞེས་པ་སྤྱི་ཙམ་མ་ཡིན་པར། དེ་ལ་སྨོན་པ་དང་འཇུག་པ་ཞེས་པའི་གནས་སྐབས་གཉིས་ཡོད་པའི་གོ་རྟོགས་གསར་པ་ཞིག་ཐོབ་པ།",
                    "audience_assumptions": "ཀློག་པ་པོས་བྱང་ཆུབ་སེམས་ཀྱི་གོ་དོན་སྤྱིར་བཏང་ཤེས་ཀྱི་ཡོད་པར་ཆ་འཇོག་བྱེད།"
                  },
                  "children": []
                },
                {
                  "level": "sub-subsection",
                  "number": "1.3.1.2",
                  "title": "Analogy for Distinction",
                  "verses_span": "19",
                  "summary": {
                    "content_summary": "ཚིགས་བཅད་འདིས་སྨོན་འཇུག་སེམས་གཉིས་ཀྱི་ཁྱད་པར་དེ་དཔེའི་སྒོ་ནས་གསལ་བཤད་མཛད་ཡོད། དཔེར་ན་ཡུལ་ཞིག་ཏུ་འགྲོ་བར་འདོད་པའི་བསམ་པ་དང་། དངོས་སུ་ལམ་དུ་ཞུགས་ནས་འགྲོ་བཞིན་པ་གཉིས་ལ་ཁྱད་པར་ཡོད་པ་ཇི་བཞིན་དུ། མཁས་པ་རྣམས་ཀྱིས་ཀྱང་སྨོན་སེམས་དང་འཇུག་སེམས་གཉིས་ཀྱི་ཁྱད་པར་དེ་བཞིན་དུ་རིམ་པ་བཞིན་ཤེས་པར་བྱ་དགོས་ཞེས་བསྟན་ཡོད།",
                    "key_concepts": [
                      "འགྲོ་བར་འདོད་པ།",
                      "འགྲོ་བ།",
                      "བྱེ་བྲག",
                      "མཁས་པས་ཤེས་པར་བྱ།"
                    ],
                    "transformative_goal": "དཔེ་དང་དོན་སྦྱར་ནས་སྨོན་འཇུག་གཉིས་ཀྱི་ཁྱད་པར་ལ་གོ་བ་གཏིང་ཟབ་ལོན་པ།",
                    "function_in_hierarchy": "དབྱེ་བ་ངོས་བཟུང་བའི་རྗེས་སུ་དཔེ་བཀོད་དེ། གོ་དོན་དེ་ཉིད་ཀློག་པ་པོའི་རྒྱུད་ལ་བརྟན་པོར་འཇགས་ཐབས་བྱེད་པ།",
                    "inter_node_relationships": [],
                    "implicit_concepts": [
                      "གฤษฎანская аналогия",
                      "རིགས་པའི་ལམ།"
                    ],
                    "pedagogical_strategy": "འཇིག་རྟེན་པའི་ཉམས་མྱོང་དང་མཐུན་པའི་དཔེ་ཞིག་བཀོད་དེ། ཆོས་ཀྱི་དོན་ཟབ་མོ་གོ་སླ་བར་བསྒྱུར་བ།",
                    "intended_impact_on_reader": "སྨོན་འཇུག་སེམས་གཉིས་ཀྱི་ཁྱད་པར་ནི་བསམ་བློ་གཏོང་འདོད་ཙམ་དང་ལག་ལེན་དངོས་གཉིས་ཀྱི་ཁྱད་པར་ལྟར་གསལ་པོ་དང་དངོས་ཡོད་ཡིན་པའི་ངེས་པ་རྙེད་པ།",
                    "audience_assumptions": "ཀློག་པ་པོས་འགྲོ་འདོད་དང་འགྲོ་བཞིན་པའི་དཔེ་དོན་ལ་གོ་བ་ལོན་ཐུབ་པར་ཆ་འཇོག་བྱེད།"
                  },
                  "children": []
                }
              ]
            },
            {
              "level": "subsection",
              "number": "1.3.2",
              "title": "Difference in Benefits",
              "verses_span": "20",
              "summary": {
                "content_summary": "ཚིགས་བཅད་འདིས་སྨོན་འཇུག་སེམས་གཉིས་ཀྱི་ཕན་ཡོན་གྱི་ཁྱད་པར་གཙོ་བོ་བསྟན་ཡོད། སྨོན་པའི་སེམས་ལས་འཁོར་བའི་ནང་འབྲས་བུ་ཆེན་པོ་འབྱུང་ཡང་། འཇུག་པའི་སེམས་བཞིན་དུ་བསོད་ནམས་རྒྱུན་ཆགས་སུ་འབྱུང་བ་མིན། གང་ཞིག་གིས་སེམས་ཅན་དགྲོལ་བའི་ཕྱིར་དུ་ཕྱིར་མི་ལྡོག་པའི་སེམས་ཀྱིས་འཇུག་སྡོམ་བླངས་པ་དེ་ནས་བཟུང་། གཉིད་ལོག་གམ་བག་མེད་དུ་གྱུར་ཀྱང་བསོད་ནམས་ཀྱི་ཤུགས་ནམ་མཁའ་མཉམ་པར་རྒྱུན་མི་འཆད་པར་འབྱུང་བར་བསྟན་ཡོད།",
                "key_concepts": [
                  "འབྲས་བུ་ཆེ་འབྱུང་།",
                  "བསོད་ནམས་རྒྱུན་ཆགས།",
                  "མི་ལྡོག་པའི་སེམས།",
                  "ནམ་མཁའ་མཉམ་པར་རབ་ཏུ་འབྱུང་།"
                ],
                "transformative_goal": "སྨོན་པ་ཙམ་ལ་བག་ཡངས་སུ་མི་སྡོད་པར། རྒྱུན་མི་ཆད་པའི་བསོད་ནམས་ཀྱི་རྒྱུན་འཐོབ་པའི་ཆེད་དུ་འཇུག་པའི་སྡོམ་པ་དང་དུ་བླངས་ནས་སྤྱོད་པ་ལ་བསླབ་པའི་འདུན་པ་དྲག་པོ་བསྐྱེད་པ།",
                "function_in_hierarchy": "སྨོན་འཇུག་གཉིས་ཀྱི་ངོ་བོའི་དབྱེ་བ་བསྟན་པའི་རྗེས། དེ་གཉིས་ཀྱི་འབྲས་བུའམ་ཕན་ཡོན་ལ་ཁྱད་པར་ཇི་ལྟར་ཡོད་པ་གསལ་སྟོན་བྱས་ཏེ། འཇུག་པའི་སེམས་ཀྱི་ཁྱད་འཕགས་ཀྱི་རང་བཞིན་སྔར་བས་ཀྱང་འབུར་དུ་འདོན་པ།",
                "inter_node_relationships": [],
                "implicit_concepts": [
                  "སྡོམ་པའི་ནུས་པ།",
                  "རྒྱུ་འབྲས་བསླུ་མེད།"
                ],
                "pedagogical_strategy": "ཕན་ཡོན་གྱི་ཁྱད་པར་ཆེ་ཆུང་གསལ་པོར་བསྡུར་ཏེ། གང་ཞིག་གལ་ཆེ་བ་དང་བརྩོན་པར་བྱ་ཡུལ་ཡིན་པ་དེ་ཀློག་པ་པོའི་ཡིད་ལ་ངེས་པར་བྱེད་པ།",
                "intended_impact_on_reader": "འཇུག་པའི་སེམས་བསྐྱེད་ལ་བསོད་ནམས་དཔག་ཏུ་མེད་ཅིང་རྒྱུན་མི་ཆད་པ་ཡོད་པར་ཤེས་ཏེ། དེ་ཉིད་ཐོབ་པའི་ཐབས་ལ་མྱུར་དུ་འཇུག་དགོས་པའི་བསམ་པ་སྐྱེ་བ།",
                "audience_assumptions": "ཀློག་པ་པོས་བསོད་ནམས་དང་དེའི་ཕན་ཡོན་གྱི་གལ་གནད་ལ་ཡིད་ཆེས་བྱེད་པར་ཆ་འཇོག་བྱེད།"
              },
              "children": []
            },
            {
              "level": "subsection",
              "number": "1.3.3",
              "title": "Establishing through Scripture and Reasoning",
              "verses_span": "21-29",
              "summary": {
                "content_summary": "ཚན་པ་འདིས་གོང་དུ་བསྟན་པའི་འཇུག་སེམས་ཀྱི་ཕན་ཡོན་དཔག་མེད་དེ་ལུང་དང་རིགས་པ་གཉིས་ཀྱི་སྒོ་ནས་བསྒྲུབས་ཡོད། དང་པོ་ལུང་ནི་ལག་བཟང་གིས་ཞུས་པའི་མདོ་ལས་དེ་བཞིན་གཤེགས་པས་གསུངས་པ་དེ་དཔང་དུ་བཞག་ཡོད། དེ་ནས་རིགས་པས་སྒྲུབ་པའི་ཚེ། སེམས་ཅན་ལ་ཕན་འདོགས་པའི་བསམ་པ་ཙམ་ལ་བསོད་ནམས་དཔག་མེད་ཡོད་ན། སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་སར་འགོད་པར་འདོད་པའི་བྱང་ཆུབ་ཀྱི་སེམས་ལ་བསོད་ནམས་དཔག་མེད་ཡོད་པ་སྨོས་ཅི་དགོས་ཞེས་དང་། ཕན་སེམས་དེ་ནི་འཇིག་རྟེན་གྱི་ལྷ་དང་དྲང་སྲོང་སོགས་ལའང་མེད་པའི་ཁྱད་ཆོས་ཡིན་པ། དེ་བཞིན་སེམས་ཅན་ལ་ཕན་འདོགས་པ་ནི་སངས་རྒྱས་མཆོད་པ་ལས་ཀྱང་ཕན་ཡོན་ཆེ་ཚུལ་སོགས་ཀྱིས་བསྒྲུབས་ཡོད།",
                "key_concepts": [
                  "ལག་བཟང་གིས་ཞུས་པའི་མདོ།",
                  "རིགས་པས་སྒྲུབ་པ།",
                  "ཕན་འདོགས་ཀྱི་བསམ་པ།",
                  "བསོད་ནམས་དཔག་མེད།",
                  "སངས་རྒྱས་མཆོད་པ་ལས་ཁྱད་འཕགས།"
                ],
                "transformative_goal": "བྱང་ཆུབ་སེམས་ཀྱི་ཕན་ཡོན་ལ་དད་པ་ཙམ་མ་ཡིན་པར། ལུང་དང་རིགས་པའི་རྒྱབ་རྟེན་ལ་བརྟེན་ནས་ཤེས་རབ་ཀྱི་གདེང་ཚོད་དང་ལྡན་པའི་ངེས་ཤེས་བརྟན་པོ་བསྐྱེད་པ།",
                "function_in_hierarchy": "ཕན་ཡོན་གྱི་ཁྱད་པར་བསྟན་པའི་དམ་བཅའ་དེ་ཉིད་སྒྲུབ་བྱེད་ཀྱི་རྒྱུ་མཚན་གྱི་ཚན་པ་ཡིན། དེས་ལུང་དང་རིགས་པ་གཉིས་ཀ་སྤྱད་དེ་གོང་གི་དོན་དེ་ཐེ་ཚོམ་གྱི་གནས་མེད་པར་བརྟན་པོར་སྒྲུབ་པར་བྱེད།",
                "inter_node_relationships": [],
                "implicit_concepts": [
                  "དད་པ་དང་ཤེས་རབ།",
                  "ཐེག་ཆེན་གྱི་ལྟ་བའི་ཁྱད་ཆོས།",
                  "སེམས་ཅན་དོན་བྱེད་ཀྱི་གལ་གནད།"
                ],
                "pedagogical_strategy": "ཐོག་མར་ཚད་མའི་ལུང་གིས་རྒྱབ་རྟེན་བྱེད་པ། དེ་ནས་རིགས་པའི་ལམ་ནས་གོ་སླ་བ་ནས་རིམ་བཞིན་གཏིང་ཟབ་པའི་སྒོ་ནས་གསལ་བཤད་བྱེད་པའི་ཐབས་ལམ་སྤྱོད་པ།",
                "intended_impact_on_reader": "བྱང་ཆུབ་ཀྱི་སེམས་ནི་ཚད་མ་གཉིས་ཀྱིས་གྲུབ་པའི་ཆོས་མཆོག་འཁྲུལ་མེད་ཅིག་ཡིན་པར་ངེས་པ་རྙེད་དེ། དེ་ལ་བརྟེན་པའི་བློ་སྟོབས་དང་སྤོབས་པ་ཆེན་པོ་སྐྱེ་བ།",
                "audience_assumptions": "ཀློག་པ་པོས་ལུང་དང་རིགས་པ་གཉིས་ནི་ཤེས་བྱ་ར་སྤྲོད་བྱེད་པའི་ཚད་མ་ཡིན་པར་ཁས་ལེན་པར་ཆ་འཇོག་བྱེད།"
              },
              "children": [
                {
                  "level": "sub-subsection",
                  "number": "1.3.3.1",
                  "title": "Establishing through Scripture",
                  "verses_span": "21",
                  "summary": {
                    "content_summary": "ཚིགས་བཅད་འདིས་གོང་དུ་བཤད་པའི་འཇུག་པའི་སེམས་བསྐྱེད་ལ་བག་མེད་དུའང་བསོད་ནམས་རྒྱུན་མི་ཆད་པར་འབྱུང་བའི་ཕན་ཡོན་དེ་ཉིད། རྒྱུ་མཚན་བཞི་དང་བཅས་པར་བྱང་ཆུབ་སེམས་དཔའ་ལག་བཟངས་ཀྱིས་ཞུས་པའི་མདོ་ལས། དམན་པའི་ལམ་ལ་མོས་པའི་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་དེ་བཞིན་གཤེགས་པ་ཉིད་ཀྱིས་གསུངས་ཡོད་པས། དེ་ནི་རང་བཟོ་མ་ཡིན་པར་ལུང་ཚད་མས་གྲུབ་པ་ཡིན་པར་བསྟན་ཡོད།",
                    "key_concepts": [
                      "འཐད་པ་དང་བཅས་པར།",
                      "ལག་བཟང་གིས་ཞུས་པ།",
                      "དེ་བཞིན་གཤེགས་པས་གསུངས།",
                      "ལུང་གིས་སྒྲུབ་པ།"
                    ],
                    "transformative_goal": "བྱང་ཆུབ་སེམས་ཀྱི་ཕན་ཡོན་ལ་ཐེ་ཚོམ་སྤངས་ཏེ། སངས་རྒྱས་ཀྱི་གསུང་ལ་ཡིད་ཆེས་བརྟན་པོ་བསྐྱེད་པ།",
                    "function_in_hierarchy": "འདི་ནི་སྒྲུབ་བྱེད་ཀྱི་ཡན་ལག་དང་པོ་སྟེ། རིགས་པས་མ་བསྒྲུབས་གོང་དུ་ཐོག་མར་ཁུངས་བཙུན་པའི་ལུང་ཞིག་དྲངས་ནས། གོང་གི་དམ་བཅའ་དེ་ལ་ཚད་མའི་རྒྱབ་རྟེན་ཡོད་པ་གསལ་སྟོན་བྱེད།",
                    "inter_node_relationships": [],
                    "implicit_concepts": [
                      "ལུང་གི་ཚད་མ།",
                      "བཀའི་རང་བཞིན།"
                    ],
                    "pedagogical_strategy": "ཚད་མར་གྱུར་པའི་གསུང་རབ་དཔང་པོར་བཞག་སྟེ། བརྗོད་དོན་ལ་ཡིད་ཆེས་བསྐྱེད་པའི་ཐབས་ལམ་སྤྱོད་པ།",
                    "intended_impact_on_reader": "འཇུག་སེམས་ཀྱི་ཕན་ཡོན་འདི་ནི་སློབ་དཔོན་གྱི་བཞེད་པ་ཙམ་མ་ཡིན་པར། སངས་རྒྱས་ཀྱི་བཀའ་དངོས་ཡིན་པར་ཤེས་ཏེ། དེ་ལ་དད་པ་དང་གུས་པ་ལྡོག་མེད་ཅིག་སྐྱེ་བ།",
                    "audience_assumptions": "ཀློག་པ་པོས་སངས་རྒྱས་ཀྱི་གསུང་ནི་ཚད་མ་ཡིན་པར་ཁས་ལེན་པར་ཆ་འཇོག་བྱེད།"
                  },
                  "children": []
                },
                {
                  "level": "sub-subsection",
                  "number": "1.3.3.2",
                  "title": "Establishing through Reasoning",
                  "verses_span": "22-29",
                  "summary": {
                    "content_summary": "ཚན་པ་འདིས་རིགས་པའི་སྒོ་ནས་བྱང་ཆུབ་སེམས་ཀྱི་ཕན་ཡོན་བསྒྲུབས་ཡོད། དང་པོ་སེམས་ཅན་ལ་ཕན་འདོགས་པའི་བསམ་པ་ཙམ་ལ་བསོད་ནམས་དཔག་མེད་ཡོད་ན། སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་སར་འགོད་པའི་བསམ་པ་ལ་སྨོས་ཅི་དགོས་ཞེས་དང༌། ཕན་སེམས་དེ་འདྲ་ལྷ་དང་དྲང་སྲོང་སོགས་ལའང་མེད་པའི་ཁྱད་ཆོས་བསྟན། གཉིས་པར་སེམས་ཅན་ལ་ཕན་འདོགས་པ་ནི་སངས་རྒྱས་མཆོད་པ་ལས་ཀྱང་ཁྱད་པར་འཕགས་པར་བསྟན། གསུམ་པར་སེམས་ཅན་རྣམས་བདེ་བ་འདོད་ཀྱང་སྡུག་བསྔལ་སྒྲུབ་པའི་གཏི་མུག་ཅན་ཡིན་པས། དེ་དག་ལ་བདེ་བ་སྟེར་ཞིང་སྡུག་བསྔལ་སེལ་བའི་བྱང་ཆུབ་ཀྱི་སེམས་དང་མཚུངས་པའི་དགེ་བ་དང་བཤེས་གཉེན་གཞན་གང་ཡང་མེད་པར་བསྟན་ཡོད།",
                    "key_concepts": [
                      "ཕན་འདོགས་བསམ་པ།",
                      "བསོད་ནམས་དཔག་མེད།",
                      "སེམས་ཀྱི་རིན་ཆེན།",
                      "སངས་རྒྱས་མཆོད་ལས་ཁྱད་འཕགས།",
                      "གཏི་མུག",
                      "དགེ་མཚུངས་ག་ལ་ཡོད།"
                    ],
                    "transformative_goal": "བྱང་ཆུབ་ཀྱི་སེམས་ནི་བློ་གྲོས་ཀྱི་རིགས་པས་དཔྱད་ནའང་རིན་ཐང་དང་ཕན་ཡོན་བླ་ན་མེད་པ་ཞིག་ཡིན་པར་ངེས་ཤེས་གཏིང་ཚུགས་པ་བསྐྱེད་པ།",
                    "function_in_hierarchy": "ལུང་གིས་བསྒྲུབས་པའི་རྗེས་སུ། རིགས་པའི་ལམ་ནས་དོན་དེ་ཉིད་ཀློག་པ་པོའི་བློ་ངོར་གསལ་ཞིང་བརྟན་པོར་བཀོད་དེ། དད་པ་ཙམ་མ་ཡིན་པར་ཤེས་རབ་ཀྱིས་རྟོགས་པར་བྱེད་པ།",
                    "inter_node_relationships": [],
                    "implicit_concepts": [
                      "སེམས་ཅན་གྱི་གཅེས་འཛིན།",
                      "ཐབས་དང་ཤེས་རབ་ཀྱི་འབྲེལ་བ།"
                    ],
                    "pedagogical_strategy": "རིགས་པ་རིམ་པ་གསུམ་གྱི་སྒོ་ནས་བསྒྲུབ་པ་སྟེ། དང་པོ་བསམ་པའི་ཁྱད་པར། གཉིས་པ་ཡུལ་གྱི་ཁྱད་པར། གསུམ་པ་སེམས་ཅན་གྱི་གནས་སྟངས་ལ་བརྟེན་ནས་སྒྲུབ་པ།",
                    "intended_impact_on_reader": "བྱང་ཆུབ་ཀྱི་སེམས་ལ་ཡིད་ཆེས་བརྟན་པོ་སྐྱེ་བ་མ་ཟད། དེ་ཉིད་རིགས་པའི་ལམ་ནས་གཞན་ལ་འགྲེལ་བཤད་བྱེད་ཐུབ་པའི་ནུས་པ་དང་སྤོབས་པ་སྐྱེ་བ།",
                    "audience_assumptions": "ཀློག་པ་པོས་རྒྱུ་འབྲས་དང་རིགས་པའི་གཏན་ཚིགས་ལ་བརྟེན་ནས་བདེན་པ་འཚོལ་བའི་བསམ་བློའི་གོམས་སྲོལ་ཡོད་པར་ཆ་འཇོག་བྱེད།"
                  },
                  "children": [
                    {
                      "level": "sub-sub-subsection",
                      "number": "1.3.3.2.1",
                      "title": "Superiority of Bodhicitta's Intention",
                      "verses_span": "22-26",
                      "summary": {
                        "content_summary": "ཚན་པ་འདིས་རིགས་པའི་སྒོ་ནས་བྱང་ཆུབ་སེམས་ཀྱི་བསམ་པའི་ཁྱད་ཆོས་བསྟན་ཡོད། སེམས་ཅན་གྱི་ཀླད་ནད་ཙམ་བསལ་བར་བསམས་པ་ལའང་བསོད་ནམས་དཔག་མེད་ཡོད་ན། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་མཐའ་དག་བསལ་ནས་སངས་རྒྱས་ཀྱི་གོ་འཕང་ལ་འགོད་པར་འདོད་པའི་བསམ་པ་ལ་སྨོས་ཅི་དགོས། བསམ་པ་འདི་ལྟ་བུ་ནི་རང་གི་ཕ་མ་དང་། འཇིག་རྟེན་གྱི་ལྷ་དང་དྲང་སྲོང་ཚངས་པ་སོགས་ལའང་མེད་པ། ཐ་ན་སེམས་ཅན་རྣམས་ཀྱིས་རང་གི་དོན་དུའང་རྨི་ལམ་དུའང་མ་རྨིས་པའི་བསམ་པ་ཁྱད་པར་ཅན་ཞིག་ཡིན་པས། དེའི་བསོད་ནམས་ནི་གཞལ་དུ་མེད་པར་བསྟན་ཡོད།",
                        "key_concepts": [
                          "ཕན་འདོགས་བསམ་པ།",
                          "བསོད་ནམས་དཔག་མེད།",
                          "ཕ་མ།",
                          "སེམས་ཀྱི་རིན་ཆེན་ཁྱད་པར།",
                          "གཞལ་གྱིས་མི་ལང་།"
                        ],
                        "transformative_goal": "བྱང་ཆུབ་ཀྱི་སེམས་ནི་འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་བསམ་པ་ཐམས་ཅད་ཀྱི་ནང་ནས་ཁྱད་དུ་འཕགས་ཤིང་རྨད་དུ་བྱུང་བ་ཞིག་ཡིན་པར་རྟོགས་ནས། དེ་ལ་གཅེས་སྤྲས་དང་སྤོབས་པ་ཆེན་པོ་བསྐྱེད་པ།",
                        "function_in_hierarchy": "འདི་ནི་རིགས་པས་སྒྲུབ་པའི་གོམ་པ་དང་པོ་སྟེ། བསམ་པའི་རྒྱ་ཆེ་ཆུང་དང་ཁྱད་ཆོས་ལ་བརྟེན་ནས་བྱང་ཆུབ་སེམས་ཀྱི་རིན་ཐང་བླ་ན་མེད་པ་དེ་བསྒྲུབ་པར་བྱེད།",
                        "inter_node_relationships": [],
                        "implicit_concepts": [
                          "ཀུན་སློང་གི་སྟོབས།",
                          "ཐེག་ཆེན་གྱི་རླབས་ཆེན་གྱི་སྤྱོད་པ།"
                        ],
                        "pedagogical_strategy": "རིགས་པ་རིམ་བགྲོད་ཀྱི་ཐབས་ལམ་སྤྱོད་པ་སྟེ། དང་པོ་དཔེ་ཆུང་ངུ་ཞིག་བཀོད་པ། དེ་ནས་དེ་དང་བསྡུར་ནས་བྱང་ཆུབ་སེམས་ཀྱི་རྒྱ་ཆེ་བ་སྟོན་པ། དེ་ནས་འཇིག་རྟེན་གྱི་བསམ་པ་གཞན་དང་བསྡུར་ནས་ཁྱད་ཆོས་འབུར་དུ་འདོན་པ།",
                        "intended_impact_on_reader": "རང་རྒྱུད་ལ་བྱང་ཆུབ་ཀྱི་སེམས་སྐྱེས་པ་ནི་འཇིག་རྟེན་ན་ཤིན་ཏུ་རྙེད་པར་དཀའ་བའི་རིན་ཆེན་ཞིག་རྙེད་པ་དང་འདྲ་བར་དགའ་བ་དང་སྤྲོ་བ་ཆེན་པོ་སྐྱེ་བ།",
                        "audience_assumptions": "ཀློག་པ་པོས་བསོད་ནམས་ཀྱི་གོ་དོན་དང་། ཕ་མ་དང་ལྷ་སོགས་ཀྱི་བྱམས་བརྩེའི་ཚད་གཞི་རགས་ཙམ་ཤེས་ཀྱི་ཡོད་པར་ཆ་འཇོག་བྱེད།"
                      },
                      "children": []
                    },
                    {
                      "level": "sub-sub-subsection",
                      "number": "1.3.3.2.2",
                      "title": "Comparison with Offering to Buddhas",
                      "verses_span": "27",
                      "summary": {
                        "content_summary": "ཚིགས་བཅད་འདིས་བྱང་ཆུབ་སེམས་ཀྱི་ཕན་ཡོན་དེ་སངས་རྒྱས་མཆོད་པ་དང་བསྡུར་ནས་བསྟན་ཡོད། སེམས་ཅན་ལ་ཕན་པར་བསམས་པ་ཙམ་གྱིས་ཀྱང་སངས་རྒྱས་རྣམས་ལ་དངོས་པོའི་མཆོད་པ་ཕུལ་བ་ལས་ཕན་ཡོན་ཁྱད་པར་དུ་འཕགས་ན། སེམས་ཅན་མ་ལུས་པ་ཐམས་ཅད་ཀྱི་དོན་དུ་སངས་རྒྱས་ཀྱི་བདེ་བ་སྒྲུབ་པའི་སྤྱོད་པ་ལ་བརྩོན་པ་ནི་དེ་བས་ཀྱང་ཕན་ཡོན་ཆེ་བ་སྨོས་ཅི་དགོས་ཞེས་བསྟན་ཡོད།",
                        "key_concepts": [
                          "ཕན་པར་བསམས་པ་ཙམ།",
                          "སངས་རྒྱས་མཆོད་ལས།",
                          "ཁྱད་འཕགས།",
                          "བདེ་དོན་བརྩོན་པ།"
                        ],
                        "transformative_goal": "སངས་རྒྱས་དགྱེས་པའི་མཆོད་པ་མཆོག་ནི་སེམས་ཅན་ལ་ཕན་འདོགས་པ་ཡིན་པར་རྟོགས་ཏེ། རང་གི་ཉམས་ལེན་གྱི་གཙོ་བོ་དེ་སེམས་ཅན་དོན་བྱེད་ལ་གཏོད་པ།",
                        "function_in_hierarchy": "འདི་ནི་རིགས་པས་སྒྲུབ་པའི་གོམ་པ་གཉིས་པ་སྟེ། ཡུལ་སངས་རྒྱས་དང་སེམས་ཅན་གཉིས་ལ་ཕན་འདོགས་པའི་བསོད་ནམས་བསྡུར་ཏེ། སེམས་ཅན་ལ་ཕན་འདོགས་པའི་གལ་གནད་དང་ཕན་ཡོན་ཆེ་བ་སྒྲུབ་པར་བྱེད།",
                        "inter_node_relationships": [],
                        "implicit_concepts": [
                          "སངས་རྒྱས་ཀྱི་ཐུགས་རྗེ།",
                          "ཐབས་མཁས་ཀྱི་མཆོད་པ།"
                        ],
                        "pedagogical_strategy": "བསྡུར་བའི་ཐབས་ལམ་སྤྱད་དེ། ཀུན་གྱིས་བསོད་ནམས་ཆེན་པོར་བརྩི་བའི་སངས་རྒྱས་མཆོད་པ་ལས་ཀྱང་བྱང་ཆུབ་སེམས་ཀྱི་ཕན་ཡོན་ཆེ་བར་བསྟན་ནས། དེའི་རིན་ཐང་གཞལ་དུ་མེད་པ་དེ་ནན་ཏན་དུ་སྟོན་པ།",
                        "intended_impact_on_reader": "སངས་རྒྱས་ལ་དངོས་པོའི་མཆོད་པ་འབུལ་རྒྱུ་མ་འབྱོར་ཡང་། སེམས་ཅན་ལ་ཕན་པའི་བསམ་པ་བཟང་པོ་བཅངས་པ་ཙམ་གྱིས་ཀྱང་བསོད་ནམས་དཔག་མེད་གསོག་ཐུབ་པའི་གདེང་ཚོད་དང་སྤྲོ་བ་སྐྱེ་བ།",
                        "audience_assumptions": "ཀློག་པ་པོས་སངས་རྒྱས་ལ་མཆོད་པ་ཕུལ་ན་བསོད་ནམས་ཆེན་པོ་ཡོད་པར་ཡིད་ཆེས་བྱེད་པར་ཆ་འཇོག་བྱེད།"
                      },
                      "children": []
                    },
                    {
                      "level": "sub-sub-subsection",
                      "number": "1.3.3.2.3",
                      "title": "Ignorance and Suffering",
                      "verses_span": "28-29",
                      "summary": {
                        "content_summary": "ཚིགས་བཅད་འདི་གཉིས་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་གནས་སྟངས་ལ་བརྟེན་ནས་བྱང་ཆུབ་སེམས་ཀྱི་རིན་ཐང་བསྒྲུབས་ཡོད། སེམས་ཅན་རྣམས་སྡུག་བསྔལ་མི་འདོད་ཀྱང་སྡུག་བསྔལ་གྱི་རྒྱུ་ལ་རྒྱུག་པ་དང་། བདེ་བ་འདོད་ཀྱང་གཏི་མུག་གིས་རང་གི་བདེ་བ་འཇོམས་པར་བྱེད། དེར་བརྟེན་བདེ་བས་ཕོངས་ཤིང་སྡུག་བསྔལ་གྱིས་མནར་བའི་སེམས་ཅན་དེ་དག་ལ་བདེ་བ་སྟེར་ཞིང་། སྡུག་བསྔལ་སེལ་བ། གཏི་མུག་སེལ་བར་བྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་དང་དེའི་རྒྱུ་བྱང་ཆུབ་ཀྱི་སེམས་དང་མཚུངས་པའི་དགེ་བ་དང་བཤེས་གཉེན་གཞན་གང་ཡང་མེད་པར་བསྟན་ཡོད།",
                        "key_concepts": [
                          "སྡུག་བསྔལ་ཉིད་ལ་རྒྱུག",
                          "གཏི་མུག",
                          "བདེ་བ་དགྲ་ལྟར་འཇོམས།",
                          "དགེ་མཚུངས་ག་ལ་ཡོད།"
                        ],
                        "transformative_goal": "སེམས་ཅན་རྣམས་ཀྱི་སྡུག་བསྔལ་དང་གཏི་མུག་ལ་སྙིང་རྗེ་དྲག་པོ་བསྐྱེད་པ་དང་ཆབས་ཅིག དེ་དག་ལ་ཕན་འདོགས་པའི་ཐབས་མཆོག་ནི་བྱང་ཆུབ་ཀྱི་སེམས་ཡིན་པར་ངེས་ཤེས་བརྟན་པོ་སྐྱེད་པ།",
                        "function_in_hierarchy": "འདི་ནི་རིགས་པས་སྒྲུབ་པའི་གོམ་པ་གསུམ་པ་སྟེ། སེམས་ཅན་གྱི་དགོས་མཁོ་དང་གནས་སྟངས་དངོས་ལ་བརྟེན་ནས། བྱང་ཆུབ་ཀྱི་སེམས་ནི་དགོས་མཁོ་དེ་སྐོང་བའི་ཐབས་གཅིག་པུ་ཡིན་པར་བསྒྲུབས་ཏེ། དེའི་རིན་ཐང་དེ་དོན་དངོས་དང་སྦྲེལ་བར་བྱེད།",
                        "inter_node_relationships": [],
                        "implicit_concepts": [
                          "སྙིང་རྗེ་ཆེན་པོ།",
                          "ཤེས་རབ་ཆེན་པོ།",
                          "བྱམས་པ་ཆེན་པོ།"
                        ],
                        "pedagogical_strategy": "སེམས་ཅན་གྱི་གནས་སྟངས་སྐྱོ་བོ་དེ་གསལ་པོར་བསྟན་ནས། དེ་ལ་ཕན་འདོགས་པའི་བྱང་ཆུབ་སེམས་ཀྱི་རིན་ཐང་དེ་ཤུགས་ཀྱིས་མངོན་པར་བྱེད་པའི་ཐབས་ལམ་སྤྱོད་པ།",
                        "intended_impact_on_reader": "སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་དྲག་པོ་སྐྱེ་བ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ནི་དེ་དག་སྐྱོབ་པའི་ཐབས་མཆོག་ཡིན་པར་མཐོང་ནས། དེ་ཉིད་རྒྱུད་ལ་བསྐྱེད་པའི་འགན་འཁྲི་དང་སྤྲོ་བ་ཆེན་པོ་སྐྱེ་བ།",
                        "audience_assumptions": "ཀློག་པ་པོས་འཁོར་བའི་སེམས་ཅན་རྣམས་སྡུག་བསྔལ་གྱི་རང་བཞིན་ཅན་ཡིན་པར་ཁས་ལེན་པར་ཆ་འཇོག་བྱེད།"
                      },
                      "children": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "level": "section",
          "number": "1.4",
          "title": "Greatness of the Person Endowed with Bodhicitta",
          "verses_span": "30-36",
          "summary": {
            "content_summary": "ཚན་པ་འདིས་བྱང་ཆུབ་ཀྱི་སེམས་དང་ལྡན་པའི་གང་ཟག་གི་ཆེ་བ་དང་རིན་ཐང་བསྟན་ཡོད། དང་པོར་བྱང་སེམས་ནི་མ་བཅོལ་བར་གཞན་དོན་བྱེད་པས་བསྔགས་པའི་འོས་སུ་གྱུར་ཚུལ་དང་། ཁོང་གི་སྦྱིན་པ་ནི་འཇིག་རྟེན་གྱི་སྦྱིན་པ་ཕལ་པ་ལས་ እጅግ የላቀ መሆኑንབསྟན། གཉིས་པར་བྱང་སེམས་ལ་དད་པ་དང་སྡང་སེམས་བྱས་པའི་ཕན་གནོད་ཀྱི་འབྲས་བུ་ཤིན་ཏུ་ཆེ་བར་བསྟན། མཐར་བྱང་སེམས་ནི་རྐྱེན་ངན་གྱིས་མི་ཚུགས་ཤིང་དགེ་བ་ངང་གིས་འཕེལ་བའི་རང་བཞིན་ཅན་དང་། འབྲེལ་ཚད་དོན་ལྡན་ཡིན་པས་སྐྱབས་ཀྱི་གནས་མཆོག་ཏུ་གྱུར་པ་བཅས་བསྟན་ཡོད།",
            "key_concepts": [
              "མ་བཅོལ་ལེགས་བྱེད།",
              "སྦྱིན་བདག",
              "ངན་སེམས་ཀྱི་འབྲས་བུ།",
              "དགེ་བ་ངང་གིས་འཕེལ།",
              "བདེ་བའི་འབྱུང་གནས།",
              "སྐྱབས་སུ་མཆི།"
            ],
            "transformative_goal": "བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་འཇིག་རྟེན་གྱི་ནོར་བུ་དང་སྐྱབས་གནས་དམ་པ་ཡིན་པར་ངོས་ཟིན་ནས། ཁོང་རྣམས་ལ་གུས་པ་དང་དག་སྣང་སྦྱོང་ཞིང་། རང་ཉིད་ཀྱང་དེ་འདྲའི་གང་ཟག་ཅིག་ཏུ་འགྱུར་བའི་སྨོན་འདུན་དྲག་པོ་བསྐྱེད་པ།",
            "function_in_hierarchy": "བྱང་ཆུབ་སེམས་ཀྱི་ཕན་ཡོན་བཤད་པའི་མཇུག་ཏུ། སེམས་དེ་དང་ལྡན་པའི་གང་ཟག་གི་ཆེ་བ་བརྗོད་དེ། ལམ་གྱི་རིན་ཐང་དེ་ལམ་ལ་བརྟེན་པའི་གང་ཟག་གི་རིན་ཐང་བརྒྱུད་ནས་སྔར་ལས་ཀྱང་གསལ་བར་བྱེད་པ། དེས་ཀློག་པ་པོ་ལ་མིག་དཔེ་དང་བློ་སྐྱེད་ཆེན་པོ་སྦྱིན་པར་བྱེད།",
            "inter_node_relationships": [],
            "implicit_concepts": [
              "དག་སྣང་སྦྱོང་བ།",
              "ཞིང་གི་ཁྱད་པར།",
              "རྐྱེན་ངན་ལམ་དུ་བསྒྱུར་བ།"
            ],
            "pedagogical_strategy": "དང་པོ་བསྔགས་འོས་ཀྱི་རྒྱུ་མཚན་བརྗོད་པ། དེ་ནས་དེ་ལ་བརྟེན་པའི་ལས་འབྲས་ཀྱི་ཤུགས་ཆེ་ཚུལ་བསྟན་པ། མཐར་དེ་དག་གི་ནང་གི་ཡོན་ཏན་དང་སྐྱབས་ཀྱི་རང་བཞིན་བསྟན་ཏེ། གུས་པ་དང་དད་པ་སྐྱེ་བའི་རིམ་པ་ཞིག་བསྒྲིགས་ཡོད།",
            "intended_impact_on_reader": "བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་དད་གུས་དང་དག་སྣང་ལྡོག་མེད་ཅིག་སྐྱེ་བ་དང་། ཁོང་ཚོའི་རྗེས་སུ་སློབ་པའི་སྤྲོ་བ་དང་སྤོབས་པ་ཆེན་པོ་སྐྱེ་བ། སེམས་ཅན་སུ་ལའང་སྐྱོན་འཚོལ་གྱི་བློ་སྤངས་ནས་དག་སྣང་སྦྱོང་དགོས་པའི་གདམས་ངག་ཐོབ་པ།",
            "audience_assumptions": "ཀློག་པ་པོས་ལས་འབྲས་ཀྱི་རྣམ་བཞག་དང་། སྐྱབས་འགྲོའི་གོ་དོན་ལ་ཡིད་ཆེས་བྱེད་པར་ཆ་འཇོག་བྱེད།"
          },
          "children": [
            {
              "level": "subsection",
              "number": "1.4.1",
              "title": "Worthiness of Praise",
              "verses_span": "30-32",
              "summary": {
                "content_summary": "ཚན་པ་འདིས་བྱང་ཆུབ་སེམས་དཔའ་བསྔགས་པར་འོས་པའི་རྒྱུ་མཚན་བསྟན་ཡོད། ཕན་བཏགས་པའི་ལན་འཇལ་བ་ཙམ་ལའང་བསྔགས་འོས་ན། སུས་ཀྱང་མ་བཅོལ་བར་གཞན་དོན་ལྷུར་ལེན་གནང་མཁན་བྱང་སེམས་རྣམས་སྨོས་ཅི་དགོས། དེ་བཞིན་འཇིག་རྟེན་འདིར་ཟས་དང་གོས་ཀྱི་སྦྱིན་པ་ཕྲན་བུ་གཏོང་མཁན་ལའང་བཀུར་བར་བྱེད་ན། བྱང་སེམས་རྣམས་ཀྱིས་སེམས་ཅན་གྲངས་མེད་ལ་དུས་ཡུན་རིང་པོར་སངས་རྒྱས་ཀྱི་བདེ་བ་བླ་ན་མེད་པ་སྦྱིན་པར་མཛད་པས། དེ་དག་ནི་དེ་བས་ཀྱང་བསྔགས་འོས་སུ་གྱུར་པ་ཡིན་པར་བསྟན་ཡོད།",
                "key_concepts": [
                  "ཕན་བཏགས་ལན་ལྡོན།",
                  "མ་བཅོལ་ལེགས་པར་བྱེད་པ།",
                  "སྦྱིན་པ།",
                  "བདེ་བ་བླ་ན་མེད།"
                ],
                "transformative_goal": "བྱང་ཆུབ་སེམས་དཔའི་བཀའ་དྲིན་དང་རླབས་ཆེན་གྱི་སྤྱོད་པ་རྗེས་སུ་དྲན་ཏེ། ཁོང་རྣམས་ལ་གུས་པ་དང་བཀུར་སྟི་བྱེད་པའི་བསམ་པ་བརྟན་པོ་བསྐྱེད་པ།",
                "function_in_hierarchy": "འདི་ནི་བྱང་སེམས་ཀྱི་ཆེ་བ་བརྗོད་པའི་གོམ་པ་དང་པོ་སྟེ། འཇིག་རྟེན་གྱི་བཟང་པོའི་ཚད་གཞི་དང་བསྡུར་ནས། བྱང་སེམས་ཀྱི་སྤྱོད་པ་དེ་དག་ལས་ እጅግ የላቀ መሆኑንགསལ་སྟོན་བྱེད།",
                "inter_node_relationships": [],
                "implicit_concepts": [
                  "བཀའ་དྲིན་རྗེས་དྲན།",
                  "སྦྱིན་པའི་ཕར་ཕྱིན།"
                ],
                "pedagogical_strategy": "རིགས་པ་བསྡུར་བའི་ཐབས་ལམ་སྤྱོད་པ་སྟེ། འཇིག་རྟེན་པའི་དགེ་བ་ཆུང་ངུ་དང་བྱང་སེམས་ཀྱི་དགེ་བ་ཆེན་པོ་གཉིས་བསྡུར་ནས། བྱང་སེམས་ཀྱི་ཁྱད་འཕགས་ཀྱི་རང་བཞིན་དེ་ཤུགས་ཀྱིས་མངོན་པར་བྱེད་པ།",
                "intended_impact_on_reader": "བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་པ་དང་སྦྱོར་བ་ལ་ཡིད་རངས་ཤིང་དད་པ་སྐྱེས་ཏེ། ཁོང་རྣམས་ལ་གུས་པས་བསྟོད་བསྔགས་བྱེད་འདོད་ཀྱི་བསམ་པ་སྐྱེ་བ།",
                "audience_assumptions": "ཀློག་པ་པོས་འཇིག་རྟེན་དུ་གང་ཞིག་བཟང་པོ་དང་བསྔགས་འོས་སུ་བརྩི་བའི་སྤྱི་ཚོགས་ཀྱི་ལྟ་བ་ཤེས་ཀྱི་ཡོད་པར་ཆ་འཇོག་བྱེད།"
              },
              "children": []
            },
            {
              "level": "subsection",
              "number": "1.4.2",
              "title": "Consequences of Actions towards Bodhisattvas",
              "verses_span": "33-34",
              "summary": {
                "content_summary": "ཚིགས་བཅད་འདི་གཉིས་ཀྱིས་རྒྱལ་སྲས་བྱང་ཆུབ་སེམས་དཔའ་ལ་བསམ་སྦྱོར་བཟང་ངན་བྱས་པའི་འབྲས་བུ་ཤིན་ཏུ་ཆེ་བར་བསྟན་ཡོད། གལ་ཏེ་བྱང་སེམས་ལ་ངན་སེམས་སྐད་ཅིག་ཙམ་བསྐྱེད་ན། དེའི་གྲངས་བཞིན་བསྐལ་པར་དམྱལ་བར་གནས་དགོས་པར་ཐུབ་པས་གསུངས། དེ་ལས་ལྡོག་སྟེ་ཡིད་དངས་ཤིང་དགའ་བས་བལྟས་པ་སོགས་བྱས་ན། དེའི་འབྲས་བུ་ནི་སྡིག་པའི་འབྲས་བུ་དེ་ལས་ཀྱང་ལྷག་པར་འཕེལ་བར་འགྱུར་རོ།",
                "key_concepts": [
                  "རྒྱལ་སྲས་སྦྱིན་བདག",
                  "ངན་སེམས།",
                  "དམྱལ་བར་གནས་པ།",
                  "འབྲས་བུ་ལྷག་པར་འཕེལ།"
                ],
                "transformative_goal": "བྱང་ཆུབ་སེམས་དཔའ་ནི་བསོད་ནམས་ཀྱི་ཞིང་མཆོག་ཡིན་པར་རྟོགས་ཏེ། དེ་དག་ལ་སྡང་སེམས་དང་ལོག་ལྟ་སྐད་ཅིག་ཙམ་ཡང་མི་སྐྱེད་པར་དད་གུས་དང་དག་སྣང་སྦྱོང་བའི་བློ་བརྟན་པོ་བསྐྱེད་པ།",
                "function_in_hierarchy": "བྱང་སེམས་བསྔགས་འོས་སུ་བསྟན་པའི་རྗེས། ཁོང་རྣམས་ལ་བརྟེན་པའི་ལས་ཀྱི་འབྲས་བུ་ཤིན་ཏུ་ཆེ་བར་བསྟན་ནས། དེ་དག་ལ་ཇི་ལྟར་བསྟེན་དགོས་པའི་ཐབས་ལམ་གསལ་སྟོན་བྱེད།",
                "inter_node_relationships": [],
                "implicit_concepts": [
                  "ལས་འབྲས་བསླུ་མེད།",
                  "ཞིང་གི་སྟོབས།"
                ],
                "pedagogical_strategy": "ཕན་གནོད་ཀྱི་འབྲས་བུ་གཉིས་གཤིབ་བསྡུར་གྱིས་བསྟན་ནས། བླང་དོར་གྱི་གནད་འགག་དེ་ཤུགས་ཆེན་པོའི་སྒོ་ནས་ཀློག་པ་པོའི་ཡིད་ལ་འཇགས་ཐབས་བྱེད་པ།",
                "intended_impact_on_reader": "སེམས་ཅན་སྤྱི་དང་ལྷག་པར་དུ་བྱང་སེམས་ལ་ངན་སེམས་བསྐྱེད་པའི་ཉེས་དམིགས་ལ་འཇིགས་སྐྲག་སྐྱེས་ཏེ། བག་ཟོན་དང་དྲན་ཤེས་ཀྱིས་རང་རྒྱུད་སྲུང་བའི་འདུན་པ་དྲག་པོ་སྐྱེ་བ།",
                "audience_assumptions": "ཀློག་པ་པོས་ལས་འབྲས་ཀྱི་རྣམ་བཞག་གི་རྩ་བའི་གོ་དོན་ཤེས་ཀྱི་ཡོད་པར་ཆ་འཇོག་བྱེད།"
              },
              "children": []
            },
            {
              "level": "subsection",
              "number": "1.4.3",
              "title": "Bodhisattva's Resilience and Refuge",
              "verses_span": "35-36",
              "summary": {
                "content_summary": "ཚིགས་བཅད་འདི་གཉིས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ནང་གི་ཡོན་ཏན་དང་ཕྱི་ལ་སྐྱབས་ཀྱི་གནས་སུ་གྱུར་ཚུལ་བསྟན་ཡོད། རྒྱལ་སྲས་རྣམས་ལ་རྐྱེན་ངན་ཇི་ཙམ་ཆེན་པོ་བྱུང་ཡང་དེས་ཆོས་ཀྱི་བར་ཆད་དུ་མི་འགྲོ་བར་དགེ་བ་ངང་གིས་འཕེལ་བར་འགྱུར། དེར་བརྟེན། རིན་ཆེན་བྱང་ཆུབ་ཀྱི་སེམས་སྐྱེས་པའི་གང་ཟག་དེ་ལ་ཕྱག་འཚལ་ཞིང་། གང་ལ་གནོད་པ་བྱས་ན་ཡང་བདེ་བ་དང་འབྲེལ་བར་མཛད་པའི་བདེ་བའི་འབྱུང་གནས་དེ་ལ་སྐྱབས་སུ་མཆི་དགོས་པར་བསྟན་ཡོད།",
                "key_concepts": [
                  "དོ་གལ་ཆེན་པོ།",
                  "དགེ་བ་ངང་གིས་འཕེལ།",
                  "སེམས་ཀྱི་དམ་པ་རིན་ཆེན།",
                  "བདེ་བའི་འབྱུང་གནས།",
                  "སྐྱབས་སུ་མཆི།"
                ],
                "transformative_goal": "བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་རྐྱེན་ངན་ལམ་དུ་སྒྱུར་བའི་དཔའ་བོ་དང་། འབྲེལ་ཚད་དོན་ལྡན་གྱི་སྐྱབས་གནས་ཡིན་པར་ངོས་ཟིན་ནས། དེ་དག་ལ་དད་གུས་ལྡོག་མེད་དང་སྐྱབས་སུ་འཛིན་པའི་བློ་བརྟན་པོ་བསྐྱེད་པ།",
                "function_in_hierarchy": "འདི་ནི་ལེའུ་ཡི་མཇུག་བསྡོམས་ལྟ་བུ་ཡིན། བྱང་སེམས་ཀྱི་ཆེ་བ་བརྗོད་པའི་མཐར་ཁོང་རྣམས་སྐྱབས་ཀྱི་ཡུལ་དམ་པར་བསྟན་ནས། ལེའུ་འདིའི་དོན་ཐམས་ཅད་ཀློག་པ་པོའི་ཉམས་ལེན་དངོས་ཏེ་སྐྱབས་འགྲོ་དང་དད་གུས་ཀྱི་སྟེང་དུ་བསྡུ་བར་བྱེད།",
                "inter_node_relationships": [],
                "implicit_concepts": [
                  "རྐྱེན་ངན་ལམ་ཁྱེར།",
                  "བྱམས་དང་སྙིང་རྗེའི་སྟོབས།",
                  "སྐྱབས་གནས་མཚན་ཉིད་ཚང་བ།"
                ],
                "pedagogical_strategy": "བྱང་སེམས་ཀྱི་ནང་གི་ཡོན་ཏན་བརྗོད་དེ། དེའི་འབྲས་བུར་ཕྱི་རོལ་ཀུན་གྱི་སྐྱབས་གནས་སུ་ཇི་ལྟར་འགྱུར་བའི་རྒྱུ་འབྲས་ཀྱི་རིམ་པ་བསྟན་པ།",
                "intended_impact_on_reader": "བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱག་འཚལ་བ་དང་སྐྱབས་སུ་འགྲོ་བའི་སྒོ་ནས་རང་གི་རྒྱུད་ལ་ཡོན་ཏན་གྱི་ས་བོན་བསྐྲུན་པ་དང་། ཁོང་རྣམས་ཀྱི་རྗེས་སུ་སློབ་པའི་སྨོན་ལམ་འདེབས་པ།",
                "audience_assumptions": "ཀློག་པ་པོས་སྐྱབས་འགྲོའི་གོ་དོན་དང་དེའི་གལ་གནད་ཤེས་ཀྱི་ཡོད་པར་ཆ་འཇོག་བྱེད།"
              },
              "children": []
            }
          ]
        }
      ]
    }
  ]