[
  {
    "level": "1",
    "title": "ཤེས་རབ་ཀྱི་ལེའུ།",
    "lines_span": "1-522",
    "children": [
      {
        "level": "1.1",
        "title": "ཤེས་རབ་བསྐྱེད་པ་མདོར་བསྟན་པ།",
        "lines_span": "1-4",
        "line_text_excerpt": "ཡན་ལག་འདི་དག་ཐམས་ཅད་ནི། །\nཐུབ་པས་ཤེས་རབ་དོན་དུ་གསུངས། །\nདེ་ཡི་ཕྱིར་ན་སྡུག་བསྔལ་དག །\nཞི་བར་འདོད་པས་ཤེས་རབ་བསྐྱེད། །",
        "children": []
      },
      {
        "level": "1.2",
        "title": "ཤེས་རབ་རྒྱས་པར་བཤད་པ།",
        "lines_span": "5-522",
        "children": [
          {
            "level": "1.2.1",
            "title": "ལྟ་བས་གཏན་ལ་ཕབ་པ།",
            "lines_span": "5-172",
            "children": [
              {
                "level": "1.2.1.1",
                "title": "བདེན་གཉིས་རྣམ་པར་བཞག་པ།",
                "lines_span": "5-16",
                "children": [
                  {
                    "level": "1.2.1.1.1",
                    "title": "བདེན་གཉིས་ཀྱི་དབྱེ་བ།",
                    "lines_span": "5-6",
                    "line_text_excerpt": "ཀུན་རྫོབ་དང་ནི་དོན་དམ་སྟེ། །\nའདི་ནི་བདེན་པ་གཉིས་སུ་འདོད། །",
                    "children": []
                  },
                  {
                    "level": "1.2.1.1.2",
                    "title": "བདེན་གཉིས་ཀྱི་མཚན་ཉིད།",
                    "lines_span": "7-8",
                    "line_text_excerpt": "དོན་དམ་བློ་ཡི་སྤྱོད་ཡུལ་མིན། །\nབློ་ནི་ཀུན་རྫོབ་ཡིན་པར་བརྗོད། །",
                    "children": []
                  },
                  {
                    "level": "1.2.1.1.3",
                    "title": "བདེན་གཉིས་གཏན་ལ་འབེབ་པའི་གང་ཟག",
                    "lines_span": "9-16",
                    "line_text_excerpt": "དེ་ལ་འཇིག་རྟེན་རྣམ་གཉིས་མཐོང་། །\nརྣལ་འབྱོར་པ་དང་ཕལ་པའོ། །\nདེ་ལ་འཇིག་རྟེན་ཕལ་པ་ནི། །\nརྣལ་འབྱོར་འཇིག་རྟེན་གྱིས་གནོད་ཅིང་། །\nརྣལ་འབྱོར་པ་ཡང་བློ་ཁྱད་ཀྱིས། །\nགོང་མ་གོང་མ་རྣམས་ཀྱིས་གནོད། །",
                    "children": []
                  }
                ]
              },
              {
                "level": "1.2.1.2",
                "title": "བདེན་གཉིས་ལ་རྩོད་པ་སྤོང་བ།",
                "lines_span": "17-124",
                "children": [
                  {
                    "level": "1.2.1.2.1",
                    "title": "གཞི་བདེན་གཉིས་ལ་རྩོད་པ་སྤོང་བ།",
                    "lines_span": "17-94",
                    "children": [
                      {
                        "level": "1.2.1.2.1.1",
                        "title": "འཇིག་རྟེན་ཕལ་པའི་རྩོད་སྤོང་།",
                        "lines_span": "17-20",
                        "line_text_excerpt": "གཉིས་ཀ་ཡང་ནི་འདོད་པའི་དཔེས། །\nའབྲས་བུའི་དོན་དུ་མ་དཔྱད་ཕྱིར།འཇིག་རྟེན་པ་ཡིས་དངོས་མཐོང་ཞིང་། །\nཡང་དག་ཉིད་དུའང་རྟོག་བྱེད་ཀྱི། །\nསྒྱུ་མ་ལྟ་བུར་མིན་པས་འདིར། །\nརྣལ་འབྱོར་པ་དང་འཇིག་རྟེན་རྩོད། །",
                        "children": []
                      },
                      {
                        "level": "1.2.1.2.1.2",
                        "title": "ཉན་ཐོས་ཀྱི་རྩོད་སྤོང་།",
                        "lines_span": "21-56",
                        "children": [
                          {
                            "level": "1.2.1.2.1.2.1",
                            "title": "མངོན་སུམ་གྱིས་གྲུབ་པའི་རྩོད་པ་དགག་པ།",
                            "lines_span": "21-24",
                            "line_text_excerpt": "གཟུགས་སོགས་མངོན་སུམ་ཉིད་ཀྱང་ནི། །\nགྲགས་པས་ཡིན་གྱི་ཚད་མས་མིན། །\nདེ་ནི་མི་གཙང་ལ་སོགས་ལ། །\nགཙང་སོགས་གྲགས་པ་བཞིན་དུ་རྫུན། །",
                            "children": []
                          },
                          {
                            "level": "1.2.1.2.1.2.2",
                            "title": "དྲང་དོན་གྱི་གསུང་ཡིན་པར་བསྟན་པ།",
                            "lines_span": "25-28",
                            "line_text_excerpt": "འཇིག་རྟེན་གཞུག་པའི་དོན་དུ་ནི། །\nམགོན་པོས་དངོས་པོ་བསྟན་པ་ཡིན། །\nདེ་དག་སྐད་ཅིག་མ་ཉིད་མིན། །",
                            "children": []
                          },
                          {
                            "level": "1.2.1.2.1.2.3",
                            "title": "སྐད་ཅིག་མ་ཀུན་རྫོབ་ཏུ་འགལ་བའི་རྩོད་པ་དགག་པ།",
                            "lines_span": "28-32",
                            "line_text_excerpt": "ཀུན་རྫོབ་ཏུ་ཡང་འགལ་ཞེ་ན། །\nརྣལ་འབྱོར་ཀུན་རྫོབ་ཉེས་མེད་དེ། །\nའཇིག་རྟེན་ལ་ལྟོས་དེ་ཉིད་མཐོང་། །\nགཞན་དུ་བུད་མེད་མི་གཙང་བར། །\nདེ་རྟོགས་འཇིག་རྟེན་གྱིས་གནོད་འགྱུར། །",
                            "children": []
                          },
                          {
                            "level": "1.2.1.2.1.2.4",
                            "title": "སྒྱུ་འདྲའི་སངས་རྒྱས་ལ་མཆོད་པས་བསོད་ནམས་འབྱུང་ཚུལ།",
                            "lines_span": "33-34",
                            "line_text_excerpt": "སྒྱུ་འདྲའི་རྒྱལ་ལས་བསོད་ནམས་ནི། །\nཇི་ལྟར་དངོས་ཡོད་ལ་ཇི་བཞིན། །",
                            "children": []
                          },
                          {
                            "level": "1.2.1.2.1.2.5",
                            "title": "སྒྱུ་འདྲའི་སེམས་ཅན་སྐྱེ་བ་འཐད་པའི་ཚུལ།",
                            "lines_span": "35-40",
                            "line_text_excerpt": "གལ་ཏེ་སེམས་ཅན་སྒྱུ་འདྲ་ན། །\nཤི་ནས་ཇི་ལྟར་སྐྱེ་ཞེ་ན། །\nཇི་སྲིད་རྐྱེན་རྣམས་ཚོགས་གྱུར་པ། །\nདེ་སྲིད་སྒྱུ་མའང་འབྱུང་བར་འགྱུར། །\nརྒྱུན་རིང་ཙམ་གྱིས་ཇི་ལྟར་ན། །\nསེམས་ཅན་བདེན་པར་ཡོད་པ་ཡིན། །",
                            "children": []
                          },
                          {
                            "level": "1.2.1.2.1.2.6",
                            "title": "སྒྱུ་འདྲའི་སེམས་ཅན་ལ་ཕན་གནོད་ཀྱིས་དགེ་སྡིག་འབྱུང་ཚུལ།",
                            "lines_span": "41-44",
                            "line_text_excerpt": "སྒྱུ་མའི་སྐྱེས་བུ་བསད་སོགས་ལ། །\nསེམས་མེད་ཕྱིར་ན་སྡིག་པ་མེད། །\nསྒྱུ་མའི་སེམས་དང་ལྡན་པ་ལ། །\nབསོད་ནམས་དང་ནི་སྡིག་པ་འབྱུང་། །",
                            "children": []
                          },
                          {
                            "level": "1.2.1.2.1.2.7",
                            "title": "སྒྱུ་མ་དང་སེམས་ཅན་ལ་སེམས་ཡོད་མེད་ཀྱི་རྒྱུ་མཚན།",
                            "lines_span": "45-52",
                            "line_text_excerpt": "སྔགས་སོགས་རྣམས་ལ་ནུས་མེད་ཕྱིར། །\nསྒྱུ་མའི་སེམས་ནི་འབྱུང་བ་མེད། །\nསྣ་ཚོགས་རྐྱེན་ལས་བྱུང་བ་ཡི། །\nསྒྱུ་མ་དེ་ཡང་སྣ་ཚོགས་ཉིད། །\nརྐྱེན་གཅིག་གིས་ནི་ཀུན་ནུས་པ། །\nགང་ན་ཡང་ནི་ཡོད་མ་ཡིན། །",
                            "children": []
                          },
                          {
                            "level": "1.2.1.2.1.2.8",
                            "title": "མྱང་འདས་དང་འཁོར་བའི་རྩོད་པ་སྤོང་བ།",
                            "lines_span": "53-56",
                            "line_text_excerpt": "གལ་ཏེ་དོན་དམ་མྱ་ངན་འདས། །\nའཁོར་བ་ཀུན་རྫོབ་དེ་ལྟ་ན། །\nསངས་རྒྱས་ཀྱང་ནི་འཁོར་འགྱུར་བས། །\nབྱང་ཆུབ་སྤྱོད་པས་ཅི་ཞིག་བྱ། །",
                            "children": []
                          }
                        ]
                      },
                      {
                        "level": "1.2.1.2.1.3",
                        "title": "སེམས་ཙམ་པའི་རྩོད་སྤོང་།",
                        "lines_span": "57-94",
                        "children": [
                          {
                            "level": "1.2.1.2.1.3.1",
                            "title": "རྣམ་བདེན་པའི་རྩོད་པ་དགག་པ།",
                            "lines_span": "57-88",
                            "line_text_excerpt": "གང་ཚེ་འཁྲུལ་པའང་ཡོད་མིན་ན། །\nསྒྱུ་མ་གང་གིས་དམིགས་པར་འགྱུར། །\nགང་ཚེ་ཁྱོད་ལ་སྒྱུ་མ་ཉིད། །\nམེད་ནའང་དེ་ཚེ་ཅི་ཞིག་དམིགས། །\nགལ་ཏེ་དེ་ཉིད་དུ་གཞན་ཡོད། །\nརྣམ་པ་དེ་ནི་སེམས་ཉིད་ཡིན། །\nགང་ཚེ་སེམས་ཉིད་སྒྱུ་མ་ན། །\nདེ་ཚེ་གང་ཞིག་གང་གིས་མཐོང་། །\nའཇིག་རྟེན་གྱི་ནི་མགོན་པོས་ཀྱང་། །\nསེམས་ཀྱིས་སེམས་མི་མཐོང་ཞེས་གསུངས། །\nརལ་གྲིའི་སོ་ནི་རང་ལ་རང་། །\nཇི་ལྟར་མི་གཅོད་དེ་བཞིན་ཡིད།།ཇི་ལྟར་མར་མེ་རང་གི་དངོས། །\nཡང་དག་གསལ་བར་བྱེད་བཞིན་ན། །\nམར་མེ་གསལ་བར་བྱ་མིན་ཏེ། །\nགང་ཕྱིར་མུན་གྱིས་བསྒྲིབས་པ་མེད། །\nབཻཌཱུརྱ་བཞིན་སྔོན་པོ་སྔོ་ཉིད་ལ། །\nགཞན་ལ་ལྟོས་པ་ཡོད་མ་ཡིན། །\nདེ་བཞིན་འགའ་ཞིག་གཞན་ལ་ནི། །\nལྟོས་དང་ལྟོས་མེད་པ་ཡང་མཐོང་། །\nསྔོ་ཉིད་མིན་ལ་སྔོན་པོར་དེ། །\nབདག་གིས་བདག་ཉིད་བྱས་པ་མེད། །\nམར་མེ་གསལ་བར་བྱེད་དོ་ཞེས། །\nཤེས་པས་ཤེས་ཏེ་རྗོད་བྱེད་ན། །\nབློ་ནི་གསལ་བ་ཉིད་ཡིན་ཞེས། །\nགང་གིས་ཤེས་ནས་དེ་སྐད་བརྗོད། །\nགང་ཚེ་འགས་ཀྱང་མཐོང་མིན་ན། །\nགསལ་བའམ་ནི་མི་གསལ་བ། །\nམོ་གཤམ་བུ་མོའི་འགྱིང་བག་བཞིན། །\nདེ་ནི་བརྗོད་ཀྱང་དོན་མེད་དོ། །\nགལ་ཏེ་རང་རིག་ཡོད་མིན་ན། །\nརྣམ་ཤེས་དྲན་པར་ཇི་ལྟར་འགྱུར། །\nགཞན་མྱོང་བ་དང་འབྲེལ་བ་ལས། །\nདྲན་འགྱུར་བྱི་བའི་དུག་བཞིན་ནོ། །\nརྐྱེན་གཞན་དག་དང་ལྡན་པ་ནི། །\nམཐོང་ཕྱིར་རང་ཉིད་རབ་གསལ་ན། །\nགྲུབ་པའི་མིག་སྨན་སྦྱོར་བ་ལས། །\nབུམ་མཐོང་མིག་སྨན་ཉིད་འགྱུར་མིན ། །",
                            "children": []
                          },
                          {
                            "level": "1.2.1.2.1.3.2",
                            "title": "རྣམ་རྫུན་པའི་རྩོད་པ་དགག་པ།",
                            "lines_span": "89-94",
                            "line_text_excerpt": "སེམས་ལས་སྒྱུ་མ་གཞན་མིན་ཞིང་། །\nགཞན་མིན་པར་ཡང་མི་བརྟག་ན། །\nདངོས་ན་ཇི་ལྟར་དེ་གཞན་མིན། །\nགཞན་མིན་ཞེས་ན་དངོས་པོར་མེད། །\nཇི་ལྟར་སྒྱུ་མ་བདེན་མིན་ཡང་། །\nབལྟ་བྱ་དེ་བཞིན་ལྟ་བྱེད་ཡིད། །",
                            "children": []
                          }
                        ]
                      }
                    ]
                  },
                  {
                    "level": "1.2.1.2.2",
                    "title": "ལམ་སྟོང་ཉིད་ལ་རྩོད་པ་སྤོང་བ།",
                    "lines_span": "95-108",
                    "line_text_excerpt": "སྒྱུ་མ་ལྟ་བུར་ཤེས་ན་ཡང་། །\nཇི་ལྟར་ཉོན་མོངས་ལྡོག་འགྱུར་ཏེ། །\nགང་ཚེ་སྒྱུ་མའི་བུད་མེད་ལ། །\nདེ་བྱེད་ཉིད་ཀྱང་ཆགས་སྐྱེ་འགྱུར། །\nདེ་བྱེད་པ་ནི་ཤེས་བྱ་ལ། །\nཉོན་མོངས་བག་ཆགས་མ་སྤངས་པས། །\nདེས་ན་དེ་མཐོང་བ་ན་དེ། །\nསྟོང་ཉིད་བག་ཆགས་ཉམ་ཆུང་ཞིང་། །\nསྟོང་ཉིད་བག་ཆགས་གོམས་པས་ནི། །\nདངོས་པོའི་བག་ཆགས་སྤོང་འགྱུར་ཞིང་། །\nཅི་ཡང་མེད་ཅེས་གོམས་པས་ནི། །\nདེ་ཡང་ཕྱི་ནས་སྤོང་བར་འགྱུར། །\nགང་ཚེ་གང་ཞིག་མེད་དོ་ཞེས། །\nབརྟག་བྱའི་དངོས་པོ་མི་དམིགས་པ། །\nདེ་ཚེ་དངོས་མེད་རྟེན་བྲལ་བ། །\nབློ་ཡི་མདུན་ན་ཇི་ལྟར་གནས། །\nགང་ཚེ་དངོས་དང་དངོས་མེད་དག །\nབློ་ཡི་མདུན་ན་མི་གནས་པ། །\nདེ་ཚེ་རྣམ་པ་གཞན་མེད་པས། །\nདམིགས་པ་མེད་པར་རབ་ཏུ་ཞི། །",
                    "children": []
                  },
                  {
                    "level": "1.2.1.2.3",
                    "title": "འབྲས་བུ་གཞན་དོན་ལ་རྩོད་པ་སྤོང་བ།",
                    "lines_span": "109-124",
                    "line_text_excerpt": "ཡིད་བཞིན་ནོར་བུ་དཔག་བསམ་ཤིང་། །\nཇི་ལྟར་རེ་བ་ཡོངས་སྐོང་བ། །\nདེ་བཞིན་གདུལ་བྱའི་སྨོན་ལམ་གྱིས། །\nདབང་གིས་རྒྱལ་བའི་སྐུར་སྣང་ངོ་། །\nདཔེར་ན་ནམ་མཁའ་ལྡིང་གི་ནི། །\nམཆོད་སྡོང་བསྒྲུབས་ནས་འདས་གྱུར་པ། །\nདེ་འདས་ཡུན་རིང་ལོན་ཡང་དེ། །\nདུག་ལ་སོགས་པ་ཞི་བྱེད་བཞིན། །\nབྱང་ཆུབ་སྤྱོད་པའི་རྗེས་མཐུན་པས། །\nརྒྱལ་བའི་མཆོད་སྡོང་བསྒྲུབས་པ་ཡང་། །\nབྱང་ཆུབ་སེམས་དཔའ་མྱ་ངན་ལས། །\nའདས་ཀྱང་དོན་རྣམས་ཐམས་ཅད་མཛད། །\nསེམས་མེད་པ་ལ་མཆོད་བྱས་པས། །\nཇི་ལྟར་འབྲས་བུར་ལྡན་པར་འགྱུར། །\nགང་ཕྱིར་བཞུགས་པའམ་མྱ་ངན་འདས། །\nམཚུངས་པ་ཉིད་དུ་བཤད་ཕྱིར་རོ། །\nཀུན་རྫོབ་བམ་ནི་དེ་ཉིད་དུའང༌། །\nརུང་སྟེ་དེ་ལ་འབྲས་བུ་ནི། །\nལུང་ལས་ཡིན་ཏེ་དཔེར་ན་ནི། །\nབདེན་པའི་སངས་རྒྱས་ལ་ཇི་ལྟར། །",
                    "children": []
                  }
                ]
              },
              {
                "level": "1.2.1.3",
                "title": "ཐེག་ཆེན་མཆོག་ཏུ་བསྒྲུབ་པ།",
                "lines_span": "125-172",
                "children": [
                  {
                    "level": "1.2.1.3.1",
                    "title": "ལུང་ཐེག་ཆེན་བཀར་བསྒྲུབ་པ།",
                    "lines_span": "125-156",
                    "line_text_excerpt": "འབྲས་བུར་བཅས་པ་བཞིན་ནོ། །\nབདེན་པ་མཐོང་བས་གྲོལ་འགྱུར་གྱི། །\nསྟོང་ཉིད་མཐོང་བས་ཅི་ཞིག་བྱ། །\nགང་གི་ཕྱིར་ན་ལུང་ལས་ལམ་འདི་ནི། །\nམེད་པར་བྱང་ཆུབ་མེད་པར་གསུངས། །\nགལ་ཏེ་ཐེག་ཆེན་མ་གྲུབ་ན། །\nཁྱོད་ཀྱི་ལུང་ནི་ཇི་ལྟར་གྲུབ། །\nགང་ཕྱིར་གཉིས་ཀ་ལ་འདི་གྲུབ། །\nདང་པོར་ཁྱོད་ལ་འདི་མ་གྲུབ། །\nརྐྱེན་གང་གིས་ནི་དེར་ཡིད་ཆེས། །\nདེ་ནི་ཐེག་ཆེན་ལ་ཡང་མཚུངས། །\nགཞན་གཉིས་འདོད་པས་བདེན་ན་ནི། །\nརིག་བྱེད་སོགས་ཀྱང་བདེན་པར་འགྱུར། །\nཐེག་ཆེན་རྩོད་བཅས་ཕྱིར་ཞེ་ན། །\nལུང་ལ་མུ་སྟེགས་པ་རྣམས་དང་། །\nལུང་གཞན་ལ་ཡང་རང་གཞན་དག །\nརྩོད་བཅས་ཡིན་ཕྱིར་དོར་བྱར་འགྱུར། །\nབསྟན་རྩ་དགེ་སློང་ཉིད་ཡིན་ན། །\nདགེ་སློང་ཉིད་ཀྱང་དཀའ་བར་གནས། །\nསེམས་ནི་དམིགས་དང་བཅས་རྣམས་ཀྱི། །\nམྱ་ངན་འདས་པའང་དཀའ་བར་གནས། །\nཉོན་མོངས་སྤངས་པས་གྲོལ་ན་དེའི། །\nདེ་མ་ཐག་ཏུ་དེར་འགྱུར་རོ། །\nཉོན་མོངས་མེད་ཀྱང་དེ་དག་ལ། །\nལས་ཀྱི་ནུས་པ་མཐོང་བ་ཡིན། །\nརེ་ཞིག་ཉེར་ལེན་སྲིད་པ་ནི། །\nམེད་ཅེས་ངེས་པ་ཉིད་ཅེ་ན། །\nསྲིད་འདི་ཉོན་མོངས་ཅན་མིན་ཡང༌། །\nཀུན་རྨོངས་བཞིན་དུ་ཅི་སྟེ་མེད། །\nཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ་ཡིན། །\nཚོར་བ་དེ་དག་ལ་ཡང་ཡོད། །\nདམིགས་པ་དང་ནི་བཅས་པའི་སེམས། །\nའགའ་ཞིག་ལ་ནི་གནས་པར་འགྱུར། །\nསྟོང་ཉིད་དང་ནི་བྲལ་བའི་སེམས། །\nའགགས་པ་སླར་ཡང་སྐྱེ་འགྱུར་ཏེ། །\nའདུ་ཤེས་མེད་པའི་སྙོམས་འཇུག་བཞིན། །\nདེས་ན་སྟོང་ཉིད་བསྒོམ་པར་བྱ། །\nངག་གང་མདོ་སྡེ་ལ་འཇུག་སྟེ། །\nགལ་ཏེ་སངས་རྒྱས་གསུངས་འདོད་ན། །\nཐེག་ཆེན་ཕལ་ཆེར་ཁྱེད་ཅག་གི །\nམདོ་དང་མཚུངས་འདོད་མིན་ནམ་ཅི། །\nགལ་ཏེ་མ་གཏོགས་གཅིག་གིས་ནི། །\nཐམས་ཅད་སྐྱོན་དང་བཅས་འགྱུར་ན། །\nམདོ་མཚུངས་གཅིག་གིས་ཐམས་ཅད་ནི། །\nརྒྱལ་བས་གསུངས་པ་ཅིས་མ་ཡིན། །\nངག་གང་འོད་སྲུངས་ཆེན་པོ་ལ་སོགས་པས་གཏིང་དཔོགས་མ་གྱུར་པ། །\nདེ་ནི་ཁྱོད་ཀྱིས་མ་རྟོགས་པས། །\nགཟུང་བྱ་མིན་པར་སུ་ཞིག་བྱེད། །",
                    "children": []
                  },
                  {
                    "level": "1.2.1.3.2",
                    "title": "ལམ་སྟོང་ཉིད་གཉེན་པོར་སྒྲུབ་པ།",
                    "lines_span": "157-172",
                    "line_text_excerpt": "རྨོངས་པས་སྡུག་བསྔལ་ཅན་དོན་དུ། །\nཆགས་དང་འཇིགས་མཐའ་ལས་གྲོལ་བར། །\nའཁོར་བར་གནས་པ་འགྲུབ་འགྱུར་བ། །\nའདི་ནི་སྟོང་ཉིད་འབྲས་བུ་ཡིན། །\nདེ་ལྟར་སྟོང་པ་ཉིད་ཀྱི་ཕྱོགས་ལ། །\nསུན་འབྱིན་པ་ནི་འཐད་མ་ཡིན། །\nདེས་ན་ཐེ་ཚོམ་མི་ཟ་བར། །\nསྟོང་པ་ཉིད་ནི་བསྒོམ་པར་བྱ། །\nཉོན་མོངས་ཤེས་བྱའི་སྒྲིབ་པ་ཡི། །\nམུན་པའི་གཉེན་པོ་སྟོང་པ་ཉིད། །\nམྱུར་དུ་ཐམས་ཅད་མཁྱེན་འདོད་པས། །\nདེ་ནི་ཇི་ལྟར་བསྒོམ་མི་བྱེད། །\nདངོས་གང་སྡུག་བསྔལ་སྐྱེད་བྱེད་པ། །\nདེ་ལ་སྐྲག་པ་སྐྱེ་འགྱུར་ན། །\nསྟོང་ཉིད་སྡུག་བསྔལ་ཞི་བྱེད་པ། །\nདེ་ལ་འཇིགས་པ་ཇི་ལྟར་སྐྱེ། །\nགལ་ཏེ་བདག་འགའ་ཡོད་ན་ནི། །\nཅི་ཡང་རུང་ལ་འཇིགས་འགྱུར་ན། །\nབདག་ཉིད་འགའ་ཡང་ཡོད་མིན་པས། །\nའཇིགས་པར་འགྱུར་བ་སུ་ཞིག་ཡིན། །",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "level": "1.2.2",
            "title": "བསྒོམ་པས་ཉམས་སུ་བླང་བ།",
            "lines_span": "173-460",
            "children": [
              {
                "level": "1.2.2.1",
                "title": "གང་ཟག་གི་བདག་མེད་བསྒོམ་ཚུལ།",
                "lines_span": "173-240",
                "children": [
                  {
                    "level": "1.2.2.1.1",
                    "title": "ལྷན་སྐྱེས་ཀྱི་བདག་སྟོང་པར་བསྒོམ་ཚུལ།",
                    "lines_span": "173-184",
                    "line_text_excerpt": "སོ་དང་སྐྲ་སེན་བདག་མ་ཡིན། །\nབདག་ནི་རུས་པ་ཁྲག་མ་ཡིན། །\nསྣབས་མིན་བད་ཀན་མ་ཡིན་ཏེ། །\nཆུ་སེར་དང་ནི་རྣག་ཀྱང་མིན། །\nབདག་ནི་ཞག་དང་རྔུལ་མིན་ཏེ། །\nགློ་མཆིན་དག་ཀྱང་བདག་མ་ཡིན། །\nནང་ཁྲོལ་གཞན་ཡང་བདག་མིན་ཏེ། །\nབདག་ནི་ཕྱི་ས་གཅིན་མ་ཡིན། །\nཤ་དང་པགས་པ་བདག་མིན་ཏེ། །\nདྲོད་དང་རླུང་ཡང་བདག་མ་ཡིན། །\nབུ་ག་བདག་མིན་རྣམ་ཀུན་དུ། །\nརྣམ་ཤེས་དྲུག་ཀྱང་བདག་མ་ཡིན། །",
                    "children": []
                  },
                  {
                    "level": "1.2.2.1.2",
                    "title": "ཀུན་བརྟགས་ཀྱི་བདག་སྟོང་པར་བསྒོམ་ཚུལ།",
                    "lines_span": "185-240",
                    "children": [
                      {
                        "level": "1.2.2.1.2.1",
                        "title": "བདག་ཤེས་པར་འདོད་པ་དགག་པ།",
                        "lines_span": "185-208",
                        "line_text_excerpt": "གལ་ཏེ་སྒྲ་ཡི་ཤེས་རྟག་ན། །\nཐམས་ཅད་ཚེ་ན་སྒྲ་འཛིན་འགྱུར། །\nཤེས་བྱ་མེད་ན་ཅི་ཞིག་རིག །\nགང་གིས་ཤེས་པ་ཞེས་རྗོད་བྱེད། །\nགལ་ཏེ་ཤེས་མེད་ཤེས་ཡིན་ན། །\nཤིང་ཡང་ཤེས་པར་ཐལ་བར་འགྱུར། །\nདེས་ན་ཤེས་བྱ་ཉེར་གནས་པ། །\nམེད་པར་ཤེས་པ་མེད་ཅེས་ངེས། །\nདེ་ཉིད་ཀྱིས་ནི་གཟུགས་ཤེས་ན། །\nདེ་ཚེ་ཐོས་པའང་ཅི་སྟེ་མིན། །\nགལ་ཏེ་སྒྲ་མི་ཉེ་ཕྱིར་ན། །\nདེས་ན་དེ་ཡི་ཤེས་པའང་མེད། །\nསྒྲ་འཛིན་རང་བཞིན་གང་ཡིན་པ། །\nདེ་གཟུགས་འཛིན་པར་ཇི་ལྟར་འགྱུར། །\nགཅིག་ནི་ཕ་དང་བུ་ཉིད་དུ། །\nབཏགས་པ་ཡིན་གྱི་ཡང་དག་མིན། །\nའདི་ལྟར་སྙིང་སྟོབས་རྡུལ་དང་ནི། །\nམུན་པ་བུ་མིན་ཕ་ཡང་མིན། །\nདེ་ནི་སྒྲ་འཛིན་དང་ལྡན་པའི། །\nརང་བཞིན་དུ་ནི་མཐོང་མ་ཡིན། །\nགར་མཁན་ལྟ་བུར་ཚུལ་གཞན་གྱིས། །\nདེ་ཉིད་མཐོང་ན་དེ་རྟག་མིན། །\nགལ་ཏེ་ཚུལ་གཞན་དེ་ཉིད་ན། །\nགཅིག་ཉིད་དེ་ནི་སྔོན་མེད་ཅིང་། །\nགལ་ཏེ་ཚུལ་གཞན་བདེན་མིན་ན། །\nདེ་ཡི་རང་གི་རང་བཞིན་སྨྲོས། །\nཤེས་ཉིད་ཅེས་ན་དེ་ལྟ་ན། །\nསྐྱེས་ཀུན་གཅིག་ཏུ་ཐལ་བར་འགྱུར། །\nསེམས་པ་སེམས་མེད་དེ་དག་ཀྱང་། །\nགཅིག་འགྱུར་གང་ཕྱིར་ཡོད་ཉིད་མཚུངས། །\nགང་ཚེ་བྱེ་བྲག་ཕྱིན་ཅི་ལོག །\nདེ་ཚེ་འདྲ་བའི་རྟེན་གང་ཡིན། །",
                        "children": []
                      },
                      {
                        "level": "1.2.2.1.2.2",
                        "title": "བདག་བེམ་པོར་འདོད་པ་དགག་པ།",
                        "lines_span": "209-216",
                        "line_text_excerpt": "སེམས་མེད་པ་ཡང་བདག་མིན་ཏེ། །\nསེམས་མེད་ཉིད་ཕྱིར་བུམ་སོགས་བཞིན། །\nའོན་ཏེ་སེམས་དང་ལྡན་པའི་ཕྱིར། །\nཤེས་ན་མི་ཤེས་འཇིག་པར་ཐལ། །\nཅི་སྟེ་བདག་ལ་འགྱུར་མེད་ན། །\nསེམས་པས་དེ་ལ་ཅི་ཞིག་བྱས། །\nདེ་ལྟར་ཤེས་མེད་བྱ་བྲལ་བ། །\nནམ་མཁའ་བདག་ཏུ་བྱས་པར་འགྱུར། །",
                        "children": []
                      },
                      {
                        "level": "1.2.2.1.2.3",
                        "title": "བདག་མེད་པའི་དོན་ལ་རྩོད་པ་སྤོང་བ།",
                        "lines_span": "217-240",
                        "children": [
                          {
                            "level": "1.2.2.1.2.3.1",
                            "title": "བདག་མེད་ན་ལས་འབྲས་མི་འཐད་པའི་རྩོད་སྤོང་།",
                            "lines_span": "217-228",
                            "line_text_excerpt": "གལ་ཏེ་བདག་ནི་ཡོད་མིན་ན། །\nལས་འབྲས་འབྲེལ་བ་རིགས་མིན་ཏེ། །\nལས་བྱས་ནས་ནི་ཞིག་པས་ན། །\nསུ་ཡི་ལས་སུ་འགྱུར་ཞེ་ན། །\nབྱ་བ་འབྲས་བཞི་གཞི་ཐ་དད་དང་། །\nདེར་བདག་བྱེད་པ་མེད་པར་ཡང་། །\nཡུ་བུ་གཉིས་ཀ་ལ་གྲུབ་པས། །\nའདིར་བརྩད་དོན་མེད་མ་ཡིན་ནམ། །\nརྒྱུ་ལྡན་འབྲས་བུ་དང་བཅས་ཞེས། །\nམཐོང་བ་འདི་ནི་སྲིད་མ་ཡིན། །\nརྒྱུན་གཅིག་ལ་ནི་བརྟེན་ནས་སུ། །\nབྱེད་པོ་སྤྱོད་པོ་ཞེས་བྱར་བསྟན། །\nའདས་དང་མ་འོངས་པ་ཡི་སེམས། །\nབདག་མིན་དེ་ནི་མེད་པའི་ཕྱིར། །\nའོན་ཏེ་སྐྱེས་སེམས་བདག་ཡིན་ན། །\nདེ་ཞིག་ན་ཡང་བདག་མེད་དོ། །\nདཔེར་ན་ཆུ་ཤིང་སྡོང་པོ་དག །\nཆ་ཤས་ཕྱེ་ན་འགའ་མེད་པ། །\nདེ་བཞིན་རྣམ་པར་དཔྱད་པ་ཡིས། །\nབཙལ་ན་བདག་ཀྱང་ཡང་དག་མིན། །",
                            "children": []
                          },
                          {
                            "level": "1.2.2.1.2.3.2",
                            "title": "བདག་མེད་ན་སྙིང་རྗེ་མི་འཐད་པའི་རྩོད་སྤོང་།",
                            "lines_span": "229-230",
                            "line_text_excerpt": "གལ་ཏེ་སེམས་ཅན་ཡོད་མིན་ན། །\nསུ་ལ་སྙིང་རྗེ་བྱ་ཞེ་ན། །\nའབྲས་བུའི་དོན་དུ་ཁས་བླངས་པའི། །\nརྨོངས་པས་བཏགས་པ་གང་ཡིན་པའོ། །",
                            "children": []
                          },
                          {
                            "level": "1.2.2.1.2.3.3",
                            "title": "བཏགས་པའི་བདག་མི་འགོག་པར་བསྟན་པ།",
                            "lines_span": "231-240",
                            "line_text_excerpt": "སེམས་ཅན་མེད་འབྲས་སུ་ཡི་ཡིན། །\nབདེན་ཏེ་འོན་ཀྱང་རྨོངས་ལས་འདོད། །\nསྡུག་བསྔལ་ཉེ་བར་ཞི་དོན་དུ། །\nའབྲས་བུའི་རྨོངས་པ་བཟློག་མི་བྱ། །\nསྡུག་བསྔལ་རྒྱུ་ཡི་ང་རྒྱལ་ནི། །\nབདག་ཏུ་རྨོངས་པས་འཕེལ་བར་འགྱུར། །\nདེ་ལས་ཀྱང་བཟློག་མེད་ཅེ་ན། །\nབདག་མེད་སྒོམ་པ་མཆོག་ཡིན་ནོ། །",
                            "children": []
                          }
                        ]
                      }
                    ]
                  }
                ]
              },
              {
                "level": "1.2.2.2",
                "title": "ཆོས་ཀྱི་བདག་མེད་བསྒོམ་ཚུལ།",
                "lines_span": "241-460",
                "children": [
                  {
                    "level": "1.2.2.2.1",
                    "title": "ལུས་དྲན་པ་ཉེར་བཞག་བསྒོམ་ཚུལ།",
                    "lines_span": "241-268",
                    "children": [
                      {
                        "level": "1.2.2.2.1.1",
                        "title": "ལུས་སྤྱིར་བརྟགས་པ།",
                        "lines_span": "241-256",
                        "line_text_excerpt": "ལུས་ནི་རྐང་པ་བྱིན་པ་མིན། །\nབརླ་དང་རྐེད་པའང་ལུས་མ་ཡིན། །\nལྟོ་དང་རྒྱབ་ཀྱང་ལུས་མིན་ཏེ། །\nབྲང་དང་དཔུང་པའང་ལུས་མ་ཡིན། །\nརྩིབ་ལོགས་ལག་པའང་ལུས་མིན་ཏེ༎ \nམཆན་ཁུང་ཕྲག་པའང་ལུས་མ་ཡིན༎ \nནང་ཁྲོལ་རྣམས་ཀྱང་དེ་མིན་ལ༎ \nམགོ་དང་མགྲིན་པའང་ལུས་མིན་ན༎ \nའདི་ལ་ལུས་ནི་གང་ཞིག་ཡིན༎\nགལ་ཏེ་ལུས་འདི་ཐམས་ཅད་ལ། །\nཕྱོགས་རེ་ཡིས་ནི་གནས་འགྱུར་ན། །\nཆ་རྣམས་ཆ་ལ་གནས་འགྱུར་མོད། །\nདེ་རང་ཉིད་ནི་གང་ལ་གནས། །\nགལ་ཏེ་བདག་ཉིད་ཀུན་གྱི་ལུས། །\nལག་སོགས་རྣམས་ལ་གནས་ན་ནི། །\nལག་སོགས་དེ་དག་ཇི་སྙེད་པ། །\nདེ་སྙེད་ཀྱི་ནི་ལུས་སུ་འགྱུར། །\nཕྱི་དང་ནང་ན་ལུས་མེད་ན། །\nཇི་ལྟར་ལག་སོགས་ལ་ལུས་ཡོད། །\nལག་སོགས་རྣམས་ལས་གཞན་མེད་ན། །\nདེ་ནི་ཇི་ལྟར་ཡོད་པ་ཡིན། །\nདེས་ན་ལུས་མེད་ལ་ལག་སོགས་ལ། །\nརྨོངས་པ་ཡིས་ནི་ལུས་བློར་འགྱུར། །\nདབྱིབས་སུ་བཀོད་པའི་ཁྱད་པར་གྱིས། །\nཐོ་ཡོར་ལ་ནི་མི་བློ་བཞིན། །\nཇི་སྲིད་རྐྱེན་ཚོགས་དེ་སྲིད་དུ། །\nལུས་ནི་སྐྱེས་བུ་ལྟར་སྣང་བ། །\nདེ་བཞིན་ཇི་སྲིད་ལག་སོགས་ལ། །\nདེ་ཡོད་དེ་སྲིད་དེ་ལུས་སྣང་། །",
                        "children": []
                      },
                      {
                        "level": "1.2.2.2.1.2",
                        "title": "ཡན་ལག་བྱེ་བྲག་ཏུ་བརྟགས་པ།",
                        "lines_span": "257-264",
                        "line_text_excerpt": "དེ་བཞིན་སོར་མོའི་ཚོགས་ཡིན་ཕྱིར། །\nལག་པའང་གང་ཞིག་ཡིན་པར་འགྱུར། །\nདེ་ཡང་ཚིགས་ཀྱི་ཚོགས་ཡིན་ཕྱིར། །\nཚིགས་ཀྱང་རང་གི་ཆ་ཕྱེ་བས། །\nཆ་ཡང་རྡུལ་དུ་ཕྱེ་བས་ཏེ། །\nརྡུལ་དེའང་ཕྱོགས་ཆའི་དབྱེ་བ་ཡིས། །\nཕྱོགས་དབྱེའང་ཆ་ཤས་དང་བྲལ་ཕྱིར། །\nམཁའ་བཞིན་དེས་ན་རྡུལ་ཡང་མེད། །",
                        "children": []
                      },
                      {
                        "level": "1.2.2.2.1.3",
                        "title": "དེས་ན་ལུས་ལ་ཆགས་པ་སྤོང་དགོས་པར་བསྟན་པ།",
                        "lines_span": "265-268",
                        "line_text_excerpt": "དེ་ལྟར་རྨི་ལམ་ལྟ་བུ་ཡི། །\nགཟུགས་ལ་དཔྱོད་ལྡན་སུ་ཞིག་ཆགས། །\nགང་ཚེ་དེ་ལྟར་ལུས་མེད་པ། །\nདེ་ཚེ་སྐྱེས་གང་བུད་མེད་གང་། །",
                        "children": []
                      }
                    ]
                  },
                  {
                    "level": "1.2.2.2.2",
                    "title": "ཚོར་བ་དྲན་པ་ཉེར་བཞག་བསྒོམ་ཚུལ།",
                    "lines_span": "269-308",
                    "children": [
                      {
                        "level": "1.2.2.2.2.1",
                        "title": "ཚོར་བའི་ངོ་བོ་ལ་བརྟགས་པ།",
                        "lines_span": "269-284",
                        "line_text_excerpt": "སྡུག་བསྔལ་དེ་ཁོ་ན་ཉིད་དུ་ཡོད་ན། །\nཅི་སྟེ་རབ་ཏུ་དགའ་བ་ལ་མི་གནོད། །\nབདེ་ན་མྱ་ངན་གདུང་སོགས་ལ། །\nཞིམ་སོགས་ཅི་སྟེ་དགའ་མི་བྱེད། །\nསྟོབས་དང་ལྡན་པས་ཟིལ་གྱིས་མནན་ཕྱིར། །\nགལ་ཏེ་དེ་མྱོང་མ་ཡིན་ན། །\nགང་ཞིག་ཉམས་སུ་མྱོང་བའི་བདག་ཉིད་མིན། །\nདེ་ཡི་ཚེ་ན་ཚོར་བ་ཇི་ལྟར་ཡིན། །\nསྡུག་བསྔལ་ཕྲ་མོ་ཉིད་དུ་ཡོད། །\nའདི་ཡི་རགས་པ་བསལ་མིན་ནམ། །\nདེ་ནི་དེ་ལས་གཞན་དགའ་ཙམ། །\nཞེ་ན་ཕྲ་ཉིད་དེ་ཡང་དེའི། །\nགལ་ཏེ་འགལ་རྐྱེན་སྐྱེས་པས་ན། །\nསྡུག་བསྔལ་སྐྱེས་པ་མིན་ན་ནི། །\nཚོར་བར་རྟོག་པ་མངོན་ཞེན་ཉིད། །\nཡིན་ཅེས་བྱ་བར་གྲུབ་མིན་ནམ། །\nདེ་ཉིད་ཕྱིར་ན་འདི་ཡི་ནི། །\nགཉེན་པོ་རྣམ་པར་དཔྱད་འདི་བསྒོམ་སྟེ། །\nརྣམ་པར་བརྟགས་ཞིང་ལས་བྱུང་བ་ཡི། །\nབསམ་གཏན་རྣལ་འབྱོར་པ་ཡི་ཟས། །",
                        "children": []
                      },
                      {
                        "level": "1.2.2.2.2.2",
                        "title": "ཚོར་བའི་རྒྱུ་ལ་བརྟགས་པ།",
                        "lines_span": "285-296",
                        "line_text_excerpt": "གལ་ཏེ་དབང་དོན་བར་བཅས་ན། །\nདེ་དག་གང་དུ་ཕྲད་པར་འགྱུར། །\nབར་མེད་ན་ཡང་གཅིག་ཉིད་དེ། །\nགང་ཞིག་གང་དང་འཕྲད་པར་འགྱུར། །\nརྡུལ་ཕྲན་རྡུལ་ཕྲན་ལ་འཇུག་མེད། །\nདེ་ནི་སྐབས་མེད་མཉམ་པ་ཡིན། །\nམ་ཞུགས་པ་ལ་འདྲེས་མེད་ཅིང༌། །\nམ་འདྲེས་པ་ལ་ཕྲད་པ་མེད། །\nཆ་མེད་པ་ལའང་ཕྲད་པ་ཞེས། །\nབྱ་བ་ཇི་ལྟར་འཐད་པར་འགྱུར། །\nཕྲད་པ་དང་ནི་ཆ་མེད་པར། །\nགལ་ཏེ་མཐོང་ན་བསྟན་པར་གྱིས། །\nརྣམ་པར་ཤེས་པ་ལུས་མེད་པ་ལ་ནི། །\nཕྲད་པ་འཐད་པ་མ་ཡིན་པ་ཉིད། །\nཚོགས་པའང་དངོས་པོ་མེད་ཕྱིར་ཏེ། །\nསྔར་ནི་ཇི་ལྟར་རྣམ་པར་དཔྱད་བཞིན། །\nདེ་ལྟར་རེག་པ་ཡོད་མིན་ན། །\nཚོར་བ་གང་ལས་འབྱུང་བར་འགྱུར། །\nངལ་འདི་ཅི་ཡི་དོན་དུ་ཡིན། །\nགང་གིས་གང་ལ་གནོད་པར་འགྱུར། །",
                        "children": []
                      },
                      {
                        "level": "1.2.2.2.2.3",
                        "title": "ཚོར་བའི་འབྲས་བུ་ལ་བརྟགས་པ།",
                        "lines_span": "297-300",
                        "line_text_excerpt": "གང་ཚེ་ཚོར་པོ་འགའ་མེད་ཅིང་། །\nཚོར་བའང་ཡོད་པ་མ་ཡིན་པན། །\nདེ་ཚེ་གནས་སྐབས་འདི་མཐོང་ནས། །\nསྲིད་པ་ཅི་ཕྱིར་ལྡོག་མི་འགྱུར། །",
                        "children": []
                      },
                      {
                        "level": "1.2.2.2.2.4",
                        "title": "ཚོར་བ་པོ་ལ་བརྟག་པ།",
                        "lines_span": "301-308",
                        "line_text_excerpt": "མཐོང་བ་འམ་ནི་རེག་པ་ཡང་། །\nརྨི་ལམ་སྒྱུ་འདྲའི་བདག་ཉིད་ཀྱིས། །\nསེམས་དང་ལྷན་ཅིག་སྐྱེས་པའི་ཕྱིར། །\nཚོར་བ་དེ་ཡིས་མཐོང་མ་ཡིན། །\nསྔར་དང་ཕྱི་མར་སྐྱེས་པས་ཀྱང་། །\nདྲན་པར་འགྱུར་གྱི་མྱོང་མ་ཡིན། །\nརང་གིས་བདག་ཉིད་མྱོང་མིན ལ། །\nགཞན་དག་གིས་ཀྱང་མྱོང་མ་ཡིན། །\nཚོར་བ་པོ་འགའ་ཡང་ཡོད་མིན་ཏེ། །\nདེས་ན་ཚོར་བ་དེ་ཉིད་མིན། །\nདེ་ལྟར་བདག་མེད་ཚོགས་འདི་ལ། །\nའདི་ཡིས་ཅི་སྟེ་གནོད་པར་བྱས། །",
                        "children": []
                      }
                    ]
                  },
                  {
                    "level": "1.2.2.2.3",
                    "title": "སེམས་དྲན་པ་ཉེར་བཞག་བསྒོམ་ཚུལ།",
                    "lines_span": "309-320",
                    "children": [
                      {
                        "level": "1.2.2.2.3.1",
                        "title": "སེམས་རང་བཞིན་མེད་པར་བསྟན་པ།",
                        "lines_span": "309-316",
                        "line_text_excerpt": "ཡིད་ནི་དབང་རྣམས་ལ་མི་གནས། །\nགཟུགས་སོགས་ལ་མིན་བར་ནའང་མིན། །\nནང་ན་སེམས་མིན་ཕྱི་མིན་ཞིང་། །\nགཞན་དུ་ཡང་ནི་རྙེད་མ་ཡིན། །\nགང་ཞིག་ལུས་མིན་གཞན་དུ་འང་མིན༹། །\nའདྲེས་མིན་ལོགས་སུའང་འགར་མེད་པ། །\nདེ་ནི་ཅུང་ཟད་མིན་དེའི་ཕྱིར། །\nསེམས་ཅན་རང་བཞིན་མྱ་ངན་འདས། །",
                        "children": []
                      },
                      {
                        "level": "1.2.2.2.3.2",
                        "title": "སེམས་སྐྱེ་བ་མེད་པར་བསྟན་པ།",
                        "lines_span": "317-320",
                        "line_text_excerpt": "ཤེས་བྱ་ལས་སྔར་ཤེས་ཡོད་ན། །\nདེ་ནི་ཅི་ལ་དམིགས་ནས་སྐྱེ། །\nཤེས་དང་ཤེས་བྱ་ལྷན་ཅིག་ན། །\nདེ་ནི་ཅི་ལ་དམིགས་ནས་སྐྱེ། །\nའོན་ཏེ་ཤེས་བྱའི་ཕྱིས་ཡོད་ན། །\nདེ་ཚེ་ཤེས་པ་གང་ལས་སྐྱེ། །",
                        "children": []
                      }
                    ]
                  },
                  {
                    "level": "1.2.2.2.4",
                    "title": "ཆོས་དྲན་པ་ཉེར་བཞག་བསྒོམ་ཚུལ།",
                    "lines_span": "321-336",
                    "children": [
                      {
                        "level": "1.2.2.2.4.1",
                        "title": "དངོས།",
                        "lines_span": "321-322",
                        "line_text_excerpt": "དེ་ལྟར་ཆོས་རྣམས་ཐམས་ཅད་ཀྱི། །\nསྐྱེ་བ་རྟོགས་པར་འགྱུར་མ་ཡིན། །",
                        "children": []
                      },
                      {
                        "level": "1.2.2.2.4.2",
                        "title": "དེ་ལ་རྩོད་པ་སྤོང་བ།",
                        "lines_span": "323-336",
                        "children": [
                          {
                            "level": "1.2.2.2.4.2.1",
                            "title": "བདེན་གཉིས་མི་འཐད་པའི་རྩོད་སྤོང་།",
                            "lines_span": "323-328",
                            "line_text_excerpt": "གལ་ཏེ་དེ་ལྟར་ཀུན་རྫོབ་མེད། །\nདེ་ལ་བདེན་གཉིས་ག་ལ་ཡོད། །\nདེ་ཡང་ཀུན་རྫོབ་གཞན་གྱིས་ན། །\nསེམས་ཅན་མྱ་ངན་ག་ལ་འདའ། །\nའདི་ནི་གཞན་སེམས་རྣམ་རྟོག་སྟེ། །\nདེ་ནི་རང་གི་ཀུན་རྫོབ་མིན། །\nཕྱིས་དེ་ངེས་ན་དེ་ཡོད་དེ། །\nམེད་ན་ཀུན་རྫོབ་མེད་པ་ཉིད། །",
                            "children": []
                          },
                          {
                            "level": "1.2.2.2.4.2.2",
                            "title": "གཏན་ཚིགས་མེད་པའི་རྩོད་སྤོང་།",
                            "lines_span": "329-330",
                            "line_text_excerpt": "རྟོག་དང་བརྟག་པར་བྱ་བ་དག །\nགཉིས་པོ་ཕན་ཚུན་བརྟེན་པ་ཡིན། །\nཇི་ལྟར་གྲགས་པ་ལ་བརྟེན་ནས། །\nརྣམ་པར་དཔྱད་པ་ཐམས་ཅད་བརྗོད། །",
                            "children": []
                          },
                          {
                            "level": "1.2.2.2.4.2.3",
                            "title": "རྣམ་དཔྱོད་ཐུག་མེད་དུ་འགྱུར་བའི་རྩོད་སྤོང་།",
                            "lines_span": "331-336",
                            "line_text_excerpt": "གང་ཚེ་རྣམ་པར་དཔྱད་པ་ཡི། །\nརྣམ་དཔྱོད་ཀྱིས་ནི་དཔྱོད་བྱེད་ན། །\nདེ་ཚེ་རྣམ་དཔྱོད་དེ་ཡང་ནི། །\nརྣམ་དཔྱོད་ཕྱིར་ན་ཐུག་པ་མེད། །\nདཔྱད་བྱ་རྣམ་པར་དཔྱད་བྱས་ན། །\nརྣམ་དཔྱོད་ལ་ནི་རྟེན་ཡོད་མིན། །\nརྟེན་མེད་ཕྱིར་ན་མི་སྐྱེ་སྟེ། །\nདེ་ཡང་མྱ་ངན་འདས་པར་བརྗོད། །",
                            "children": []
                          }
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "level": "1.2.3",
            "title": "གཏན་ཚིགས་ཀྱིས་སྒྲོ་འདོགས་གཅོད་པ།",
            "lines_span": "337-460",
            "children": [
              {
                "level": "1.2.3.1",
                "title": "དངོས་པོར་སྨྲ་བའི་སྒྲུབ་བྱེད་དགག་པ།",
                "lines_span": "337-352",
                "line_text_excerpt": "གང་གི་ལྟར་ན་འདི་གཉིས་བདེན། །\nདེ་ཉིད་ཤིན་ཏུ་དཀའ་བར་གནས། །\nགལ་ཏེ་ཤེས་དབང་ལས་དོན་གྲུབ། །\nཤེས་ཡོད་ཉིད་ལ་རྟེན་ཅི་ཡོད། །\nའོན་ཏེ་ཤེས་བྱ་ལས་ཤེས་གྲུབ། །\nཤེས་བྱ་ཡོད་ལའང་རྟེན་ཅི་ཡོད། །\nདེ་སྟེ་ཕན་ཚུན་དབང་གིས་ཡོད། །\nགཉིས་ཀ་ཡང་ནི་མེད་པར་འགྱུར། །\nགལ་ཏེ་བུ་མེད་ཕ་མིན་ན༎ \nབུ་ནི་གང་ལས་བྱུང་བ་ཡིན༎ \nབུ་མེད་པར་ནི་ཕ་མེད་པ༎ \nདེ་བཞིན་དེ་གཉིས་མེད་པ་ཉིད༎\nམྱུ་གུ་ས་བོན་ལས་སྐྱེ་ཞིང་། །\nས་བོན་དེ་ཉིད་ཀྱིས་རྟོགས་བཞིན། །\nཤེས་བྱ་ལས་སྐྱེས་ཤེས་པ་ཡིས། །\nདེ་ཡོད་པ་ནི་ཅིས་མི་རྟོགས། །\nམྱུ་གུ་ལས་གཞན་ཤེས་པ་ཡིས། །\nས་བོན་ཡོད་ཅེས་རྟོགས་པར་འགྱུར་ན། །\nགང་ཕྱིར་ཤེས་བྱ་དེ་རྟོགས་པར། །\nཤེས་པ་ཡོད་ཉིད་གང་ལས་རྟོགས། །",
                "children": []
              },
              {
                "level": "1.2.3.2",
                "title": "སྟོང་པར་སྨྲ་བའི་སྒྲུབ་བྱེད་དགོད་པ།",
                "lines_span": "353-460",
                "children": [
                  {
                    "level": "1.2.3.2.1",
                    "title": "རྒྱུ་ལ་དཔྱོད་པ་རྡོ་རྗེའི་ཟེགས་མའི་གཏན་ཚིགས།",
                    "lines_span": "353-428",
                    "children": [
                      {
                        "level": "1.2.3.2.1.1",
                        "title": "རྒྱུ་མེད་ལས་སྐྱེ་བར་འདོད་པ་དགག་པ།",
                        "lines_span": "353-356",
                        "line_text_excerpt": "རེ་ཞིག་འཇིག་རྟེན་མངོན་སུམ་གྱིས། །\nརྒྱུ་རྣམས་ཐམས་ཅད་མཐོང་བ་ཡིན། །\nཔདྨའི་སྡོང་བུ་བྱེ་བ་ནི། །\nརྒྱུ་ཡི་དབྱེ་བས་བསྐྱེད་པ་ཡིན། །",
                        "children": []
                      },
                      {
                        "level": "1.2.3.2.1.2",
                        "title": "གཞན་ལས་སྐྱེ་བར་འདོད་པ་དགག་པ།",
                        "lines_span": "357-380",
                        "line_text_excerpt": "རྒྱུ་དབྱེ་བྱ་གང་གིས་བྱས་ཤེ་ན། །\nསྔར་གྱི་རྒྱུ་དབྱེ་ཉིད་ལས་སོ། །\nཅི་ཕྱིར་རྒྱུ་ཡིས་འབྲས་སྐྱེད་ནུས། །\nསྔར་གྱི་རྒྱུ་ཡི་མཐུ་ཉིད་ལས། །\nདབང་ཕྱུག་འགྲོ་བའི་རྒྱུ་ཡིན་ན། །\nརེ་ཞིག་དབང་ཕྱུག་གང་ཡིན་སྨྲོས། །\nའབྱུང་རྣམས་ཞེ་ན་དེ་ལྟ་མོད། །\nམིང་ཙམ་ལ་ཡང་ཅི་ཞིག་ངལ། །\nའོན་ཀྱང་ས་སོགས་དུ་མ་དང་། །\nམི་རྟག་གཡོ་མེད་ལྷ་མིན་ཞིང་། །\nབགོམ་བྱ་ཉིད་དང་མི་གཙང་བས། །\nདེ་ནི་དབང་ཕྱུག་ཉིད་མ་ཡིན། །\nདབང་ཕྱུག་མཁའ་མིན་གཡོ་མེད་ཕྱིར༎ \nབདག་མིན་སྔར་ནི་བཀག་ཟིན་ཕྱིར༎ \nབསམ་མིན་པ་ཡི་བྱེད་པོ་ཡང་༎ \nབསམ་མིན་བརྗོད་པས་ཅི་ཞིག་བྱ༎\nདེས་བསྐྱེད་འདོད་པའང་གང་ཞིག་ཡིན༎ \nབདག་ནི་དེ་དང་ས་སོགས་དང་༎ \nདབང་ཕྱུག་ངོ་བོའང་རྟག་མིན་ནམ༎ \nཤེས་པ་ཤེས་བྱ་ལས་སྐྱེ་དང་༎\nཐོག་མེད་བདེ་སྡུག་ལས་ལས་ཡིན། །\nདེ་ཡིས་གང་ཞིག་བསྐྱེད་པ་སྨྲོས། །\nརྒྱུ་ལ་ཐོག་མ་ཡོད་མིན་ན། །\nའབྲས་བུའི་ཐོག་མ་ག་ལ་ཡོད། །\nརྟག་ཏུ་ཅི་ཕྱིར་བྱེད་མིན་ཏེ། །\nདེ་ནི་གཞན་ལ་ལྟོས་པ་མིན། །\nདེས་བྱས་མིན་གཞན་ཡོད་མིན་ན། །\nདེས་འདི་གང་ལ་ལྟོས་པར་འགྱུར། །\nགལ་ཏེ་ལྟོས་ན་ཚོགས་པ་ཉིད། །\nརྒྱུ་ཡིན་འགྱུར་གྱི་དབང་ཕྱུག་མིན། །\nཚོགས་ན་མི་སྐྱེ་དབང་མེད་ཅིང་། །\nདེ་མེད་པར་ནི་སྐྱེ་དབང་མེད། །\nགལ་ཏེ་དབང་ཕྱུག་མི་འདོད་བཞིན། །\nབྱེད་ན་གཞན་གྱི་དབང་དུ་ཐལ། །\nའདོད་ནའང་འདོད་ལ་རག་ལས་འགྱུར། །\nབྱེད་ན་དབང་ཕྱུག་ག་ལ་ཡིན། །",
                        "children": []
                      },
                      {
                        "level": "1.2.3.2.1.3",
                        "title": "བདག་ལས་སྐྱེ་བར་འདོད་པ་དགག་པ།",
                        "lines_span": "381-420",
                        "line_text_excerpt": "གང་དག་རྡུལ་ཕྲན་རྟག་སྨྲ་བ༎ \nདེ་དག་ཀྱང་ནི་སྔར་བཟློག་ཟིན༎ \nགཙོ་བོ་རྟག་པ་འགྲོ་བ་ཡི༎ \nརྒྱུ་ཡིན་པར་ནི་གྲངས་ཅན་འདོད༎\nསྙིང་སྟོབས་རྡུལ་དང་མུན་པ་ཞེས། །\nབྱ་བའི་ཡོན་ཏན་མཉམ་གནས་ནི། །\nགཙོ་བོ་ཞེས་བྱར་རབ་བརྗོད་དེ། །\nམི་མཉམ་འགྲོ་བ་ཡིན་པར་བརྗོད། །\nགཅིག་ལ་རང་བཞིན་གསུམ་ཉིད་ནི། །\nརིགས་མིན་དེས་ན་དེ་ཡོད་མིན། །\nདེ་བཞིན་ཡོན་ཏན་ཡོད་མིན་ཏེ། །\nདེ་ཡང་སོ་སོར་རྣམ་གསུམ་ཕྱིར། །\nཡོན་ཏན་མེད་ན་སྒྲ་སོགས་ཀྱང་། །\nཡོད་ཉིད་ཤིན་ཏུ་རྒྱང་རིང་འགྱུར། །\nསེམས་མེད་གོས་ལ་སོགས་པ་ལ། །\nབདེ་སོགས་ཡོད་པ་སྲིད་པའང་མིན། །\nདངོས་རྣམས་དེ་རྒྱུའི་རང་བཞིན་ན། །\nདངོས་པོ་རྣམས་དཔྱད་ཟིན་མིན་ནམ། །\nཁྱོད་ཀྱི་རྒྱུ་ཡང་བདེ་སོགས་ཉིད། །\nདེ་ལས་སྣམ་སོགས་འབྱུང་བ་མེད། །\nསྣམ་སོགས་ལས་ནི་བདེ་སོགས་ཡིན། །\nདེ་མེད་ཕྱིར་ན་བདེ་སོགས་མེད། །\nབདེ་སོགས་རྟག་པ་ཉིད་དུ་ཡང་། །\nནམ་ཡང་དམིགས་པ་ཡོད་མ་ཡིན། །\nབདེ་སོགས་གསལ་བ་ཡོད་ཉིད་ན། །\nམྱོང་བ་ཅི་ཕྱིར་འཛིན་མ་ཡིན། །\nདེ་ཉིད་ཕྲ་མོར་གྱུར་ན་དེ། །\nརགས་དང་ཕྲ་བའང་ཇི་ལྟར་ཡིན། །\nརགས་པ་དོར་ནས་ཕྲ་གྱུར་བས། །\nཕྲ་རགས་དེ་དག་མི་རྟག་ཉིད། །\nདེ་བཞིན་དངོས་པོ་ཐམས་ཅད་ནི། །\nམི་རྟག་ཉིད་དུ་ཅིས་མི་འདོད། །\nརགས་པ་བདེ་ལས་གཞན་མིན་ན། །\nབདེ་བ་གསལ་བར་མི་རྟག་ཉིད། །\nགལ་ཏེ་མེད་པ་འགའ་ཡང་ནི། །\nསྐྱེ་མིན་མེད་ཕྱིར་ཞེས་འདོད་ན། །\nགསལ་བ་མེད་པ་སྐྱེ་བར་ནི། །\nཁྱོད་མི་འདོད་ཀྱང་གནས་པ་ཉིད། །\nགལ་ཏེ་རྒྱུ་ལ་འབྲས་གནས་ན། །\nཟན་ཟ་མི་གཙང་ཟ་བར་འགྱུར། །\nརས་ཀྱི་རིན་གྱིས་རས་བལ་གྱི། །\nས་བོན་ཉོས་ལ་བགོ་བར་གྱིས། །\nའཇིག་རྟེན་རྨོངས་པས་མ་མཐོང་ན། །\nདེ་ཉིད་ཤེས་ཀྱིའང་གཞག་དེ་ཉིད། །\nཤེས་དེ་འཇིག་རྟེན་ལ་ཡང་ནི། །\nཡོད་པས་ཅི་སྟེ་མཐོང་མ་ཡིན། །\nའཇིག་རྟེན་ཚད་མ་ཉིད་མིན་ན། །\nགསལ་བ་མཐོང་བའང་བདེན་མ་ཡིན། །\nགལ་ཏེ་ཚད་མ་ཚད་མིན་ན། །\nདེས་གཞལ་རྫུན་པར་མི་འགྱུར་རམ། །\nདེ་ཉིད་དུ་ན་སྟོང་པ་ཉིད། །\nབསྒོམ་པ་དེ་ཕྱིར་མི་འཐད་འགྱུར། །\nབརྟགས་པའི་དངོས་ལ་མ་རེག་པར། །\nདེ་ཡི་དངོས་མེད་འཛིན་མ་ཡིན། །\nདེ་ཕྱིར་རྫུན་པའི་དངོས་གང་ཡིན། །\nདེ་ཡི་དངོས་མེད་གསལ་བར་རྫུན། །\nདེས་ན་རྨི་ལམ་བུ་ཤི་ལ། །\nདེ་མེད་སྙམ་པའི་རྣམ་རྟོག་ནི། །\nདེ་ཡོད་རྣམ་པར་རྟོག་པ་ཡི། །\nགེགས་ཡིན་དེ་ཡང་བརྫུན་པ་ཡིན། །",
                        "children": []
                      },
                      {
                        "level": "1.2.3.2.1.4",
                        "title": "གཏན་ཚིགས་ཀྱི་དོན་བསྡུ་བ།",
                        "lines_span": "421-428",
                        "line_text_excerpt": "དེ་བས་དེ་ལྟར་རྣམ་དཔྱད་པས༎ \nའགའ་ཡང་རྒྱུ་མེད་ཡོད་མ་ཡིན༎ \nསོ་སོ་བའམ་འདུས་པ་ཡི༎ \nརྐྱེན་རྣམས་ལ་ཡང་གནས་མ་ཡིན༎\nགཞན་ནས་འོངས་པའང་མ་ཡིན་ལ། །\nགནས་པ་མ་ཡིན་འགྲོ་མ་ཡིན། །\nརྨོངས་པས་བདེན་པར་གང་བྱས་འདི། །\nསྒྱུ་མ་ལས་ནི་ཁྱད་ཅི་ཡོད། །",
                        "children": []
                      }
                    ]
                  },
                  {
                    "level": "1.2.3.2.2",
                    "title": "ངོ་བོ་ལ་དཔྱོད་པ་རྟེན་འབྲེལ་ཆེན་མོ།",
                    "lines_span": "429-436",
                    "line_text_excerpt": "སྒྱུ་མས་སྤྲུལ་པ་གང་ཡིན་དང་། །\nརྒྱུ་རྣམས་ཀྱིས་ནི་གང་སྤྲུལ་པ། །\nདེ་ནི་གང་ནས་འོངས་གྱུར་ཅིང་། །\nགང་དུ་འགྲོ་བའང་བརྟག་པར་གྱིས། །\nགང་ཞིག་གང་ནི་ཉེ་བ་ཡིས། །\nམཐོང་འགྱུར་དེ་མེད་ན་མིན་པ། །\nབཅོས་བུ་གཟུགས་བརྙན་དང་མཚུངས་པ། །\nདེ་ལ་བདེན་ཉིད་ཇི་ལྟར་ཡོད། །",
                    "children": []
                  },
                  {
                    "level": "1.2.3.2.3",
                    "title": "འབྲས་བུ་ལ་དཔྱོད་པ་ཡོད་མེད་སྐྱེ་འགོག",
                    "lines_span": "437-460",
                    "line_text_excerpt": "དངོས་པོ་ཡོད་པར་གྱུར་པ་ལ། །\nརྒྱུ་ཡིས་དགོས་པ་ཅི་ཞིག་ཡོད། །\nའོན་ཏེ་དེ་ནི་མེད་ན་ཡང་། །\nརྒྱུ་ཡིས་དགོས་པ་ཅི་ཞིག་ཡོད། །\nབྱེ་བ་བརྒྱ་ཕྲག་རྒྱུ་ཡིས་ཀྱང་། །\nདངོས་པོ་མེད་པ་བསྒྱུར་དུ་མེད། །\nགནས་སྐབས་དེ་དངོས་ཇི་ལྟར་ཡིན། །\nདངོས་འགྱུར་གཞན་ཡང་གང་ཞིག་ཡིན། །\nམེད་པའི་ཚེ་དངོས་ཡོད་སྲིད་མིན་ན། །\nདངོས་པོ་ཡོད་པར་ནམ་ཞིག་འགྱུར། །\nདངོས་པོ་སྐྱེས་པར་མ་གྱུར་པར། །\nདངོས་མེད་དེ་དང་ནི་འབྲལ་མི་འགྱུར །\nདངོས་མེད་དང་ནི་མ་བྲལ་ན། །\nདངོས་པོ་ཡོད་པའི་སྐབས་མི་སྲིད། །\nདངོས་པོའང་མེད་པར་འགྱུར་མིན་ཏེ། །\nརང་བཞིན་གཉིས་སུ་ཐལ་འགྱུར་ཕྱིར། །\nདེ་ལྟར་འགག་པ་ཡོད་མིན་ཞིང་། །\nདངོས་པོའང་ཡོད་མིན་དེ་ཡི་ཕྱིར། །\nའགྲོ་བ་འདི་དག་ཐམས་ཅད་ནི། །\nརྟག་ཏུ་མ་སྐྱེས་མ་འགགས་ཉིད། །\nའགྲོ་བ་རྨི་ལམ་ལྟ་བུ་སྟེ། །\nརྣམ་པར་དཔྱད་ན་ཆུ་ཤིང་བཞིན། །\nམྱ་ངན་འདས་དང་མ་འདས་པའང་། །\nདེ་ཁོ་ན་ནི་ཁྱད་པར་མེད། །",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "level": "1.2.4",
            "title": "སྟོང་ཉིད་རྟོགས་པའི་བྱེད་ལས།",
            "lines_span": "461-520",
            "children": [
              {
                "level": "1.2.4.1",
                "title": "རང་དོན་དུ་ཆོས་བརྒྱད་མགོ་སྙོམས་པ།",
                "lines_span": "461-476",
                "line_text_excerpt": "དེ་ལྟར་སྟོང་པའི་དངོས་རྣམས་ལ། །\nཐོབ་པ་ཅི་ཡོད་ཤོར་ཅི་ཡོད། །\nགང་གིས་རིམ་གྲོ་བྱས་པའམ། །\nཡོངས་སུ་བརྙས་པའང་ཅི་ཞིག་ཡོད། །\nབདེ་བའམ་སྡུག་བསྔལ་གང་ལས་ཡིན། །\nམི་དགར་ཅི་ཡོད་དགར་ཅི་ཡོད། །\nདེ་ཉིད་དུ་ནི་བཙལ་བྱས་ན། །\nགང་ཞིག་སྲེད་ཅིང་གང་ལ་སྲེད། །\nདཔྱད་ན་གསོན་པའི་འཇིག་རྟེན་འདི། །\nགང་ཞིག་འདིར་ནི་འཆི་འགྱུར་ཏེ། །\nའབྱུང་འགྱུར་གང་ཡིན་བྱུང་གྱུར་གང་། །\nགཉེན་དང་བཤེས་ཀྱང་གང་ཞིག་ཡིན། །\nཐམས་ཅད་ནམ་མཁའ་འདྲ་བར་ནི། །\nབདག་འདྲས་ཡོངས་སུ་བཟུང་བར་གྱིས། །\nབདག་ཉིད་བདེ་བར་འདོད་རྣམས་ནི། །\nའཐབ་དང་སྤྲོ་བའི་རྒྱུ་དག་གིས། །\nརབ་ཏུ་འཁྲུག་དང་དགའ་བར་བྱེད༎ \nམྱ་ངན་འབད་རྩོལ་རྩོད་པ་དང་༎ \nཕན་ཚུན་གཅོད་དང་འབིགས་པ་དང་༎ \nསྡིག་དག་གིས་ནི་ཚེགས་ཆེན་འཚོ༎",
                "children": []
              },
              {
                "level": "1.2.4.2",
                "title": "གཞན་དོན་དུ་བརྩེ་བའི་སྙིང་རྗེ་ཆེན་པོ་རྩོལ་མེད་དུ་འབྱུང་བ།",
                "lines_span": "477-520",
                "line_text_excerpt": "བདེ་འགྲོར་ཡང་དང་ཡང་འོངས་ཏེ། །\nབདེ་བ་མང་པོ་སྤྱད་སྤྱད་ནས། །\nཤི་ནས་ངན་སོང་སྡུག་བསྔལ་ནི། །\nཡུན་རིང་མི་བཟད་རྣམས་སུ་ལྟུང་། །\nསྲིད་པ་ན་ནི་གཡང་ས་མང་། །\nདེར་ནི་དེ་ཉིད་མིན་འདི་འདྲ། །\nདེར་ཡང་ཕན་ཚུན་འགལ་བས་ན། །\nསྲིད་ན་དེ་ཉིད་འདི་འདྲ་མེད། །\nདེར་ཡང་དཔེ་མེད་མི་བཟད་པའི། །\nསྡུག་བསྔལ་རྒྱ་མཚོ་མཐའ་ལས་འདས། །\nདེར་ནི་དེ་ལྟར་སྟོབས་ཆུང་ཞིང་། །\nདེར་ནི་ཚེ་ཡང་ཐུང་བ་ཉིད། །\nདེར་ཡང་གསོན་དང་ནད་མེད་ཀྱི། །\nབྱེད་དང་བཀྲེས་པའི་ངལ་བ་དང་། །\nགཉིད་དང་འཚེ་དང་དེ་བཞིན་དུ། །\nབྱིས་དང་འགྲོགས་པ་དོན་མེད་ཀྱིས། །\nཚེ་ནི་དོན་མེད་མྱུར་འདའ་ཞིང་། །\nརྣམ་དཔྱོད་ཤིན་ཏུ་རྙེད་པར་དཀའ། །\nདེར་ཡང་རྣམ་གཡེང་གོམས་པ་ནི། །\nབཟློག་པའི་ཐབས་ནི་ག་ལ་ཡོད། །\nདེར་ཡང་ངན་སོང་ཆེན་པོར་ནི། །\nལྟུང་ཕྱིར་བདུད་ནི་བརྩོན་པར་བྱེད། །\nདེར་ནི་ལོག་པའི་ལམ་མང་ཞིང༌། །\nཐེ་ཚོམ་ལས་ཀྱང་བརྒལ་དཀའ་སྟེ། །\nསླར་ཡང་དལ་བ་རྙེད་དཀའ་ཞིང་། །\nསངས་རྒྱས་འབྱུང་བ་རྙེད་ཤིན་ཏུ་དཀའ། །\nཉོན་མོངས་ཆུ་བོ་སྤང་དཀའ་སྟེ། །\nཨེ་མ་སྡུག་བསྔལ་བརྒྱུད་པར་འགྱུར། །\nདེ་ལྟར་ཤིན་ཏུ་སྡུག་བསྔལ་ཡང་། །\nརང་སྡུག་མི་མཐོང་གང་ཡིན་པ། །\nསྡུག་བསྔལ་ཆུ་བོར་གནས་འདི་དག །\nཀྱི་ཧུད་མྱ་ངན་བྱ་བར་འོས། །\nདཔེར་ན་འགའ་ཞིག་ཡང་ཡང་ཁྲུས། །\nབྱས་ཏེ་ཡང་ཡང་མེར་འཇུག་པ། །\nདེ་ལྟར་ཤིན་ཏུ་སྡུག་བསྔལ་བར། །\nགནས་ཀྱང་བདག་ཉིད་བདེར་རློམ་བཞིན། །\nདེ་ལྟར་རྒ་དང་འཆི་མེད་པ། །\nབཞིན་དུ་སྤྱོད་པས་གནས་རྣམས་ལ། །\nདང་པོ་ཉིད་དུ་བསད་བྱས་ནས། །\nངན་སོང་ལྟུང་བ་མི་བཟད་འོང་། །\nདེ་ལྟར་སྡུག་བསྔལ་མེས་གདུངས་ལ། །\nབསོད་ནམས་སྤྲིན་ལས་ལེགས་བྱུང་བའི། །\nརང་གི་བདེ་བའི་ཚོགས་ཆར་གྱིས། །\nཞི་བྱེད་པར་བདག་ནམ་ཞིག་འགྱུར། །\nནམ་ཞིག་དམིགས་པ་མེད་ཚུལ་དུ། །\nགུས་པས་བསོད་ནམས་ཚོགས་བསགས་ཏེ། །\nདམིགས་པས་ཕུང་བར་གྱུར་པ་རྣམས་ལ། །\nསྟོང་པ་ཉིད་ནི་སྟོན་པར་འགྱུར། །",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "level": "1.3",
        "title": "ལེའུའི་མཚན།",
        "lines_span": "521-522",
        "line_text_excerpt": "བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་ལས། \nཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལེའུ་སྟེ་དགུ་པའོ།། །།",
        "children": []
      }
    ]
  }
]