[
    {
      "level": "chapter",
      "number": "2",
      "title": "Confession of Negativity",
      "verses_span": "1-65",
      "summary": {
        "content_summary": "ལེའུ་འདིས་བྱང་ཆུབ་ཀྱི་སེམས་སྐྱེ་བའི་གཞི་རྩ་སྟེ། སྒྲིབ་པ་སྦྱོང་བ་དང་ཚོགས་གསོག་པའི་ཐབས་ལམ་ལ་གཙོ་བོར་འགྲེལ་བཤད་བྱེད། དེ་ཡང་མཆོད་པ་འབུལ་བ། ཕྱག་འཚལ་བ། སྐྱབས་སུ་འགྲོ་བ། སྡིག་པ་བཤགས་པ་བཅས་སྒོ་བཞིའི་ཐོག་ནས་སེམས་རྒྱུད་སྦྱོང་བའི་རིམ་པ་ཞིབ་རྒྱས་སུ་སྟོན། ཐོག་མར་དངོས་པོའི་མཆོད་པ་དང་ཡིད་ཀྱིས་སྤྲུལ་པའི་མཆོད་པ་སྣ་ཚོགས་ཕུལ་ཏེ་བསོད་ནམས་ཀྱི་ཚོགས་གསོག་པ་དང་། དེ་ནས་ཕྱག་འཚལ་བ་དང་སྐྱབས་སུ་འགྲོ་བས་དད་པ་དང་ཡིད་ཆེས་བརྟན་པོ་བསྐྱེད། མཐར་སྟོབས་བཞིའི་སྒོ་ནས་སྡིག་པ་བཤགས་ཏེ་སེམས་རྒྱུད་ཀྱི་དྲི་མ་སྦྱོང་བ་བཅས་ནི་བྱང་སེམས་སྐྱེ་བའི་ཞིང་ས་གཤིན་པོ་ཞིག་བསྐྲུན་པའི་ཐབས་ལམ་ཡིན།",
        "key_concepts": [
          "མཆོད་པ་འབུལ་བ།",
          "ཕྱག་འཚལ་བ།",
          "སྐྱབས་སུ་འགྲོ་བ།",
          "སྡིག་པ་བཤགས་པ།",
          "སྟོབས་བཞི།",
          "བསོད་ནམས་ཀྱི་ཚོགས།",
          "སྒྲིབ་པ་སྦྱོང་བ།"
        ],
        "transformative_goal": "སྒྲིབ་པ་སྦྱང་ཞིང་ཚོགས་གཉིས་བསགས་པའི་སྒོ་ནས་བྱང་ཆུབ་ཀྱི་སེམས་རིན་པོ་ཆེ་སྐྱེ་བའི་སྣོད་རུང་གི་སེམས་རྒྱུད་ཅིག་བསྐྲུན་རྒྱུ།",
        "function_in_hierarchy": "གཞུང་འདིའི་ལག་ལེན་གྱི་སྙིང་པོ་སྟེ་བྱང་ཆུབ་ཀྱི་སེམས་བསྐྱེད་པའི་སྔོན་འགྲོའི་སྦྱོར་བའི་ཆོས་རྣམས་སྟོན་པའི་ལེའུ་གཙོ་བོ་དེ་ཡིན། ལེའུ་དང་པོས་ཕན་ཡོན་བསྟན་ནས་སྤྲོ་བ་བསྐྱེད་པ་ལ་བརྟེན་ནས། ལེའུ་འདིས་དངོས་སུ་ཉམས་སུ་ལེན་རྒྱུའི་ཐབས་ལམ་རྣམས་གསལ་སྟོན་བྱེད།",
        "inter_node_relationships": [],
        "implicit_concepts": [
          "རྒྱུ་དང་འབྲས་བུའི་འབྲེལ་བ།",
          "ནང་སེམས་ཀྱི་རྣམ་པས་ཕྱི་རོལ་གྱི་བྱ་བ་ལ་ནུས་པ་ཐོན་ཚུལ།",
          "ཉམས་ལེན་གྱི་རིམ་པ་དང་གོ་རིམ།"
        ],
        "pedagogical_strategy": "རིམ་པ་བཞིན་པའི་སློབ་ཁྲིད་ཐབས་ལམ་སྤྱད་དེ། དང་པོ་ཕྱི་དངོས་པོའི་བྱ་བ་སྟེ་མཆོད་འབུལ་དང་ཕྱག་འཚལ་བ་ནས་འགོ་བཙུགས་ཏེ། རིམ་བཞིན་ནང་སེམས་ཀྱི་གནས་བབ་སྟེ་སྐྱབས་འགྲོ་དང་བཤགས་པ་ལ་འཇུག་པར་བྱེད།",
        "intended_impact_on_reader": "ཉམས་ལེན་གྱི་སྔོན་འགྲོའི་གལ་ཆེའི་རང་བཞིན་ལ་གོ་བ་ཟབ་མོ་སྐྱེ་စေཔ་དང་། རྒྱུན་གྱི་བྱ་སྤྱོད་དག་ཆོས་དང་འབྲེལ་བའི་ཐབས་ལམ་ཞིག་སྦྱིན་ནས་ཉམས་ལེན་དངོས་ལ་འཇུག་པའི་སྤྲོ་བ་བསྐྱེད་རྒྱུ།",
        "audience_assumptions": "ཀློག་པ་པོ་ནི་བྱང་ཆུབ་ཀྱི་སེམས་ལ་སྤྲོ་བ་ཡོད་མོད། འོན་ཀྱང་དེ་ཇི་ལྟར་བསྐྱེད་པའི་ཐབས་ལམ་གྱི་རིམ་པ་གསལ་བོ་མི་ཤེས་པའི་ཐོག་མའི་ཉམས་ལེན་པ་ཞིག་ཡིན་པར་ཆ་འཇོག་བྱེད།"
      },
      "children": [
        {
          "level": "section",
          "number": "2.1",
          "title": "The making of offerings",
          "verses_span": "1-23",
          "summary": {
            "content_summary": "ས་བཅད་འདིས་བྱང་སེམས་བསྐྱེད་པའི་ཐབས་ལམ་གཙོ་བོ་སྟེ་བསོད་ནམས་ཀྱི་ཚོགས་གསོག་པའི་ཆེད་དུ་མཆོད་པ་འབུལ་བའི་རིམ་པ་རྒྱས་པར་སྟོན། དེ་ལ་དངོས་པོའི་མཆོད་པ། ལུས་ཀྱི་མཆོད་པ། ཡིད་ཀྱིས་སྤྲུལ་པའི་མཆོད་པ། སྨོན་ལམ་གྱི་མཆོད་པ། བླ་ན་མེད་པའི་མཆོད་པ། དབྱངས་ཀྱིས་བསྟོད་པའི་མཆོད་པ་བཅས་རིམ་པ་མང་པོའི་སྒོ་ནས་མཆོད་པའི་ཡུལ་དཀོན་མཆོག་གསུམ་ལ་ཇི་ལྟར་མཆོད་དགོས་ཚུལ་གསལ་བཤད་བྱེད། མཆོད་པ་འདི་དག་གི་དམིགས་ཡུལ་ནི་སེར་སྣ་སོགས་ཀྱི་དྲི་མ་དག་པ་དང་སེམས་རྒྱུད་གཙང་ཞིང་དྭངས་པར་བྱས་ཏེ་བྱང་སེམས་སྐྱེ་བའི་རྟེན་བསྐྲུན་རྒྱུ་དེ་ཡིན།",
            "key_concepts": [
              "དངོས་པོའི་མཆོད་པ།",
              "ཡིད་ཀྱིས་སྤྲུལ་པའི་མཆོད་པ།",
              "ལུས་ཀྱི་མཆོད་པ།",
              "བླ་ན་མེད་པའི་མཆོད་པ།",
              "དག་པ་གསུམ།"
            ],
            "transformative_goal": "སེར་སྣ་དང་ཆགས་ཞེན་གྱི་འཆིང་བ་ལས་གྲོལ་ཏེ། གཏོང་ཕོད་དང་དགའ་སྤྲོའི་ངང་ནས་རང་གི་ལོངས་སྤྱོད་ཐམས་ཅད་ཆོས་ཀྱི་ལམ་དུ་བཀོལ་བའི་བསམ་བློ་ཞིག་བསྐྱེད་རྒྱུ།",
            "function_in_hierarchy": "ལེའུ་ཡི་སྡེ་ཚན་དང་པོ་འདིས་བསོད་ནམས་ཀྱི་ཚོགས་གསོག་པའི་ལག་ལེན་དངོས་ལ་འཇུག་པའི་སྒོ་འབྱེད། དེས་ལེའུའི་ཕྱེད་སྔ་མ་ཡོངས་རྫོགས་ཟིན་ཡོད་ལ། འདི་ནི་སྡིག་བཤགས་ཀྱི་སྔོན་དུ་འགྲོ་བའི་ཚོགས་གསོག་པའི་ཡན་ལག་གཙོ་བོ་ཡིན།",
            "inter_node_relationships": [
              {
                "related_node_id": "2.4",
                "relationship_type": "གསབ་རེས་བྱེད་པ།",
                "conceptual_bridge": "ས་བཅད་འདིས་ཚོགས་བསགས་པ་དང་། ས་བཅད་ ༢.༤ གིས་སྒྲིབ་པ་སྦྱོང་བར་བྱེད་པས། ཡན་ལག་གཉིས་ཀྱིས་བྱང་སེམས་བསྐྱེད་པའི་སྔོན་འགྲོའི་ཆ་རྐྱེན་ཆ་ཚང་བར་བསྐྲུན།"
              }
            ],
            "implicit_concepts": [
              "སེམས་ཀྱི་ནུས་པ།",
              "མཆོད་པའི་མཚོན་དོན།",
              "དངོས་པོ་དང་འབྱོར་བའི་རིན་ཐང་བསྐྱར་དུ་ངོས་འཛིན་པ།"
            ],
            "pedagogical_strategy": "འཆར་ཡན་དང་དད་པའི་ནུས་པ་བེད་སྤྱོད་ནས། དངོས་སུ་ཡོད་པའི་མཆོད་རྫས་ནས་འཇིག་རྟེན་ཁམས་ན་ཡོད་པའི་དངོས་པོ་ཐམས་ཅད་ཡིད་ཀྱིས་དམིགས་ཏེ་འབུལ་བའི་བར་རིམ་བཞིན་རྒྱ་བསྐྱེད་དེ་སློབ་ཁྲིད་བྱེད། དེས་ཉམས་ལེན་པའི་བློ་རྒྱ་དང་བསོད་ནམས་ཀྱི་ཚད་གཉིས་ཀ་ཆེ་རུ་གཏོང་།",
            "intended_impact_on_reader": "ཀློག་པ་པོའི་བསམ་བློའི་ནང་མཆོད་འབུལ་གྱི་ལག་ལེན་དེ་རྒྱུན་གྱི་ཆོ་ག་ཙམ་མ་ཡིན་པར། བསམ་གྱིས་མི་ཁྱབ་པའི་བསོད་ནམས་གསོག་པའི་ཐབས་ལམ་གཏིང་ཟབ་ཅིག་ཡིན་པའི་ངེས་ཤེས་བསྐྱེད་རྒྱུ།",
            "audience_assumptions": "ཀློག་པ་པོ་ལ་མཆོད་འབུལ་སྐོར་གྱི་གོ་རྟོགས་གཞི་རྩ་ཙམ་ཡོད་ཀྱང་། དེའི་རྒྱ་ཆེ་བ་དང་གཏིང་ཟབ་པའི་དོན་ལ་གོ་བ་ཆ་ཚང་མེད་པར་ཆ་འཇོག་བྱེད།"
          },
          "children": [
            {
              "level": "subsection",
              "number": "2.1.1",
              "title": "Material offerings",
              "verses_span": "1-7",
              "summary": {
                "content_summary": "ས་བཅད་འདིས་དངོས་པོའི་མཆོད་པ་འབུལ་ཚུལ་རིམ་པ་གཉིས་ཀྱི་སྒོ་ནས་སྟོན། དང་པོ་རང་གི་མཁོ་ཆས་དང་ལོངས་སྤྱོད་དག་པ་གསུམ་གྱི་སྒོ་ནས་འབུལ་བ་དང་། གཉིས་པ་ནི་བདག་པོ་མེད་པའི་འཇིག་རྟེན་གྱི་དངོས་པོ་མཛེས་ཤིང་ཡིད་དུ་འོང་བ་རི་དང་ནགས་ཚལ། མེ་ཏོག་སོགས་ཐམས་ཅད་ཡིད་ཀྱིས་བླངས་ཏེ་མཆོད་པ་འབུལ་ཚུལ་བསྟན་ཡོད། འདིའི་དམིགས་ཡུལ་ནི་རང་ཉིད་དབུལ་ཡང་བསོད་ནམས་རྒྱ་ཆེན་གསོག་པའི་ཐབས་ལམ་ཞིག་སྟོན་རྒྱུ་དེ་ཡིན།",
                "key_concepts": [
                  "རང་གི་ལོངས་སྤྱོད།",
                  "བདག་པོ་མེད་པའི་དངོས་པོ།",
                  "དག་པ་གསུམ།",
                  "ཡིད་ཀྱིས་འབུལ་བ།"
                ],
                "transformative_goal": "དངོས་པོ་ལ་ཆགས་ཞེན་གྱི་བསམ་པ་བཅོམ་ནས། རང་གི་མཐོང་ཐོས་དྲན་གསུམ་དུ་གྱུར་པའི་དངོས་པོ་ཐམས་ཅད་བསོད་ནམས་གསོག་པའི་རྒྱུར་བསྒྱུར་བའི་བློ་སྦྱོང་བྱ་རྒྱུ།",
                "function_in_hierarchy": "མཆོད་པའི་རིམ་པའི་ནང་གི་གཞི་རྩའི་དང་ཐོག་མའི་མཆོད་པ་འབུལ་ཚུལ་སྟོན། འདིས་དངོས་པོའི་ཐོག་ནས་ཉམས་ལེན་བྱེད་པའི་སྒོ་འབྱེད་པ་དང་། དེ་ནས་རིམ་བཞིན་ལུས་དང་ཡིད་ཀྱི་མཆོད་པ་ལ་འཇུག་པའི་རྨང་གཞི་འདིང་།",
                "inter_node_relationships": [
                  {
                    "related_node_id": "2.1.2",
                    "relationship_type": "གོང་འཕེལ་དུ་གཏོང་བ།",
                    "conceptual_bridge": "ཕྱི་དངོས་པོའི་མཆོད་པ་ནས་ནང་ལུས་ཀྱི་མཆོད་པ་ལ་འཕོས་པས། མཆོད་པའི་གཏིང་ཟབ་ཚད་དང་རང་ཉིད་དང་ཐག་ཉེ་བའི་ཚད་ཇེ་ཆེར་འགྲོ།"
                  }
                ],
                "implicit_concepts": [
                  "བསམ་པའི་སྟོབས་ཤུགས།",
                  "དངོས་པོའི་བདག་དབང་གི་འདུ་ཤེས།"
                ],
                "pedagogical_strategy": "དངོས་ཡོད་ནས་དམིགས་ཡོད་བར་རིམ་བགྲོད་ཀྱི་ཐབས་ལམ་སྤྱད། དང་པོ་རང་ལ་ཡོད་པ་འབུལ་བ་དང་། དེ་ནས་རང་ལ་མེད་ཀྱང་ཡིད་ཀྱིས་དམིགས་ནས་འབུལ་བའི་ཐབས་བསྟན་པས། ཉམས་ལེན་གྱི་ཁྱབ་རྒྱ་ཆེ་རུ་བཏང་།",
                "intended_impact_on_reader": "རང་ཉིད་དངོས་པོའི་ཐོག་ནས་དབུལ་ཡང་བསོད་ནམས་གསོག་པའི་གོ་སྐབས་མེད་པ་མིན་པར་གོ་བ་བསྐྱེད་དེ། ནམ་ཡང་དགེ་སྦྱོར་ལ་འཇུག་པའི་སྤོབས་པ་སྦྱིན་རྒྱུ།",
                "audience_assumptions": "ཀློག་པ་པོ་ལ་མཆོད་པ་འབུལ་འདོད་ཡོད་ཀྱང་དངོས་པོས་མ་འདང་བའི་དཀའ་ངལ་ཡོད་སྲིད་པར་དམིགས་ནས་བསྟན་པ་ཞིག་ཡིན།"
              },
              "children": [
                {
                  "level": "subsubsection",
                  "number": "2.1.1.1",
                  "title": "The offering of one’s possessions",
                  "verses_span": "1-1",
                  "summary": {
                    "content_summary": "ས་བཅད་འདིས་བྱང་ཆུབ་ཀྱི་སེམས་སྐྱེ་བའི་རྒྱུ་སྟེ་བསོད་ནམས་བསགས་པའི་ཆེད་དུ། རང་གི་ལོངས་སྤྱོད་དང་མཁོ་ཆས་རྣམས་དཀོན་མཆོག་གསུམ་ལ་འབུལ་དགོས་པར་སྟོན། མཆོད་པ་འབུལ་སྐབས་དག་པ་གསུམ་སྟེ་བསམ་པ་དག་པ། ཡུལ་དག་པ། དངོས་པོ་དག་པ་བཅས་ཚང་དགོས་པར་བཤད། ལྷག་པར་དུ་ཇོ་བོ་རྗེ་ཨ་ཏི་ཤའི་ལོ་རྒྱུས་དྲངས་ནས་མཆོད་པ་གལ་ཆེ་ཚུལ་དང་དེས་སེམས་རྒྱུད་དྭངས་གསལ་བཟོ་བའི་ནུས་པ་གསལ་བཤད་བྱེད།",
                    "key_concepts": [
                      "བསོད་ནམས་ཀྱི་ཚོགས།",
                      "དག་པ་གསུམ།",
                      "མཆོད་པ།",
                      "བྱང་ཆུབ་ཀྱི་སེམས།",
                      "སེར་སྣ།"
                    ],
                    "transformative_goal": "སེར་སྣའི་བསམ་པ་སྤངས་ཏེ་གཏོང་ཕོད་ཀྱི་བསམ་པ་བསྐྱེད་པ་དང་། བንས आध्यात्मिक ཐོབ་པ་ནི་བསོད་ནམས་ཀྱི་ཚོགས་གསོག་པའི་རྨང་གཞིའི་ཉམས་ལེན་ལ་རག་ལས་པའི་གོ་རྟོགས་བསྐྱེད་རྒྱུ།",
                    "function_in_hierarchy": "འདིས་ཚོགས་གསོག་པའི་ཐབས་ལམ་ཐོག་མ་དང་ལག་ལེན་བྱེད་བདེ་ཤོས་ཏེ་དངོས་པོའི་མཆོད་པ་ངོ་སྤྲོད་བྱེད། དེ་ནི་རྗེས་སུ་འབྱུང་བའི་སྡིག་བཤགས་དང་མཉམ་དུ་བྱང་སེམས་བསྐྱེད་པའི་སྔོན་འགྲོའི་ཉམས་ལེན་གྱི་ཆ་ཤས་གཙོ་བོ་ཞིག་ཡིན། འདིས་ཉམས་ལེན་དེ་དག་དངོས་པོའི་བྱ་བ་དང་འབྲེལ་ནས་གཞི་ཚུགས་པར་བྱེད།",
                    "inter_node_relationships": [
                      {
                        "related_node_id": "2.1.1.2",
                        "relationship_type": "གོང་འཕེལ་དུ་གཏོང་བ།",
                        "conceptual_bridge": "དངོས་པོའི་མཆོད་པ་ནས་ཡིད་ཀྱིས་སྤྲུལ་པའི་མཆོད་པར་རྒྱ་བསྐྱེད་དེ། བསོད་ནམས་གསོག་པའི་ནུས་པ་དེ་བས་ཀྱང་ཆེ་རུ་གཏོང་།"
                      }
                    ],
                    "implicit_concepts": [
                      "ཉམས་ལེན་ནི་སེམས་ཀྱི་བྱ་བ་རྐྱང་པ་མིན་པར། དངོས་པོའི་བྱ་བ་དང་འབྱོར་བ་ལའང་རག་ལས།",
                      "བྱ་བ་རང་གི་ངོ་བོ་ལས་དེའི་རྒྱབ་ཀྱི་བསམ་པ་དང་ཀུན་སློང་གལ་ཆེ་བ།"
                    ],
                    "pedagogical_strategy": "ཐད་ཀའི་བཀའ་སློབ་དང་། ལོ་རྒྱུས་ཀྱི་དཔེ་དྲངས། (ཇོ་བོ་རྗེའི་ལོ་རྒྱུས།) དེ་མིན་གཞི་རྩའི་སྒྲོམ་གཞི་ (དག་པ་གསུམ།) བཅས་སྤྱད་དེ་ཀུན་སློང་དང་ཐབས་ལམ་གསལ་བོ་གཉིས་ཀ་སྟོན།",
                    "intended_impact_on_reader": "ཀློག་པ་པོས་རང་གི་ལོངས་སྤྱོད་དེ་སྒེར་གྱི་དངོས་པོ་ཙམ་ལ་མི་བལྟ་བར། བསམ་པའི་ཡར་རྒྱས་ཀྱི་ལག་ཆ་རུ་མཐོང་བ་དང་། རྒྱུན་གྱི་མཆོད་པ་རྣམས་དྲན་ཤེས་དང་ཀུན་སློང་དག་པས་བསྒྲུབ་པར་སྐུལ་མ་བྱ་རྒྱུ།",
                    "audience_assumptions": "ཀློག་པ་པོ་ནི་བྱང་སེམས་བསྐྱེད་པའི་གཞི་རྩའི་རིམ་པ་ཤེས་འདོད་ཡོད་མཁན་ཞིག་ཡིན་པ་དང་། མཆོད་འབུལ་ལྟ་བུའི་སྔོན་འགྲོའི་ཉམས་ལེན་གྱི་གལ་ཆེའི་རང་བཞིན་ལ་གོ་སྐོན་སློབ་གསོ་དགོས་པར་ཆ་འཇོག་བྱེད།"
                  }
                },
                {
                  "level": "subsubsection",
                  "number": "2.1.1.2",
                  "title": "The offering of things unowned",
                  "verses_span": "2-7",
                  "summary": {
                    "content_summary": "ས་བཅད་འདིས་བདག་པོ་མེད་པའི་དངོས་པོ་རྣམས་ཡིད་ཀྱིས་དམིགས་ཏེ་མཆོད་པ་འབུལ་ཚུལ་རྒྱས་པར་བཤད། འདིར་སངས་རྒྱས་ཀྱི་ཞིང་ཁམས་དང་ལྷ་མིའི་འཇིག་རྟེན་ན་ཡོད་པའི་མེ་ཏོག འབྲས་བུ། རིན་པོ་ཆེན། རི་བོ། ནགས་ཚལ་སོགས་མཛེས་ཤིང་ཡིད་དུ་འོང་བ་ཐམས་ཅད་ཡིད་ཀྱིས་བླངས་ནས་དཀོན་མཆོག་ལ་འབུལ་དགོས་པར་གདམས། མཆོད་པ་འདི་ལ་ཁྱད་ཆོས་བཞི་ཡོད་དེ། གྲངས་ཀྱིས་མི་ལང་བ། སྡིག་པས་མ་གོས་པ། བློས་བླངས་ཏེ་འབུལ་བ། ཡུལ་སངས་རྒྱས་སྲས་བཅས་ཡིན་པ་བཅས་སོ། འདི་ནི་རང་ཉིད་བསོད་ནམས་ཀྱིས་དབུལ་ཡང་ནོར་གཞན་མེད་པའི་སྐྱབས་བཅོལ་ས་ལྟ་བུ་ཡིན།",
                    "key_concepts": [
                      "བདག་ཏུ་མ་བཟུང་བའི་མཆོད་པ།",
                      "ཡིད་ཀྱིས་དམིགས་པ།",
                      "ཁྱད་ཆོས་བཞི།",
                      "ཡོན་གནས་དམ་པ།"
                    ],
                    "transformative_goal": "རང་ཉིད་ཀྱི་དངོས་པོའི་འབྱོར་བ་ལ་མ་ལྟོས་པར། བསམ་བློའི་ནུས་ཤུགས་ལ་བརྟེན་ནས་བསོད་ནམས་ཚད་མེད་པ་གསོག་ཐུབ་པའི་གདེང་ཚོད་དང་སྤོབས་པ་བསྐྱེད་རྒྱུ།",
                    "function_in_hierarchy": "དངོས་པོའི་མཆོད་པ་ནས་མཆོད་པའི་རྣམ་གྲངས་གཞན་དག་ལ་བሸጋገሪያའཕྲོའི་ཟམ་པ་ལྟ་བུ་ཡིན། དེས་དངོས་པོས་དབུལ་བའི་གང་ཟག་རྣམས་ལའང་བསོད་ནམས་གསོག་པའི་ཐབས་ལམ་ཡངས་པོ་ཞིག་སྒོ་འབྱེད་བྱེད།",
                    "inter_node_relationships": [
                      {
                        "related_node_id": "2.1.1.1",
                        "relationship_type": "རྒྱ་བསྐྱེད་པ།",
                        "conceptual_bridge": "རང་ལ་དབང་བའི་དངོས་པོ་འབུལ་བའི་བསམ་བློ་དེ་བདག་པོ་མེད་པའི་འཇིག་རྟེན་གྱི་དངོས་པོ་ཐམས་ཅད་འབུལ་བའི་བར་རྒྱ་བསྐྱེད་དེ། གཏོང་ཕོད་ཀྱི་བློ་དེ་ཚད་མེད་པར་བསྒྱུར།"
                      },
                      {
                        "related_node_id": "2.1.2",
                        "relationship_type": "སྔོན་འགྲོ།",
                        "conceptual_bridge": "ཕྱི་དངོས་པོ་ཐམས་ཅད་ཕུལ་ཚར་རྗེས། དེ་ལས་ཀྱང་གཅེས་པའི་རང་ལུས་འབུལ་བའི་བསམ་བློ་ལ་འཇུག་པའི་རྨང་གཞི་འདིང་།"
                      }
                    ],
                    "implicit_concepts": [
                      "སྣང་བ་ཐམས་ཅད་ཉམས་ལེན་གྱི་རྒྱུར་བསྒྱུར་ཐུབ་པ།",
                      "བསམ་པའི་ནུས་པ་དངོས་པོའི་ནུས་པ་ལས་མི་དམན་པ།"
                    ],
                    "pedagogical_strategy": "སྙན་ངག་གི་བརྗོད་བྱ་དང་འཆར་ཡན་གྱིས་ཕྱུག་པའི་སྒོ་ནས་འཇིག་རྟེན་གྱི་མཛེས་སྡུག་རྣམས་བགྲངས་ཏེ་དད་པ་དང་སྤྲོ་བ་བསྐྱེད། དེ་ནས་རྒྱལ་པོ་སྐྱེ་བསོད་དང་མྱ་ངན་མེད་ཀྱི་ལོ་རྒྱུས་དྲངས་ནས་མཆོད་པ་ཆུང་ངུས་ཀྱང་འབྲས་བུ་ཆེན་པོ་འབྱིན་པའི་རྒྱུ་མཚན་བཀོད།",
                    "intended_impact_on_reader": "རང་ཉིད་མཐོང་ཐོས་དྲན་གསུ姆དུ་གྱུར་པའི་དངོས་པོ་མཛེས་པོ་ཐམས་ཅད་ལ་ཆགས་ཞེན་གྱི་ཚབ་ཏུ་མཆོད་པའི་བསམ་པ་བསྐྱེད་པའི་ទម្លាប់ཅིག་འཇགས་རྒྱུ།",
                    "audience_assumptions": "ཀློག་པ་པོ་ནི་རང་ཉིད་དབུལ་བས་མཆོད་པ་རྒྱ་ཆེན་འབུལ་མི་ཐུབ་སྙམ་པའི་ཞུམ་པ་ཡོད་སྲིད་པས། དེ་ལ་བསམ་བློའི་མཆོད་པ་ནི་དེ་ལས་ཀྱང་རྒྱ་ཆེ་བའི་གདམས་ངག་སྟོན་པར་དམིགས།"
                  }
                }
              ]
            },
            {
              "level": "subsection",
              "number": "2.1.2",
              "title": "The offering of one’s body",
              "verses_span": "8-9",
              "summary": {
                "content_summary": "ས་བཅད་འདིས་མཆོད་པའི་ནང་ནས་རང་གི་ལུས་འབུལ་བ་ནི་མཆོག་ཏུ་གྱུར་པ་ཡིན་པར་སྟོན། ཉམས་ལེན་པས་རང་གི་ལུས་འདི་རྒྱལ་བ་སྲས་དང་བཅས་པ་རྣམས་ལ་གཏན་དུ་ཕུལ་ཏེ། དེ་དག་གི་བྲན་དུ་གྱུར་ནས་ཁོང་རྣམས་དགྱེས་པའི་བྱ་བ་སྟེ་སེམས་ཅན་གྱི་དོན་སྒྲུབ་པར་ཁས་ལེན། ལུས་ཕུལ་བ་འདིས་རང་ཉིད་སྲིད་པའི་འཇིགས་པ་ལས་སྐྱོབ་པ་དང་། སྔོན་གྱི་སྡིག་པ་དག་ཅིང་ཕྱིན་ཆད་སྡིག་པ་མི་བྱེད་པའི་དམ་བཅའ་འང་འགྲུབ།",
                "key_concepts": [
                  "ལུས་འབུལ་བ།",
                  "བྲན་དུ་ཁས་ལེན་པ།",
                  "སེམས་ཅན་གྱི་དོན།",
                  "སྡིག་པ་སྤོང་བ།"
                ],
                "transformative_goal": "རང་ལུས་ལ་འཛིན་པའི་བདག་འཛིན་གྱི་བསམ་པ་རྩད་ནས་སྤངས་ཏེ། ལུས་འདི་གཞན་དོན་འབའ་ཞིག་གི་ཆེད་དུ་བཀོལ་སྤྱོད་བྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་སློབ་རྒྱུ།",
                "function_in_hierarchy": "ཕྱི་དངོས་པོའི་མཆོད་པ་ནས་ནང་གི་མཆོད་པ་སྟེ་རང་ལུས་ཀྱི་མཆོད་པ་ལ་འཕོས་པས། མཆོད་པའི་གཏིང་ཟབ་ཚད་ཇེ་ཆེར་བཏང་ཡོད། འདི་ནི་བདག་གཞན་མཉམ་བརྗེ་དང་བདག་པས་གཞན་གཅེས་ཀྱི་ཉམས་ལེན་གྱི་སྔོན་འགྲོ་ལྟ་བུ་ཡིན།",
                "inter_node_relationships": [
                  {
                    "related_node_id": "2.1.1",
                    "relationship_type": "གཏིང་ཟབ་ཏུ་གཏོང་བ།",
                    "conceptual_bridge": "ཕྱི་དངོས་པོ་འབུལ་བ་ལས་ཀྱང་རྩ་ཆེ་བ་ནི་ནང་རང་གི་ལུས་འབུལ་བ་ཡིན་པས། གཏོང་ཕོད་ཀྱི་ཉམས་ལེན་དེ་རྩེ་མོར་སོན་པར་བྱེད།"
                  },
                  {
                    "related_node_id": "2.1.3",
                    "relationship_type": "སྔོན་འགྲོ།",
                    "conceptual_bridge": "ལུས་ཕུལ་ཚར་བའི་རྨང་གཞིའི་སྟེང་། ལུས་ཀྱི་དབང་པོ་དང་འབྲེལ་བའི་སེམས་ཀྱི་ནུས་པས་མཆོད་པ་དེ་བས་ཀྱང་རྒྱ་ཆེན་པོ་སྤྲུལ་ནས་འབུལ་བའི་བསམ་བློ་ལ་འཇུག"
                  }
                ],
                "implicit_concepts": [
                  "བདག་འཛིན་སྤོང་བ།",
                  "དམ་བཅའི་ནུས་པ།",
                  "བྱ་བ་དང་བསམ་པའི་གཅིག་གྱུར།"
                ],
                "pedagogical_strategy": "ཐད་ཀའི་ཁས་ལེན་དང་དམ་བཅའི་ཚིག་གི་སྒོ་ནས་གདམས། དེས་ལུས་འབུལ་བ་ནི་ཚིག་ཙམ་མ་ཡིན་པར། རང་གི་བྱ་སྤྱོད་དང་སེམས་ཁམས་ཡོངས་རྫོགས་འགྱུར་བ་གཏོང་བའི་བྱ་ཐབས་ཤིག་ཡིན་པར་ནན་བཤད་བྱེད།",
                "intended_impact_on_reader": "རང་གི་ལུས་འདི་ང་དང་ངའི་ཡིན་སྙམ་པའི་བདག་འཛིན་གྱི་འཆིང་རྒྱ་ལས་གྲོལ་ཏེ། རྒྱལ་བ་སྲས་བཅས་ཀྱི་སྤྱན་སྔར་ལུས་འདི་གཞན་དོན་དུ་བཀོལ་བའི་སྤོབས་པ་དང་ཆོད་སེམས་བསྐྱེད་རྒྱུ།",
                "audience_assumptions": "ཀློག་པ་པོས་ཕྱི་དངོས་པོའི་མཆོད་པའི་གོ་དོན་རྟོགས་ཟིན་པས། ད་ནི་དེ་ལས་གཏིང་ཟབ་པའི་ཉམས་ལེན་ལ་འཇུག་པར་གྲ་སྒྲིག་ཡོད་པར་ཆ་འཇོག་བྱེད།"
              }
            },
            {
              "level": "subsection",
              "number": "2.1.3",
              "title": "Offerings manifested by the power of the mind",
              "verses_span": "10-19",
              "summary": {
                "content_summary": "ས་བཅད་འདིས་ཡིད་ཀྱི་ནུས་པས་སྤྲུལ་པའི་མཆོད་པ་རྒྱ་ཆེན་པོ་འབུལ་ཚུལ་རྒྱས་པར་བཤད། འདིའི་ནང་དུ་རྒྱ་གར་གྱི་སྲོལ་རྒྱུན་ལྟར་གྱི་སྐུ་ཁྲུས་གསོལ་བའི་མཆོད་པ་དང་། ན་བཟའ་དང་རྒྱན་ཆ་འབུལ་བའི་མཆོད་པ། དེ་བཞིན་དྲི་དང་མེ་ཏོག བདུག་སྤོས། ཞལ་ཟས། སྒྲོན་མེ། གཞལ་མེད་ཁང་སོགས་ཡིད་དུ་འོང་བའི་དངོས་པོ་སྣ་ཚོགས་བློས་བླངས་ཏེ་འབུལ་བའི་རིམ་པ་ཞིབ་ཚགས་པོར་བཀོད་ཡོད། མཆོད་པ་རེ་རེ་འབུལ་སྐབས་དེས་རང་གཞན་གྱི་རྒྱུད་ལ་ཡོན་ཏན་ཁྱད་པར་ཅན་སྐྱེ་བའི་སྨོན་ལམ་འདེབས་དགོས་པར་ཡང་བསྟན།",
                "key_concepts": [
                  "ཡིད་ཀྱིས་སྤྲུལ་པའི་མཆོད་པ།",
                  "སྐུ་ཁྲུས་གསོལ་བ།",
                  "ན་བཟའ་དང་རྒྱན་ཆ།",
                  "འདོད་ཡོན་ལྔའི་མཆོད་པ།",
                  "སྨོན་ལམ་དང་འབྲེལ་བའི་མཆོད་པ།"
                ],
                "transformative_goal": "དངོས་པོའི་དབུལ་ཕྱུག་ལ་མ་ལྟོས་པར། བསམ་བློའི་ནུས་པ་ལ་བརྟེན་ནས་བསོད་ནམས་ཀྱི་ཚོགས་ཚད་མེད་པ་བསགས་ཐུབ་པའི་གདེང་ཚོད་བསྐྱེད་པ་དང་། སྣང་སྲིད་ཐམས་ཅད་མཆོད་པའི་རང་བཞིན་དུ་བལྟ་བའི་ལྟ་བ་སྦྱོང་རྒྱུ།",
                "function_in_hierarchy": "འདིས་མཆོད་པའི་རིམ་པ་རྣམས་ཀྱི་ནང་ནས་རྒྱ་ཆེ་ཤོས་དང་ཞིབ་ཚགས་ཤོས་ཀྱི་ས་བཅད་གྲུབ་ཡོད། འདིས་བྱང་སེམས་པའི་ཐབས་མཁས་ཀྱི་སྤྱོད་པ་སྟེ། དཀའ་ཚེགས་མེད་པར་ཚོགས་རྒྱ་ཆེན་གསོག་པའི་ཐབས་མཆོག་སྟོན།",
                "inter_node_relationships": [
                  {
                    "related_node_id": "2.1.2",
                    "relationship_type": "གོང་འཕེལ་དུ་གཏོང་བ།",
                    "conceptual_bridge": "རང་ལུས་ཕུལ་བའི་རྨང་གཞིའི་སྟེང་། ད་ནི་ལུས་ངག་ཡིད་གསུམ་གྱི་ནང་ནས་ཡིད་ཀྱི་ནུས་པ་བེད་སྤྱོད་དེ་བསམ་གྱིས་མི་ཁྱབ་པའི་མཆོད་སྤྲིན་སྤྲོ་བར་བྱེད།"
                  },
                  {
                    "related_node_id": "2.1.4",
                    "relationship_type": "རྨང་གཞི་འདིང་བ།",
                    "conceptual_bridge": "ཡིད་ཀྱིས་དངོས་སུ་སྤྲུལ་ནས་ཕུལ་རྗེས། ད་དུང་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་མཆོད་པ་རྒྱུན་མི་ཆད་པར་འབྱུང་བར་སྨོན་པའི་བསམ་བློ་ལ་འཇུག"
                  }
                ],
                "implicit_concepts": [
                  "བསམ་པའི་ནུས་པའི་གལ་ཆེའི་རང་བཞིན།",
                  "མཆོད་པའི་མཚོན་དོན་དང་ནང་དོན།",
                  "དག་པའི་སྣང་བ།"
                ],
                "pedagogical_strategy": "སིદ્ધਾਂཏ་དང་འཆར་ཡན་ཟུང་འབྲེལ་གྱི་སྒོ་ནས་སློབ་ཁྲིད་བྱེད། རྒྱ་གར་གྱི་སྲོལ་རྒྱུན་གྱི་ཆོ་གའི་རྣམ་པ་གཞིར་བཟུང་སྟེ། དེ་དག་གི་ཐོག་ཏུ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་སྤྲོས་ཏེ་བསམ་བློའི་ནུས་པ་ལ་བརྟེན་ནས་མཆོད་པ་འབུལ་བར་སྐུལ།",
                "intended_impact_on_reader": "ཉམས་ལེན་པ་རྣམས་ལ་ཡིད་ཀྱིས་སྤྲུལ་པའི་མཆོད་པ་ནི་དངོས་པོའི་མཆོད་པ་ལས་དམན་པ་མིན་པར་དེ་ལས་ཀྱང་རྒྱ་ཆེ་ཞིང་དག་པ་ཡིན་པའི་ངེས་ཤེས་བསྐྱེད་དེ། ནམ་ཡང་བསོད་ནམས་གསོག་པའི་བྱ་བ་ལ་འབད་པར་བྱ་རྒྱུ།",
                "audience_assumptions": "ཀློག་པ་པོས་མཆོད་པའི་རིམ་པ་སྤྱིར་བཏང་བ་ཤེས་ཀྱང་། ཡིད་ཀྱིས་སྤྲུལ་པའི་མཆོད་པའི་རྒྱ་ཆེ་བ་དང་གཏིང་ཟབ་པའི་རང་བཞིན་ལ་གོ་བ་ཆ་ཚང་མེད་པར་ཆ་འཇོག་བྱེད།"
              },
              "children": [
                {
                  "level": "subsubsection",
                  "number": "2.1.3.1",
                  "title": "The offering of a ceremonial bath",
                  "verses_span": "10-13",
                  "summary": {
                    "content_summary": "ས་བཅད་འདིས་ཡིད་ཀྱིས་སྤྲུལ་པའི་མཆོད་པའི་ནང་ཚན་དང་པོ། རྒྱ་གར་གྱི་སྲོལ་རྒྱུན་ལྟར་གྱི་སྐུ་ཁྲུས་གསོལ་བའི་ཆོ་ག་རྒྱས་པར་སྟོན། འདིར་དྲི་ཞིམ་པའི་ཁྲུས་ཁང་། རིན་པོ་ཆེའི་ཀ་བ། མུ་ཏིག་གི་བླ་རེ་སོགས་བསམ་གྱིས་མི་ཁྱབ་པའི་ཁྲུས་ཁང་ཞིག་ཡིད་ཀྱིས་དམིགས་ཏེ། དེའི་ནང་དུ་རྒྱལ་བ་སྲས་བཅས་ལ་རིན་པོ་ཆེའི་བུམ་པའི་ཆུ་དྲི་ཞིམ་པོས་སྐུ་ཁྲུས་གསོལ་བ་དང་། དེ་ནས་གོས་དྲི་ཞིམ་པོས་སྐུ་ཕྱི། མཐར་ན་བཟའ་དང་རྒྱན་ཆ་སྣ་ཚོགས་འབུལ་བའི་རིམ་པ་ཞིབ་པར་བཀོད་ཡོད། མཆོད་པ་འདིས་རང་གཞན་གྱི་ལུས་ངག་ཡིད་གསུམ་གྱི་དྲི་མ་དག་པར་བྱེད་པའི་མཚོན་དོན་ཡོད།",
                    "key_concepts": [
                      "སྐུ་ཁྲུས་གསོལ་བ།",
                      "ཡིད་ཀྱིས་སྤྲུལ་པའི་ཁྲུས་ཁང་།",
                      "ན་བཟའ་འབུལ་བ།",
                      "རྒྱན་ཆ་འབུལ་བ།",
                      "སྒྲིབ་པ་དག་པ།"
                    ],
                    "transformative_goal": "རང་གཞན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ངག་ཡིད་གསུམ་གྱི་སྒྲིབ་པ་དང་དྲི་མ་རྣམས་དག་ནས། སངས་རྒྱས་ཀྱི་སྐུ་གསུང་ཐུགས་ཀྱི་ཡོན་ཏན་མངོན་དུ་འགྱུར་བའི་རྟེན་འབྲེལ་བསྐྲུན་རྒྱུ།",
                    "function_in_hierarchy": "ཡིད་ཀྱིས་སྤྲུལ་པའི་མཆོད་པའི་དབུ་བརྩམས་ཏེ། དང་ཐོག་དག་བྱེད་ཀྱི་མཆོད་པ་སྟེ་སྐུ་ཁྲུས་ཀྱི་མཆོད་པ་བསྟན་པས། རྗེས་ཀྱི་མཆོད་པ་རྣམས་དང་ལེན་བྱེད་པའི་སྣོད་གཙང་མ་ཞིག་བསྐྲུན་པའི་མཚོན་དོན་ཡོད།",
                    "inter_node_relationships": [
                      {
                        "related_node_id": "2.1.3.2",
                        "relationship_type": "སྔོན་འགྲོ།",
                        "conceptual_bridge": "སྐུ་ཁྲུས་གསོལ་ནས་ཡུལ་དག་པར་བྱས་རྗེས། དེའི་སྟེང་དུ་དྲི་བཟང་དང་མེ་ཏོག་སོགས་ཡིད་དུ་འོང་བའི་མཆོད་པ་སྣ་ཚོགས་འབུལ་བའི་རིམ་པ་ལ་འཇུག"
                      }
                    ],
                    "implicit_concepts": [
                      "ཕྱི་རོལ་གྱི་ཆོ་གས་ནང་སེམས་ཀྱི་དག་ཐེར་མཚོན་པ།",
                      "ཆོས་དང་སྲོལ་རྒྱུན་རིག་གནས་ཀྱི་འབྲེལ་བ།"
                    ],
                    "pedagogical_strategy": "ཞིབ་འབྲི་དང་འཆར་ཡན་གྱིས་ཕྱུག་པའི་སྒོ་ནས་བསམ་བློའི་ནང་མཆོད་པའི་ཡུལ་ཞིབ་ཚགས་པོ་ཞིག་བསྐྲུན་དུ་བཅུག དེ་ནས་མཆོད་པ་འབུལ་བའི་རིམ་པ་རེ་རེ་བཞིན་བསྟན་ནས་ཉམས་ལེན་གྱི་གོ་རིམ་གསལ་བོ་སྟོན།",
                    "intended_impact_on_reader": "ཉམས་ལེན་པའི་བསམ་བློའི་ནང་དུ་མཆོད་པའི་ཡུལ་དང་མཆོད་རྫས་རྣམས་གསལ་ལྷང་ངེར་འཆར་དུ་བཅུག་སྟེ། དད་གུས་དང་སྤྲོ་བ་ཆེན་པོའི་ངང་ནས་ཡིད་ཀྱི་མཆོད་པ་ལ་འཇུག་པར་བྱ་རྒྱུ།",
                    "audience_assumptions": "ཀློག་པ་པོ་ལ་ཆོ་གའི་གོ་རིམ་དང་མཚོན་དོན་ལ་དོ་སྣང་ཡོད་པ་དང་། ཞིབ་ཚགས་པའི་ལམ་སྟོན་ལ་བརྟེན་ནས་ཉམས་ལེན་བྱེད་འདོད་ཡོད་པར་ཆ་འཇོག་བྱེད།"
                  }
                },
                {
                  "level": "subsubsection",
                  "number": "2.1.3.2",
                  "title": "Offerings of pleasant substances",
                  "verses_span": "14-19",
                  "summary": {
                    "content_summary": "ས་བཅད་འདིས་སྐུ་ཁྲུས་ཕུལ་རྗེས་ཀྱི་མཆོད་པའི་རིམ་པ་རྣམས་སྟོན། དེ་ཡང་སྐུ་ལ་དྲི་བཟང་བྱུག་པ། མེ་ཏོག་མཛེས་པོ་དང་ཕྲེང་བ་འབུལ་བ། བདུག་སྤོས་ཀྱི་སྤྲིན་འབུལ་བ། ཞལ་ཟས་དང་སྐོམ་བཅས་པའི་ལྷ་བཤོས་འབུལ་བ། རིན་པོ་ཆེའི་སྒྲོན་མེ་འབུལ་བ། དྲི་བསུང་གིས་བྱུགས་པའི་ས་གཞིར་མེ་ཏོག་འགྲེམ་པ། མཐར་བསྟོད་དབྱངས་དང་རོལ་མོས་བརྒྱན་པའི་གཞལ་མེད་ཁང་དང་གདུགས་མཛེས་པོ་སོགས་འབུལ་ཚུལ་རྒྱས་པར་བཤད། མཆོད་པ་རེ་རེའི་མཐར་རང་གཞན་གྱི་དོན་དུ་སྨོན་ལམ་འདེབས་དགོས་པར་ཡང་གདམས།",
                    "key_concepts": [
                      "བྱུག་པ།",
                      "མེ་ཏོག",
                      "བདུག་སྤོས།",
                      "ཞལ་ཟས།",
                      "སྒྲོན་མེ།",
                      "གཞལ་མེད་ཁང་།",
                      "གདུགས།"
                    ],
                    "transformative_goal": "རང་གི་དབང་པོ་ལྔས་སྤྱོད་ཡུལ་དུ་གྱུར་པའི་བདེ་བ་ཐམས་ཅད་ཆགས་ཞེན་གྱི་རྒྱུ་རུ་མི་བྱེད་པར། དཀོན་མཆོག་ལ་མཆོད་པ་འབུལ་བའི་རྒྱུ་རུ་བསྒྱུར་ཏེ་དག་པའི་སྣང་བ་སྦྱོང་རྒྱུ།",
                    "function_in_hierarchy": "ཡིད་ཀྱིས་སྤྲུལ་པའི་མཆོད་པའི་ལྟེ་བ་གྲུབ་ཡོད། འདིས་དབང་པོ་ལྔའི་ཡུལ་གྱི་མཆོད་པ་སྣ་ཚོགས་བསྡུས་ནས། བསོད་ནམས་གསོག་པའི་ཐབས་ལམ་རྒྱ་ཆེ་ཤོས་དང་འཆར་ཡན་གྱིས་ཕྱུག་ཤོས་དེ་སྟོན།",
                    "inter_node_relationships": [
                      {
                        "related_node_id": "2.1.3.1",
                        "relationship_type": "རྒྱུན་འཛིན་པ།",
                        "conceptual_bridge": "སྐུ་ཁྲུས་ཀྱིས་དག་པར་བྱས་པའི་ཡུལ་དེའི་སྟེང་དུ། འདོད་ཡོན་གྱི་མཆོད་པ་རྣམས་རིམ་བཞིན་ཕུལ་ནས་མཆོད་པའི་ཆོ་ག་ཡོངས་སུ་རྫོགས་པར་བྱེད།"
                      },
                      {
                        "related_node_id": "2.1.4",
                        "relationship_type": "རྨང་གཞི་འདིང་བ།",
                        "conceptual_bridge": "དངོས་སུ་ཡིད་ཀྱིས་མཆོད་པ་འདི་དག་ཕུལ་ཚར་རྗེས། ད་དུང་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་མཆོད་པ་འདི་དག་རྒྱུན་མི་ཆད་པར་འབྱུང་བར་སྨོན་པའི་བསམ་བློ་ལ་འཇུག"
                      }
                    ],
                    "implicit_concepts": [
                      "སྣང་བ་མཆོད་པའི་རང་བཞིན།",
                      "ཡིད་ཀྱི་ནུས་པའི་ཚད་མེད་པའི་རང་བཞིན།",
                      "བྱ་བ་རེ་རེ་དང་འབྲེལ་བའི་ནང་གི་ཡོན་ཏན་བསྐྱེད་ཚུལ།"
                    ],
                    "pedagogical_strategy": "དབང་པོ་རེ་རེའི་ཡུལ་དང་འབྲེལ་བའི་མཆོད་པ་རིམ་པ་བཞིན་བགྲངས་ཏེ། སྙན་ངག་གི་ཚིག་རྒྱན་དང་དཔེ་མཚོན་གྱིས་ཕྱུག་པའི་སྒོ་ནས་ཀློག་པ་པོའི་ཡིད་ལ་མཆོད་པའི་རྣམ་པ་གསལ་བོར་འཆར་དུ་འཇུག མཆོད་པ་རེ་རེའི་མཐར་སྨོན་ལམ་དང་སྦྱར་ནས་དེའི་དགོས་པ་དང་ནུས་པ་གསལ་སྟོན་བྱེད།",
                    "intended_impact_on_reader": "ཀློག་པ་པོའི་བསམ་བློའི་ནང་འཇིག་རྟེན་གྱི་བདེ་བ་དང་མཛེས་སྡུག་ཐམས་ཅད་ནི་དཀོན་མཆོག་ལ་མཆོད་པའི་ཡོ་བྱད་དུ་བལྟ་བའི་ལྟ་བ་ཞིག་འཇགས་པར་བྱས་ཏེ། ཉམས་ལེན་དང་འཚོ་བ་གཉིས་ཟུང་འབྲེལ་བྱེད་པའི་ཐབས་ཤིག་སྦྱིན་རྒྱུ།",
                    "audience_assumptions": "ཀློག་པ་པོ་ནི་བསམ་བློའི་ནང་དུ་ཞིབ་ཚགས་པའི་མཆོད་པའི་རྣམ་པ་བསྐྲུན་རྒྱུར་དགའ་མོས་ཡོད་མཁན་ཞིག་ཡིན་པར་ཆ་འཇོག་བྱེད།"
                  }
                }
              ]
            },
            {
              "level": "subsection",
              "number": "2.1.4",
              "title": "Offerings made through the power of aspiration",
              "verses_span": "20-21",
              "summary": {
                "content_summary": "ས་བཅད་འདིས་ཡིད་ཀྱིས་སྤྲུལ་པའི་མཆོད་པའི་རྗེས་སུ་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་མཆོད་པ་འབུལ་ཚུལ་སྟོན། དེ་ཡང་སེམས་ཅན་གྱི་སྡུག་བསྔལ་སེལ་བའི་རོལ་མོ་དང་དབྱངས་སྙན་གྱི་སྤྲིན་རྒྱུན་མི་ཆད་པར་གནས་པ་དང་། ཆོས་དཀོན་མཆོག་དང་མཆོད་རྟེན་སྐུ་གཟུགས་སོགས་ལ་རིན་ཆེན་དང་མེ་ཏོག་གི་ཆར་རྒྱུན་མི་ཆད་པར་འབབ་པར་ཤོག་ཅེས་སྨོན་ལམ་འདེབས་དགོས་པར་བཤད། འདི་ནི་དུས་དང་རྣམ་པ་ཀུན་ཏུ་མཆོད་པ་རྒྱུན་མི་ཆད་པར་བྱེད་པའི་ཐབས་ལམ་ཞིག་ཡིན།",
                "key_concepts": [
                  "སྨོན་ལམ་གྱི་སྟོབས།",
                  "རོལ་མོའི་མཆོད་པ།",
                  "རིན་ཆེན་གྱི་ཆར།",
                  "རྒྱུན་མི་ཆད་པའི་མཆོད་པ།"
                ],
                "transformative_goal": "རང་གི་བསམ་པའི་ནུས་པ་དེ་མིག་སྔའི་མཆོད་པ་ཙམ་ལ་མ་བཞག་པར། དུས་དང་ཕྱོགས་ཐམས་ཅད་དུ་མཆོད་པའི་རང་བཞིན་དུ་འགྱུར་བའི་སྨོན་ལམ་རྒྱ་ཆེན་འདེབས་པའི་བློ་སྦྱོང་བྱ་རྒྱུ།",
                "function_in_hierarchy": "ཡིད་ཀྱིས་སྤྲུལ་པའི་མཆོད་པ་ལས་བསམ་བློའི་ཁྱབ་རྒྱ་དེ་བས་ཆེ་བའི་སྨོན་ལམ་གྱི་མཆོད་པ་ལ་འཕོ་བའི་རིམ་པ་སྟོན། འདིས་མཆོད་པ་དེ་དུས་ཚོད་ངེས་ཅན་ཞིག་གི་བྱ་བ་མ་ཡིན་པར། རྒྱུན་གྱི་སེམས་ཁྱེར་ཞིག་ཏུ་བསྒྱུར་བར་བྱེད།",
                "inter_node_relationships": [
                  {
                    "related_node_id": "2.1.3",
                    "relationship_type": "རྒྱུན་བསྐྱངས་པ།",
                    "conceptual_bridge": "ཡིད་ཀྱིས་དངོས་སུ་སྤྲུལ་ནས་ཕུལ་བའི་མཆོད་པ་དེ་དག ད་ནི་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་དུས་གཏན་དུ་གནས་པར་ཤོག་ཅེས་བསྔོ་བ་དང་སྨོན་ལམ་གྱིས་མཇུག་བསྡུ།"
                  },
                  {
                    "related_node_id": "2.1.5",
                    "relationship_type": "རྨང་གཞི་འདིང་བ།",
                    "conceptual_bridge": "རང་གིས་མཆོད་པ་སྣ་ཚོགས་ཕུལ་བ་དེ་དག་གི་རྗེས་སུ། ད་ནི་འཕགས་པ་ཀུན་ཏུ་བཟང་པོ་སོགས་ཀྱི་བླ་ན་མེད་པའི་མཆོད་པ་ལྟར་བདག་གིས་ཀྱང་མཆོད་པར་ཤོག་ཅེས་པའི་བསམ་བློ་དེ་བས་ཀྱང་ཆེ་བ་ལ་འཇུག"
                  }
                ],
                "implicit_concepts": [
                  "བསྔོ་བ་དང་སྨོན་ལམ་གྱི་ནུས་པ།",
                  "དུས་ཀྱི་རྟག་པ་དང་མི་རྟག་པ།",
                  "ཆོས་དཀོན་མཆོག་གི་རིན་ཐང་།"
                ],
                "pedagogical_strategy": "སྨོན་ཚིག་གི་རྣམ་པའི་སྒོ་ནས་སློབ་ཁྲིད་བྱེད། \"ཤོག\" དང་ \"གྱུར་ཅིག\" ཅེས་པའི་ཚིག་གིས་ཉམས་ལེན་པའི་བསམ་བློ་དེ་རེ་བ་དང་སྨོན་འདུན་གྱི་ངང་དུ་བསྒྱུར་ཏེ་ནུས་པ་བསྐྱེད།",
                "intended_impact_on_reader": "མཆོད་འབུལ་གྱི་ལག་ལེན་དེ་མཇུག་རྫོགས་པ་མེད་པའི་བྱ་བ་ཞིག་ཏུ་མཐོང་ནས། རང་གི་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་དུས་དང་རྣམ་པ་ཀུན་ཏུ་དགེ་བའི་བྱ་བ་སྤེལ་འདོད་ཀྱི་བསམ་པ་བསྐྱེད་རྒྱུ།",
                "audience_assumptions": "ཀློག་པ་པོས་མཆོད་འབུལ་གྱི་རིམ་པ་མང་པོ་ཞིག་ཤེས་ཟིན་པས། ད་ནི་དེ་དག་རྒྱུན་བསྐྱངས་པའི་ཐབས་ལ་དོ་སྣང་ཡོད་པར་ཆ་འཇོག་བྱེད།"
              }
            },
            {
              "level": "subsection",
              "number": "2.1.5",
              "title": "The unsurpassable offering",
              "verses_span": "22-22",
              "summary": {
                "content_summary": "ས་བཅད་འདིས་མཆོད་པའི་ནང་ནས་མཆོག་ཏུ་གྱུར་པ་སྟེ་བླ་ན་མེད་པའི་མཆོད་པ་འབུལ་ཚུལ་སྟོན། འདི་ནི་རང་གིས་མཆོད་པ་འབུལ་བ་ཙམ་མ་ཡིན་པར། ས་བཅུའི་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དབྱངས་དང་ཀུན་ཏུ་བཟང་པོ་སོགས་ཀྱིས་ཇི་ལྟར་མཆོད་པ་ལྟར། བདག་གིས་ཀྱང་དེ་བཞིན་དུ་རྒྱལ་བ་སྲས་བཅས་ལ་མཆོད་པར་བགྱིའོ་ཞེས་ཁོང་རྣམས་ཀྱི་མཛད་པ་རྗེས་སུ་ཡི་རང་དང་དེ་ལྟར་བྱེད་པར་སྨོན་ལམ་འདེབས་པ་དེ་ཡིན། འདི་ནི་མཆོད་པའི་བསམ་བློ་རྩེ་མོར་སོན་པ་མཚོན་བྱེད་ཡིན།",
                "key_concepts": [
                  "བླ་ན་མེད་པའི་མཆོད་པ།",
                  "ཀུན་ཏུ་བཟང་པོའི་མཆོད་སྤྲིན།",
                  "བྱང་ཆུབ་སེམས་དཔའི་རྗེས་སུ་སློབ་པ།",
                  "རྗེས་སུ་ཡི་རང་།"
                ],
                "transformative_goal": "རང་གི་ཚད་བཀག་ཅན་གྱི་བསམ་བློ་ལས་བརྒལ་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བསམ་གྱིས་མི་ཁྱབ་པའི་མཆོད་པའི་སྤྱོད་པ་ལ་བློ་སྦྱོང་དང་སྨོན་པ་བྱས་ཏེ། རང་གི་ཉམས་ལེན་གྱི་དམིགས་ཚད་མཐོ་རུ་གཏོང་རྒྱུ།",
                "function_in_hierarchy": "མཆོད་པའི་རིམ་པ་ཡོངས་རྫོགས་ཀྱི་མཇུག་བསྡུ་བ་དང་དེ་དག་གི་རྩེ་མོར་གྱུར་པ་དེ་སྟོན། འདིས་རང་གི་མཆོད་པ་ལས་བརྒལ་ཏེ་འཕགས་པའི་སྤྱོད་པ་ལ་སྨོན་པས་མཆོད་པའི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད།",
                "inter_node_relationships": [
                  {
                    "related_node_id": "2.1.4",
                    "relationship_type": "རྩེ་མོར་སོན་པ།",
                    "conceptual_bridge": "སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་མཆོད་པ་རྒྱུན་མི་ཆད་པར་བྱས་པའི་སྟེང་དུ། ད་ནི་བྱང་སེམས་ཆེན་པོ་རྣམས་ཀྱི་མཆོད་པའི་རྗེས་སུ་སློབ་པས་མཆོད་པའི་བསམ་པ་མཐར་ཐུག་ལ་བསྐྱལ།"
                  },
                  {
                    "related_node_id": "2.1.6",
                    "relationship_type": "ཡན་ལག་ཏུ་གྱུར་པ།",
                    "conceptual_bridge": "བླ་མེད་མཆོད་པའི་བསམ་པ་བསྐྱེད་པའི་སེམས་དེས། ད་ནི་ངག་གི་སྒོ་ནས་དབྱངས་ཀྱིས་བསྟོད་པའི་མཆོད་པ་ལ་འཇུག"
                  }
                ],
                "implicit_concepts": [
                  "དད་པའི་སྟོབས།",
                  "བསམ་པའི་ཁྱད་པར།",
                  "ཉམས་ལེན་གྱི་དམིགས་ཡུལ་མཐར་ཐུག"
                ],
                "pedagogical_strategy": "དཔེ་ལྟ་བ་དང་རྗེས་སུ་སློབ་པའི་ཐབས་ལམ་སྤྱད། འཇམ་དབྱངས་དང་ཀུན་ཏུ་བཟང་པོ་དཔེར་བཀོད་དེ། ཉམས་ལེན་པའི་དམིགས་ཡུལ་དེ་གང་ཟག་རང་གི་ཚད་ལས་བརྒལ་ནས་འཕགས་པའི་གནས་སྐབས་ལ་བསྙབ་རྒྱུར་སྐུལ་མ་བྱེད།",
                "intended_impact_on_reader": "རང་གི་མཆོད་པ་དེ་ཆུང་ངུ་དང་ཚད་བཀག་ཅན་དུ་མི་བལྟ་བར། བྱང་སེམས་ཆེན་པོའི་སྤྱོད་པ་ལ་དམིགས་ནས་བསམ་པ་རྒྱ་ཆེན་པོ་བསྐྱེད་པའི་སྤོབས་པ་སྦྱིན་རྒྱུ།",
                "audience_assumptions": "ཀློག་པ་པོས་མཆོད་པའི་རིམ་པ་མང་པོ་ཤེས་ཟིན་པས། ད་ནི་མཆོད་པའི་མཐར་ཐུག་གི་དམིགས་ཡུལ་དང་བསམ་པའི་ཁྱད་པར་ལ་དོ་སྣང་བྱེད་པའི་དུས་ལ་བབས་པར་ཆ་འཇོག་བྱེད།"
              }
            },
            {
              "level": "subsection",
              "number": "2.1.6",
              "title": "The offering of melodious praise",
              "verses_span": "23-23",
              "summary": {
                "content_summary": "ས་བཅད་འདིས་མཆོད་པའི་རིམ་པའི་མཐའ་མ་སྟེ་ངག་གི་མཆོད་པ་འབུལ་ཚུལ་སྟོན། དེ་ཡང་ཡོན་ཏན་རྒྱ་མཚོ་ལྟ་བུ་དང་ལྡན་པའི་སངས་རྒྱས་སྲས་དང་བཅས་པ་རྣམས་ལ། བསྟོད་དབྱངས་ཀྱི་ཡན་ལག་རྒྱ་མཚོ་ལྟ་བུས་བསྟོད་པ་དང་། བསྟོད་པའི་དབྱངས་སྙན་གྱི་སྤྲིན་དེ་དག་ཀྱང་རྒྱུན་དུ་འབྱུང་བར་ཤོག་ཅེས་སྨོན་པ་དེ་ཡིན། འདི་ནི་ལུས་ངག་ཡིད་གསུམ་གྱི་མཆོད་པའི་ནང་ནས་ངག་གི་མཆོད་པའི་རྩེ་མོར་གྱུར་པ་ཡིན།",
                "key_concepts": [
                  "ངག་གི་མཆོད་པ།",
                  "བསྟོད་དབྱངས།",
                  "ཡོན་ཏན་རྒྱ་མཚོ།",
                  "བསྟོད་དབྱངས་ཀྱི་སྤྲིན།"
                ],
                "transformative_goal": "དཀོན་མཆོག་གི་ཡོན་ཏན་ལ་ཡིད་ཆེས་དང་དད་གུས་ཟབ་མོ་བསྐྱེད་པ་དང་། རང་གི་ངག་གི་ནུས་པ་དེ་འཇིག་རྟེན་གྱི་གཏམ་འཆལ་ལ་མི་བཀོལ་བར་དོན་དང་ལྡན་པའི་བསྟོད་བསྔགས་ཀྱི་ལམ་དུ་བསྒྱུར་རྒྱུ།",
                "function_in_hierarchy": "མཆོད་འབུལ་གྱི་ས་བཅད་ཡོངས་རྫོགས་མཇུག་བསྡུ་བའི་ཚུལ་དུ་ངག་གི་མཆོད་པ་བསྟན། དེས་ལུས་ངག་ཡིད་གསུམ་གྱི་མཆོད་པ་ཆ་ཚང་བར་བྱས་ཏེ། ས་བཅད་རྗེས་མ་སྟེ་ཕྱག་འཚལ་བ་ལ་འཇུག་པའི་སྒོ་འབྱེད།",
                "inter_node_relationships": [
                  {
                    "related_node_id": "2.1.5",
                    "relationship_type": "ཡན་ལག་ཏུ་གྱུར་པ།",
                    "conceptual_bridge": "བླ་ན་མེད་པའི་མཆོད་པའི་བསམ་པ་དེས་ཀུན་ནས་བསླངས་ཏེ། ད་ནི་ངག་གི་སྒོ་ནས་དངོས་སུ་ཡོན་ཏན་བརྗོད་དེ་བསྟོད་པའི་མཆོད་པ་འབུལ།"
                  },
                  {
                    "related_node_id": "2.2",
                    "relationship_type": "འབྲེལ་བ་ཆགས་པ།",
                    "conceptual_bridge": "ཡོན་ཏན་བརྗོད་ནས་དད་གུས་བསྐྱེད་པའི་སེམས་དེས་ད་ནི་ལུས་ཀྱི་སྒོ་ནས་གུས་པ་མཚོན་པའི་ཕྱག་འཚལ་བའི་བྱ་བ་ལ་འཇུག"
                  }
                ],
                "implicit_concepts": [
                  "ངག་གི་ནུས་པ།",
                  "དད་པའི་རྩ་བ།",
                  "ཡོན་ཏན་རྗེས་སུ་དྲན་པའི་ཕན་ཡོན།"
                ],
                "pedagogical_strategy": "སྙན་ངག་གི་ཚིག་རྒྱན་ཏེ་ \"རྒྱ་མཚོ་\" དང་ \"སྤྲིན་\" ཞེས་པ་བེད་སྤྱད་དེ། བསྟོད་པའི་ཁྱབ་རྒྱ་དང་ཚད་མེད་པའི་རང་བཞིན་དེ་ཀློག་པ་པོའི་ཡིད་ལ་འཆར་དུ་འཇུག",
                "intended_impact_on_reader": "དཀོན་མཆོག་གི་ཡོན་ཏན་ལ་བསམ་བཞིན་དུ་དད་པ་དང་སྤྲོ་བ་འཕེལ་ནས། རང་གི་ངག་དེ་དོན་མེད་ཀྱི་གཏམ་ལས་བསྲུངས་ཏེ་དགེ་བའི་ལམ་དུ་བཀོལ་འདོད་ཀྱི་བསམ་པ་བསྐྱེད་རྒྱུ།",
                "audience_assumptions": "ཀློག་པ་པོས་ལུས་དང་ཡིད་ཀྱི་མཆོད་པའི་རིམ་པ་ཤེས་ཟིན་པས། ད་ནི་ངག་གི་མཆོད་པའི་སྐོར་ཤེས་འདོད་ཡོད་པར་ཆ་འཇོག་བྱེད།"
              }
            }
          ]
        },
        {
          "level": "section",
          "number": "2.2",
          "title": "An act of veneration",
          "verses_span": "24-25",
          "summary": {
            "content_summary": "ས་བཅད་འདིས་མཆོད་པ་ཕུལ་རྗེས་གུས་པའི་རྣམ་འགྱུར་མཚོན་པའི་ཕྱག་འཚལ་བའི་སྐོར་སྟོན། འདིར་དུས་གསུམ་གྱི་སངས་རྒྱས་དང་། དམ་པའི་ཆོས། འཕགས་པའི་ཚོགས་བཅས་དཀོན་མཆོག་གསུམ་དང་། དེ་བཞིན་བྱང་ཆུབ་སེམས་ཀྱི་རྟེན་དང་། མཆོད་རྟེན། མཁན་སློབ་དང་བརྟུལ་ཞུགས་མཆོག་ལ་སོགས་པའི་ཡུལ་རྣམས་ལ། ཞིང་གི་རྡུལ་སྙེད་ཀྱི་ལུས་སྤྲུལ་ནས་ལུས་ངག་ཡིད་གསུམ་གུས་པས་ཕྱག་འཚལ་དགོས་པར་བཤད། ཕྱག་འཚལ་བ་ནི་ལུས་ཀྱི་སྒོ་ནས་སྒྲིབ་པ་སྦྱོང་ཞིང་ཚོགས་གསོག་པའི་ཐབས་མཆོག་ཅིག་ཡིན།",
            "key_concepts": [
              "ཕྱག་འཚལ་བ།",
              "དཀོན་མཆོག་གསུམ།",
              "མཆོད་པའི་རྟེན།",
              "མཁན་སློབ།",
              "ལུས་ཀྱི་གུས་པ།"
            ],
            "transformative_goal": "རང་རྒྱུད་ཀྱི་ང་རྒྱལ་དང་ཁེངས་དྲེགས་བཅོམ་ནས། ཡོན་ཏན་གྱི་གནས་རྣམས་ལ་གུས་པ་དང་དད་པའི་སེམས་བསྐྱེད་དེ། སེམས་རྒྱུད་དུལ་ཞིང་མཉེན་པར་བྱ་རྒྱུ།",
            "function_in_hierarchy": "མཆོད་པའི་རྗེས་སུ་འབྲངས་ཏེ་གུས་པའི་བྱ་བ་དངོས་སྟོན། འདིས་ལུས་ཀྱི་སྒོ་ནས་གུས་པ་མཚོན་པར་བྱེད་པ་དང་། རྗེས་སུ་འབྱུང་བའི་སྐྱབས་འགྲོའི་སེམས་ཁམས་ཀྱི་རྨང་གཞི་འདིང་། མཆོད་འབུལ་གྱིས་བསོད་ནམས་བསགས་པ་དང་། ཕྱག་འཚལ་བས་སྡིག་སྒྲིབ་སྦྱོང་བའི་ནུས་པ་ཡང་ཡོད།",
            "inter_node_relationships": [
              {
                "related_node_id": "2.1",
                "relationship_type": "རྒྱུན་འཛིན་པ།",
                "conceptual_bridge": "མཆོད་པ་འབུལ་བའི་བསམ་པ་དེ་ལུས་ཀྱི་བྱ་བ་དངོས་ཏེ་ཕྱག་འཚལ་བའི་སྟེང་དུ་སྦྱར་ནས། བསམ་པ་དང་སྦྱོར་བ་གཉིས་ཆ་ཚང་བར་བྱེད།"
              },
              {
                "related_node_id": "2.3",
                "relationship_type": "སྔོན་འགྲོ།",
                "conceptual_bridge": "དཀོན་མཆོག་གསུམ་གྱི་ཡོན་ཏན་དྲན་ནས་ཕྱག་འཚལ་བས། དེ་དག་ལ་བློ་གཏད་ཆོག་པའི་ཡིད་ཆེས་སྐྱེས་ཏེ་སྐྱབས་སུ་འགྲོ་བའི་བསམ་པ་བསྐྱེད་པར་ཕན།"
              }
            ],
            "implicit_concepts": [
              "ལུས་དང་སེམས་ཀྱི་འབྲེལ་བ།",
              "ང་རྒྱལ་སྤོང་བའི་གལ་ཆེའི་རང་བཞིན།",
              "གུས་པའི་རིན་ཐང་།"
            ],
            "pedagogical_strategy": "ཕྱག་འཚལ་བའི་ཡུལ་རྣམས་རིམ་པ་བཞིན་བགྲངས་ཏེ། ཕྱག་འཚལ་བའི་ཁྱབ་རྒྱ་དེ་དཀོན་མཆོག་གསུམ་ཙམ་མ་ཡིན་པར། ཆོས་དང་འབྲེལ་བའི་ཡུལ་ཐམས་ཅད་ལ་ཁྱབ་དགོས་པར་བསྟན། འདིས་གུས་པའི་བསམ་པ་དེ་ཡུལ་ཀུན་ལ་སྦྱོར་བའི་ཐབས་སྟོན།",
            "intended_impact_on_reader": "ཀློག་པ་པོའི་རྒྱུད་ལ་ཡོན་ཏན་གྱི་གནས་གང་དང་འཕྲད་ཀྱང་གུས་པའི་བསམ་པ་སྐྱེ་བ་དང་། ཕྱག་འཚལ་བ་དེ་སྡིག་སྒྲིབ་སྦྱོང་བའི་ཐབས་མཆོག་ཅིག་ཏུ་མཐོང་ནས་དེ་ལ་བརྩོན་པར་སྐུལ་མ་བྱ་རྒྱུ།",
            "audience_assumptions": "ཀློག་པ་པོས་མཆོད་འབུལ་གྱི་རིམ་པ་ཤེས་ཟིན་པས། ད་ནི་གུས་པའི་རྣམ་འགྱུར་མཚོན་པའི་ལུས་ཀྱི་བྱ་བ་དངོས་ལ་འཇུག་པར་གྲ་སྒྲིག་ཡོད་པར་ཆ་འཇོག་བྱེད།"
          },
          "children": []
        },
        {
          "level": "section",
          "number": "2.3",
          "title": "Taking refuge",
          "verses_span": "26-26",
          "summary": {
            "content_summary": "ས་བཅད་འདིས་སྔོན་གྱི་མཆོད་འབུལ་དང་ཕྱག་འཚལ་བའི་རྨང་གཞིའི་སྟེང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མ་ཐོབ་བར་དུ་སངས་རྒྱས་དང་། ཆོས། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་བཅས་ཐེག་པ་ཆེན་པོའི་དཀོན་མཆོག་གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བའི་དམ་བཅའ་སྟོན། འདི་ནི་ནང་པ་སངས་རྒྱས་པའི་ཉམས་ལེན་ཐམས་ཅད་ཀྱི་སྒོ་དང་རྨང་གཞི་ཡིན་ལ། ལྷག་པར་དུ་བྱང་སེམས་ཀྱི་སྡོམ་པའི་གཞི་རྟེན་ཡང་ཡིན། འགྲེལ་བའི་ནང་སྐྱབས་འགྲོའི་རྒྱུ་དང་ངོ་བོ། དབྱེ་བ། བསླབ་བྱ་སོགས་རྒྱས་པར་བཤད་ཡོད།",
            "key_concepts": [
              "སྐྱབས་སུ་འགྲོ་བ།",
              "བྱང་ཆུབ་སྙིང་པོ།",
              "ཐེག་ཆེན་དཀོན་མཆོག་གསུམ།",
              "རྒྱུ་ཡི་སྐྱབས་འགྲོ།",
              "འབྲས་བུའི་སྐྱབས་འགྲོ།"
            ],
            "transformative_goal": "འཁོར་བའི་འཇིགས་པ་ལས་སྐྱོབ་པའི་སྐྱབས་གནས་ངོ་མ་དེ་དཀོན་མཆོག་གསུམ་ཁོ་ན་ཡིན་པའི་ཡིད་ཆེས་བརྟན་པོ་བསྐྱེད་དེ། རང་གི་ལམ་གྱི་སྟོན་པ་དང་། ལམ་དངོས། ལམ་གྲོགས་བཅས་ངོས་ཟིན་པར་བྱས་ཏེ་ལམ་ནོར་དུ་མི་འགྲོ་བར་བྱ་རྒྱུ།",
            "function_in_hierarchy": "འདི་ནི་མཆོད་འབུལ་སོགས་སྔོན་འགྲོའི་ཉམས་ལེན་དང་སྡིག་བཤགས་བར་གྱི་ཟམ་པ་ལྟ་བུ་ཡིན། སྐྱབས་སུ་སོང་ནས་སྡིག་པ་བཤགས་པའི་ཡུལ་ངོས་ཟིན་པར་བྱེད་པ་དང་། སྡིག་བཤགས་ཀྱི་སྟོབས་བཞིའི་ནང་གི་རྟེན་གྱི་སྟོབས་ཀྱི་ཆ་ཤས་གཙོ་བོ་ཡང་འདིས་གྲུབ།",
            "inter_node_relationships": [
              {
                "related_node_id": "2.2",
                "relationship_type": "གཏིང་ཟབ་ཏུ་གཏོང་བ།",
                "conceptual_bridge": "ཕྱག་འཚལ་བས་བསྐྱེད་པའི་དད་གུས་དེ། ད་ནི་ཡིད་ཆེས་དང་བློ་གཏད་ཀྱི་ངོ་བོར་གྱུར་པའི་སྐྱབས་འགྲོའི་བསམ་པ་ལ་བསྒྱུར།"
              },
              {
                "related_node_id": "2.4",
                "relationship_type": "རྟེན་གྱི་སྟོབས་སུ་འགྱུར་བ།",
                "conceptual_bridge": "དཀོན་མཆོག་གསུམ་ལ་སྐྱབས་སུ་སོང་བ་དེ་ནི། དེ་དག་གི་སྤྱན་སྔར་སྡིག་པ་བཤགས་པའི་རྟེན་དང་དཔང་པོར་འགྱུར་བས་བཤགས་པའི་ནུས་པ་ཆེ་རུ་གཏོང་།"
              }
            ],
            "implicit_concepts": [
              "དད་པའི་གལ་ཆེའི་རང་བཞིན།",
              "ནང་པ་དང་ཕྱི་རོལ་པའི་ཁྱད་པར།",
              "སྡོམ་པ་ཐམས་ཅད་ཀྱི་རྩ་བ།"
            ],
            "pedagogical_strategy": "ཚིགས་བཅད་གཅིག་གི་ནང་དོན་མདོར་བསྡུས་ལ་བརྟེན་ནས། འགྲེལ་བའི་ནང་སྐྱབས་འགྲོའི་བརྗོད་གཞི་ཡོངས་རྫོགས་རྒྱས་པར་བཀྲལ། འདིས་རྩ་ཚིག་གི་གཏིང་ཟབ་པའི་རང་བཞིན་དང་དེ་ལ་འགྲེལ་བཤད་ཀྱིས་ཇི་ལྟར་རྒྱ་བསྐྱེད་ཚུལ་སྟོན།",
            "intended_impact_on_reader": "སྐྱབས་འགྲོ་ནི་ཆོ་ག་ཙམ་མ་ཡིན་པར། ཉམས་ལེན་ཐམས་ཅད་ཀྱི་སྲོག་ཤིང་དང་། རང་གི་བློ་གཏད་ས། འཇིགས་པ་ལས་སྐྱོབ་མཁན་གཅིག་པུ་ཡིན་པའི་གོ་བ་གཏིང་ཟབ་སྐྱེད་རྒྱུ།",
            "audience_assumptions": "ཀློག་པ་པོ་ནི་ནང་པའི་ཉམས་ལེན་ལ་དངོས་སུ་འཇུག་འདོད་ཡོད་མཁན་ཞིག་ཡིན་པས། སྐྱབས་འགྲོའི་གལ་ཆེའི་རང་བཞིན་དང་དེའི་བསླབ་བྱ་རྣམས་ཤེས་དགོས་པར་ཆ་འཇོག་བྱེད།"
          },
          "children": [
            {
              "level": "subsection",
              "number": "2.3.1",
              "title": "An explanation of Mahayana refuge",
              "verses_span": "26-26",
              "summary": {
                "content_summary": "ཚིགས་བཅད་འདིས་ཐེག་པ་ཆེན་པོའི་སྐྱབས་འགྲོའི་ཁྱད་ཆོས་གསལ་སྟོན་བྱེད། དེ་ཡང་སྐྱབས་སུ་འགྲོ་བའི་དུས་ཡུན་ནི་རང་ཉིད་བྱང་ཆུབ་མ་ཐོབ་ཀྱི་བར་དུ་ཡིན་པ་དང་། སྐྱབས་ཡུལ་ནི་སྐུ་བཞི་དང་ཡེ་ཤེས་ལྔ་ལྡན་གྱི་སངས་རྒྱས་དང་། ལུང་དང་རྟོགས་པའི་དམ་ཆོས། ས་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་བཅས་ཡིན། འདིའི་ཀུན་སློང་ནི་སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་གོ་འཕང་ལ་འགོད་པའི་ཆེད་དུ་ཡིན་པས་ཐུན་མོང་མ་ཡིན་པའི་ཁྱད་ཆོས་དང་ལྡན།",
                "key_concepts": [
                  "ཐེག་ཆེན་གྱི་སྐྱབས་ཡུལ།",
                  "དུས་ཡུན་བྱང་ཆུབ་མ་ཐོབ་བར།",
                  "ཀུན་སློང་སེམས་ཅན་གྱི་དོན།",
                  "སངས་རྒྱས། ཆོས། བྱང་སེམས་ཀྱི་ཚོགས།"
                ],
                "transformative_goal": "རང་ཉིད་གཅིག་པུ་འཁོར་བ་ལས་གྲོལ་བའི་བསམ་པ་ལས་བརྒལ་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་སངས་རྒྱས་ཀྱི་གོ་འཕང་ཐོབ་པར་བྱ་སྙམ་པའི་བློ་རྒྱ་ཆེན་པོ་བསྐྱེད་རྒྱུ།",
                "function_in_hierarchy": "སྐྱབས་འགྲོའི་ས་བཅད་ཀྱི་ནང་དོན་གཙོ་བོ་དང་རྩ་བའི་ཚིགས་བཅད་དངོས་ཡིན། འདིས་གཞུང་འདིའི་ལྟ་བ་སྟེ་ཐེག་པ་ཆེན་པོའི་ལྟ་བ་དང་མཐུན་པའི་སྐྱབས་འགྲོ་ངོ་སྤྲོད་བྱེད།",
                "inter_node_relationships": [
                  {
                    "related_node_id": "2.3",
                    "relationship_type": "སྙིང་པོར་གྱུར་པ།",
                    "conceptual_bridge": "ས་བཅད་འདི་ནི་སྐྱབས་འགྲོའི་སྡེ་ཚན་ཡོངས་ཀྱི་རྩ་བ་ཡིན། འགྲེལ་བའི་ནང་གི་སྐྱབས་འགྲོའི་དབྱེ་བ་དང་བསླབ་བྱ་སོགས་ཐམས་ཅད་ཚིགས་བཅད་འདི་ལ་འགྲེལ་བཤད་བྱེད་པ་ཞིག་ཡིན།"
                  }
                ],
                "implicit_concepts": [
                  "བདག་གཞན་མཉམ་བརྗེ།",
                  "ཐེག་ཆེན་དང་ཐེག་དམན་གྱི་ཁྱད་པར།",
                  "སྙིང་རྗེ་ཆེན་པོ།"
                ],
                "pedagogical_strategy": "མདོར་བསྡུས་ལ་གཏིང་ཟབ་པའི་ཚིག་གི་སྒོ་ནས་ཐེག་ཆེན་སྐྱབས་འགྲོའི་ཁྱད་ཆོས་གསུམ་སྟེ་དུས་ཡུན། ཡུལ། ཀུན་སློང་བཅས་གསལ་བོར་བསྟན།",
                "intended_impact_on_reader": "རང་གི་ཉམས་ལེན་གྱི་དམིགས་ཡུལ་དེ་རང་དོན་ཙམ་མ་ཡིན་པར། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་ཡིན་པའི་བསམ་པ་བརྟན་པོ་བསྐྱེད་དེ། ཐེག་པ་ཆེན་པོའི་ལམ་ལ་གཞོལ་བའི་ཆོད་སེམས་འདྲོངས་རྒྱུ།",
                "audience_assumptions": "ཀློག་པ་པོ་ལ་སྐྱབས་འགྲོ་སྤྱིའི་གོ་བ་ཡོད་ཀྱང་། ཐེག་ཆེན་གྱི་སྐྱབས་འགྲོའི་ཐུན་མོང་མ་ཡིན་པའི་ཁྱད་ཆོས་རྣམས་ཤེས་པར་སྤྲོ་བ་ཡོད་པར་ཆ་འཇོག་བྱེད།"
              }
            }
          ]
        },
        {
          "level": "section",
          "number": "2.4",
          "title": "The confession of negative actions",
          "verses_span": "27-65",
          "summary": {
            "content_summary": "ས་བཅད་འདིས་བྱང་ཆུབ་ཀྱི་སེམས་བསྐྱེད་པའི་ཆ་རྐྱེན་གཉིས་པ་སྟེ་སྒྲིབ་པ་སྦྱོང་བའི་ཐབས་ལམ་གཙོ་བོ་སྡིག་པ་བཤགས་པའི་རིམ་པ་རྒྱས་པར་སྟོན། འདི་ནི་སྟོབས་བཞི་ཚང་བའི་སྒོ་ནས་བཤགས་པ་བྱེད་ཚུལ་ཞིག་ཡིན། དང་པོ་བཤགས་པའི་ཡུལ་དཔང་པོར་དམིགས་པ། དེ་ནས་འགྱོད་སེམས་དྲག་པོས་སྔར་བྱས་ཀྱི་སྡིག་པ་ལ་འགྱོད་པ་བསྐྱེད་པའི་སུན་འབྱིན་པའི་སྟོབས། དཀོན་མཆོག་གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བ་སོགས་རྟེན་གྱི་སྟོབས། དགེ་བའི་བྱ་བ་སྤེལ་བ་སོགས་གཉེན་པོ་ཀུན་ཏུ་སྤྱོད་པའི་སྟོབས། མཐར་ཕྱིན་ཆད་སྲོག་ལ་བབས་ཀྱང་མི་བྱེད་པར་དམ་བཅའ་བའི་ཉེས་པ་ལས་སླར་ལྡོག་པའི་སྟོབས་བཅས་ཡིན།",
            "key_concepts": [
              "སྡིག་པ་བཤགས་པ།",
              "སྟོབས་བཞི།",
              "རྣམ་པར་སུན་འབྱིན་པའི་སྟོབས། (འགྱོད་པ།)",
              "རྟེན་གྱི་སྟོབས། (སྐྱབས་འགྲོ།)",
              "གཉེན་པོ་ཀུན་ཏུ་སྤྱོད་པའི་སྟོབས། (དགེ་སྦྱོར།)",
              "ཉེས་པ་ལས་སླར་ལྡོག་པའི་སྟོབས། (དམ་བཅའ།)"
            ],
            "transformative_goal": "འཁོར་བ་དང་ངན་སོང་གི་སྡུག་བསྔལ་ལ་འཇིགས་སྐྲག་དང་། ལས་རྒྱུ་འབྲས་ལ་ཡིད་ཆེས་བརྟན་པོ་བསྐྱེད་པའི་སྒོ་ནས་སྔར་བྱས་ཀྱི་སྡིག་པའི་དྲི་མ་རྩད་ནས་སྦྱངས་ཏེ། སེམས་རྒྱུད་གཙང་ཞིང་དག་པ་ཞིག་བསྐྲུན་རྒྱུ།",
            "function_in_hierarchy": "ལེའུའི་བརྗོད་བྱ་གཙོ་བོ་གཉིས་པ་སྟེ། ཚོགས་བསགས་པའི་རྗེས་སུ་སྒྲིབ་པ་སྦྱོང་བའི་རིམ་པ་ཡོངས་སུ་རྫོགས་པ་སྟོན། འདིས་ལེའུ་འདིའི་མཇུག་བསྡུ་བ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་དངོས་སུ་བསྐྱེད་པའི་ལེའུ་གསུམ་པ་ལ་འཇུག་པའི་སྒོ་མོ་ཡོངས་སུ་འབྱེད།",
            "inter_node_relationships": [
              {
                "related_node_id": "2.1",
                "relationship_type": "གསབ་རེས་བྱེད་པ།",
                "conceptual_bridge": "ས་བཅད་འདིས་སྒྲིབ་པ་སྦྱོང་བ་དང་། ས་བཅད་ ༢.༡ གིས་ཚོགས་གསོག་པས། ཡན་ལག་གཉིས་ཀྱིས་སྔོན་འགྲོའི་ཆ་རྐྱེན་ཆ་ཚང་བར་བསྐྲུན།"
              }
            ],
            "implicit_concepts": [
              "ལས་རྒྱུ་འབྲས།",
              "མི་རྟག་པ།",
              "འཁོར་བའི་ཉེས་དམིགས།"
            ],
            "pedagogical_strategy": "སྟོབས་བཞིའི་རིམ་པ་ལྟར་གོ་རིམ་བསྒྲིགས་ནས་སློབ་ཁྲིད་བྱེད། ལྷག་པར་དུ་སུན་འབྱིན་པའི་སྟོབས་བསྐྱེད་པའི་ཆེད་དུ་མི་རྟག་པ་དང་འཆི་བའི་འཇིགས་པ། ངན་སོང་གི་སྡུག་བསྔལ་སོགས་ཞིབ་འབྲི་དང་དཔེ་མཚོན་གྱིས་བརྒྱན་ནས་སེམས་འགུལ་ཐེབས་པའི་ཐབས་ལམ་སྤྱད།",
            "intended_impact_on_reader": "སྡིག་པའི་བྱ་བ་ལ་སུན་སྣང་དང་འཇིགས་སྐྲག་སྐྱེས་ཏེ། བཤགས་པ་བྱེད་པར་བག་འཁུམས་མི་བྱེད་པར་སྙིང་ཐག་པ་ནས་བཤགས་པའི་སྤོབས་པ་བསྐྱེད་པ་དང་། ཕྱིན་ཆད་སྡིག་པ་དང་ཐག་གཅོད་པའི་ཆོད་སེམས་བརྟན་པོ་སྦྱིན་རྒྱུ།",
            "audience_assumptions": "ཀློག་པ་པོ་ནི་རང་རྒྱུད་ཀྱི་སྡིག་སྒྲིབ་ཀྱིས་ཉམས་ལེན་ལ་བར་ཆད་བྱེད་པ་ཤེས་ཡོད་མོད། འོན་ཀྱང་དེ་ཇི་ལྟར་སྦྱོང་བའི་ཐབས་ལམ་ཞིབ་ཚགས་པོ་མི་ཤེས་པར་ཆ་འཇོག་བྱེད།"
          },
          "children": [
            {
              "level": "subsection",
              "number": "2.4.1",
              "title": "The visualization of the witnesses of one’s confession",
              "verses_span": "27-27",
              "summary": {
                "content_summary": "ས་བཅད་འདིས་སྡིག་པ་བཤགས་པའི་སྔོན་འགྲོ་སྟེ། བཤགས་པའི་ཡུལ་དམ་པ་རྣམས་ཡིད་ལ་དམིགས་ཚུལ་སྟོན། དེ་ཡང་ཕྱོགས་བཅུར་བཞུགས་པའི་ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་རྫོགས་པའི་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མདུན་གྱི་ནམ་མཁར་དམིགས་ནས། ཁོང་རྣམས་དཔང་དུ་བཞག་སྟེ་ཐལ་མོ་སྦྱར་ནས་གསོལ་བ་འདེབས་པའི་རྣམ་པ་དེ་ཡིན། འདི་ནི་བཤགས་པའི་རྟེན་གྱི་སྟོབས་ཀྱི་ཆ་ཤས་གཙོ་བོ་ཡིན།",
                "key_concepts": [
                  "བཤགས་པའི་ཡུལ།",
                  "དཔང་པོར་དམིགས་པ།",
                  "སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ།",
                  "ཐུགས་རྗེ་ཆེན་པོ།"
                ],
                "transformative_goal": "སྡིག་བཤགས་ཀྱི་བྱ་བ་དེ་རང་གི་སེམས་ནང་གི་བྱ་བ་ཙམ་མ་ཡིན་པར། ཡེ་ཤེས་ཀྱི་སྤྱན་དང་ལྡན་པའི་རྒྱལ་བ་སྲས་བཅས་ཀྱི་སྤྱན་སྔར་དངོས་སུ་ཞུ་བ་འཐེན་པའི་བསམ་པ་བསྐྱེད་དེ། བཤགས་པའི་བྱ་བ་ལ་ནན་ཏན་དང་གཟབ་ནན་གྱི་སེམས་ཁམས་བསྐྲུན་རྒྱུ།",
                "function_in_hierarchy": "སྡིག་བཤགས་ཀྱི་རིམ་པའི་དབུ་བརྩམས་ཏེ། བཤགས་པའི་ཡུལ་ངོས་འཛིན་པར་བྱེད། འདིས་རྗེས་ཀྱི་བཤགས་པ་ཐམས་ཅད་ཡུལ་སུ་ཞིག་གི་དྲུང་དུ་བྱེད་དགོས་པ་གསལ་སྟོན་བྱེད།",
                "inter_node_relationships": [
                  {
                    "related_node_id": "2.4.2",
                    "relationship_type": "སྔོན་འགྲོ།",
                    "conceptual_bridge": "བཤགས་པའི་ཡུལ་ངོས་ཟིན་ཅིང་དཔང་པོར་བཞག་པའི་རྨང་གཞིའི་སྟེང་དུ། ད་གཟོད་བཤགས་པའི་བྱ་བ་དངོས་ཏེ་སྟོབས་བཞིའི་ཉམས་ལེན་ལ་འཇུག"
                  }
                ],
                "implicit_concepts": [
                  "སངས་རྒྱས་རྣམས་ཀྱི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས།",
                  "དད་པའི་ནུས་པ།"
                ],
                "pedagogical_strategy": "མདོར་བསྡུས་ལ་གསལ་བའི་ཚིག་གི་སྒོ་ནས་དམིགས་པའི་རྣམ་པ་གཙོ་བོ་སྟོན། འདིས་ཉམས་ལེན་པའི་བསམ་བློ་དེ་བཤགས་པའི་བྱ་བ་དངོས་ལ་འཇུག་པའི་སྔོན་དུ་གྲ་སྒྲིག་བྱེད་དུ་འཇུག",
                "intended_impact_on_reader": "རང་ཉིད་གཅིག་པུར་སྡིག་པ་བཤགས་པ་མིན་པར། ཐུགས་རྗེ་དང་ནུས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པའི་དཔང་པོ་མང་པོའི་སྤྱན་སྔར་བཤགས་བཞིན་ཡོད་སྙམ་པའི་ཚོར་བ་བསྐྱེད་དེ། བཤགས་པའི་ནུས་པ་ཆེ་རུ་གཏོང་རྒྱུ།",
                "audience_assumptions": "ཀློག་པ་པོས་སྡིག་པ་བཤགས་དགོས་པ་ཤེས་ཀྱང་། དེ་ཇི་ལྟར་བྱེད་པའི་ཆོ་ག་དང་གོ་རིམ་གསལ་བོ་མི་ཤེས་པར་ཆ་འཇོག་བྱེད།"
              }
            },
            {
              "level": "subsection",
              "number": "2.4.2",
              "title": "The confession itself",
              "verses_span": "28-65",
              "summary": {
                "content_summary": "ས་བཅད་འདིས་སྡིག་པ་བཤགས་པའི་རིམ་པ་དངོས་སྟེ། སྟོབས་བཞིའི་ཉམས་ལེན་ཞིབ་རྒྱས་སུ་སྟོན། དང་པོ་འགྱོད་པའི་སྟོབས་ཏེ། ཐོག་མེད་ནས་བསགས་པའི་སྡིག་པ་རྣམས་དང་། ལྷག་པར་དུ་མི་རྟག་པ་དང་འཆི་བའི་འཇིགས་པ་བསམས་ནས་སྙིང་ཐག་པ་ནས་འགྱོད་པ་བསྐྱེད་ཚུལ་བསྟན། གཉིས་པ་རྟེན་གྱི་སྟོབས་ཏེ། འཇིགས་པ་ལས་སྐྱོབ་པའི་སྐྱབས་གནས་དཀོན་མཆོག་གསུམ་དང་བྱང་སེམས་ཆེན་པོ་རྣམས་ལ་བློ་གཏད་ཚུལ། གསུམ་པ་གཉེན་པོའི་སྟོབས་ཏེ། དགེ་བའི་བྱ་བ་ལ་འབད་དགོས་པ་དང་སྡིག་པའི་ཉེས་དམིགས་བསམ་དགོས་ཚུལ། བཞི་པ་སླར་ལྡོག་པའི་སྟོབས་ཏེ། ཕྱིན་ཆད་སྲོག་ལ་བབས་ཀྱང་སྡིག་པ་མི་བྱེད་པའི་དམ་བཅའ་འབུལ་ཚུལ་བཅས་བསྟན་ཡོད།",
                "key_concepts": [
                  "སྟོབས་བཞི།",
                  "འགྱོད་པ།",
                  "སྐྱབས་འགྲོ།",
                  "མི་རྟག་པ།",
                  "འཆི་བའི་འཇིགས་པ།",
                  "ལས་རྒྱུ་འབྲས།",
                  "དམ་བཅའ།"
                ],
                "transformative_goal": "སྡིག་པའི་རྩ་བ་སྟེ་མ་རིག་པ་དང་ཉོན་མོངས་རྣམས་ངོས་ཟིན་ནས། སྟོབས་བཞིའི་ནུས་པ་ལ་བརྟེན་ནས་དེ་དག་གི་ཤུགས་བཅོམ་སྟེ་སེམས་རྒྱུད་དག་པར་བྱས་ཏེ། དགེ་བའི་ལམ་ལ་གཞོལ་བའི་བློ་བརྟན་པོ་བསྐྱེད་རྒྱུ།",
                "function_in_hierarchy": "འདི་ནི་ལེའུ་གཉིས་པའི་སྙིང་པོ་དང་མཇུག་བསྡོམས་ལྟ་བུ་ཡིན། འདིས་སྡིག་སྒྲིབ་སྦྱོང་བའི་ཐབས་ལམ་ཆ་ཚང་ཞིག་བསྟན་ནས། ཉམས་ལེན་པ་དེ་བྱང་ཆུབ་ཀྱི་སེམས་བསྐྱེད་པའི་སྣོད་རུང་ཞིག་ཏུ་བསྒྱུར་བར་བྱེད།",
                "inter_node_relationships": [
                  {
                    "related_node_id": "2.4.1",
                    "relationship_type": "རྒྱུན་འཛིན་པ།",
                    "conceptual_bridge": "དཔང་པོ་དམིགས་པའི་རྨང་གཞིའི་སྟེང་དུ། དེ་དག་གི་སྤྱན་སྔར་སྟོབས་བཞིའི་སྒོ་ནས་སྡིག་པ་བཤགས་པའི་བྱ་བ་དངོས་ལ་འཇུག"
                  }
                ],
                "implicit_concepts": [
                  "སེམས་ཁམས་ཀྱི་གནས་བབས་ཀྱི་གལ་ཆེའི་རང་བཞིན།",
                  "སྡིག་པ་སྦྱང་ཐུབ་པའི་རང་བཞིན་ཡིན་པ།",
                  "འགྱུར་བ་གཏོང་བའི་ནུས་པ།"
                ],
                "pedagogical_strategy": "སྟོབས་བཞིའི་གོ་རིམ་ལྟར་བཤད། ལྷག་པར་དུ་སུན་འབྱིན་པའི་སྟོབས་ཀྱི་སྐབས་སུ་མི་རྟག་པ་དང་འཆི་བ། ངན་སོང་གི་སྡུག་བསྔལ་རྣམས་དཔེ་དང་སེམས་འགུལ་ཐེབས་པའི་ཚིག་གིས་ཞིབ་འབྲི་བྱས་ཏེ། ཀློག་པ་པོའི་རྒྱུད་ལ་འགྱོད་པ་དྲག་པོ་སྐྱེ་བའི་ཐབས་བྱེད།",
                "intended_impact_on_reader": "སྡིག་པ་བཤགས་པ་ནི་ཆོ་གའི་བྱ་བ་ཙམ་མ་ཡིན་པར། རང་གི་སེམས་རྒྱུད་ལ་འགྱུར་བ་གཏིང་ཟབ་གཏོང་བའི་ཐབས་ལམ་ཞིག་ཡིན་པར་ངོས་ཟིན་ནས། སྙིང་ཐག་པ་ནས་བཤགས་ཤིང་སྡོམ་པའི་ཉམས་ལེན་ལ་འཇུག་པར་སྐུལ་མ་ཐེབས་རྒྱུ།",
                "audience_assumptions": "ཀློག་པ་པོ་ལ་སྡིག་བཤགས་ཀྱི་གལ་ཆེའི་རང་བཞིན་གྱི་གོ་བ་ཡོད་ཀྱང་། དེ་ཇི་ལྟར་སྟོབས་བཞི་དང་ལྡན་པའི་སྒོ་ནས་བྱེད་ཚུལ་གྱི་ལམ་སྟོན་ཞིབ་ཚགས་དགོས་པར་ཆ་འཇོག་བྱེད།"
              },
              "children": [
                {
                  "level": "subsubsection",
                  "number": "2.4.2.1",
                  "title": "The strength of regretting that one has done wrong",
                  "verses_span": "28-46",
                  "summary": {
                    "content_summary": "ས་བཅད་འདིས་སྟོབས་བཞིའི་ནང་ནས་དང་པོ་སྟེ་རྣམ་པར་སུན་འབྱིན་པའི་སྟོབས་རྒྱས་པར་སྟོན། འདིར་ཐོག་མེད་ནས་བསགས་པའི་སྡིག་པ་དང་། གཞན་གྱིས་བྱས་པར་རྗེས་སུ་ཡི་རང་བ། དཀོན་མཆོག་གསུམ་དང་ཕ་མ་བླ་མ་ལ་གནོད་པ་བྱས་པ་སོགས་ལ་སྙིང་ཐག་པ་ནས་བཤགས་དགོས་པར་བཤད། འགྱོད་པ་དྲག་པོ་སྐྱེ་བའི་ཐབས་སུ། འཆི་བ་མི་རྟག་པ། འཆི་བདག་གློ་བུར་དུ་འོང་བ། ཤུལ་དུ་དགྲ་མཛའ་ལོངས་སྤྱོད་ཐམས་ཅད་བཞག་ནས་གཅིག་པུར་འགྲོ་དགོས་པ། འཆི་ཁའི་སྡུག་བསྔལ་དང་གཤིན་རྗེའི་ཕོ་ཉའི་འཇིགས་པ་སོགས་ཞིབ་རྒྱས་སུ་བསམས་ནས། འཁོར་བའི་བྱ་བ་ལ་སྙིང་པོ་མེད་པ་དང་སྡིག་པའི་འབྲས་བུ་ལ་འཇིགས་སྐྲག་བསྐྱེད་དགོས་པར་གདམས།",
                    "key_concepts": [
                      "རྣམ་པར་སུན་འབྱིན་པའི་སྟོབས།",
                      "འགྱོད་སེམས།",
                      "འཆི་བ་མི་རྟག་པ།",
                      "འཁོར་བའི་སྙིང་པོ་མེད་ཚུལ།",
                      "གཤིན་རྗེའི་འཇིགས་པ།"
                    ],
                    "transformative_goal": "འཁོར་བ་དང་འཇིག་རྟེན་གྱི་བྱ་གཞག་ལ་ཆགས་ཞེན་དང་སྙིང་པོར་འཛིན་པའི་བློ་ལོག་དེ་བཟློག་སྟེ། སྔར་བྱས་ཀྱི་སྡིག་པ་ལ་འགྱོད་པ་དྲག་པོ་སྐྱེས་ནས་ཆོས་ལ་སྙིང་ཐག་པ་ནས་འཇུག་པའི་བློ་བསྐྱེད་རྒྱུ།",
                    "function_in_hierarchy": "སྡིག་བཤགས་ཀྱི་སྟོབས་བཞིའི་ནང་གི་རྨང་གཞི་དང་སྒུལ་ཤུགས་གཙོ་བོ་ཡིན། འགྱོད་སེམས་དྲག་པོ་མ་སྐྱེས་ན། རྟེན་དང་གཉེན་པོ། སླར་ལྡོག་པ་བཅས་ཀྱི་སྟོབས་རྣམས་ལ་ནུས་པ་ཐོན་མི་ཐུབ།",
                    "inter_node_relationships": [
                      {
                        "related_node_id": "2.4.2.2",
                        "relationship_type": "སྒུལ་ཤུགས་སྤྲོད་པ།",
                        "conceptual_bridge": "སྡིག་པའི་ཉེས་དམིགས་དང་འཆི་བའི་འཇིགས་པ་ལ་བསམས་ནས་སྐྲག་སྣང་སྐྱེས་པས། དེ་ལས་སྐྱོབ་པའི་སྐྱབས་གནས་དམ་པ་སྟེ་རྟེན་གྱི་སྟོབས་ལ་བརྟེན་འདོད་ཀྱི་བསམ་པ་ཤུགས་ཀྱིས་སྐྱེ།"
                      }
                    ],
                    "implicit_concepts": [
                      "དུས་ཚོད་ཀྱི་རིན་ཐང་།",
                      "སེམས་ཀྱི་བདེ་སྐྱིད་ངོ་མ།",
                      "བག་ཆགས།"
                    ],
                    "pedagogical_strategy": "སེམས་འགུལ་ཐེབས་པའི་ཐབས་ལམ་གཙོ་བོར་བཟུང་སྟེ། འཆི་བའི་རིམ་པ་དང་དེའི་འཇིགས་སྣང་རྣམས་མིག་མཐོང་ལག་ཟིན་ལྟར་ཞིབ་འབྲི་བྱས་ནས་ཀློག་པ་པོའི་རྒྱུད་ལ་སྐྲག་སྣང་དང་སུན་སྣང་སྐྱེ་བར་བྱེད། དཔེ་དང་འབྲས་བུ་དངོས་ཀྱི་སྒོ་ནས་སྡིག་པའི་ཉེས་དམིགས་གསལ་སྟོན་བྱེད།",
                    "intended_impact_on_reader": "འཇིག་རྟེན་གྱི་བྱ་གཞག་ལ་བག་ཡངས་སུ་སྡོད་པའི་བསམ་བློ་དོར་ནས། རང་གི་ཚེ་སྲོག་ནི་སྐད་ཅིག་ཀྱང་མི་སྡོད་པར་འགྱུར་བཞིན་ཡོད་པ་དང་། སྡིག་པའི་འབྲས་བུ་ནི་བསམ་ཡུལ་ལས་འདས་པ་ཞིག་ཡིན་པར་ངོས་ཟིན་ཏེ་བཤགས་སྡོམ་ལ་བྲེལ་བ་སྐྱེ་རྒྱུ།",
                    "audience_assumptions": "ཀློག་པ་པོ་ནི་འཇིག་རྟེན་གྱི་བྱ་བར་གཡེང་ནས་འཆི་བ་མི་རྟག་པ་སོགས་དྲན་པ་དཀོན་པ་ཞིག་ཡིན་སྲིད་པས། དེ་ལ་དྲན་སྐུལ་དང་སྐྲག་སྣང་སྐྱེ་བའི་གདམས་ངག་དགོས་པར་ཆ་འཇོག་བྱེད།"
                  }
                },
                {
                  "level": "subsubsection",
                  "number": "2.4.2.2",
                  "title": "The strength of support",
                  "verses_span": "47-53",
                  "summary": {
                    "content_summary": "ས་བཅད་འདིས་སྟོབས་བཞིའི་གཉིས་པ་སྟེ་རྟེན་གྱི་སྟོབས་སྟོན། འཆི་བ་དང་ངན་སོང་གི་འཇིགས་པ་ལས་སྐྱོབ་པའི་སྐྱབས་གནས་ངོ་མ་ནི། སྟོབས་བཅུའི་དབང་ཕྱུག་སངས་རྒྱས་དང་། འཁོར་བའི་འཇིགས་པ་སེལ་བའི་དམ་པའི་ཆོས། ས་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་བཅས་ཡིན་པས། དེ་དག་ལ་དེ་རིང་ཉིད་ནས་སྐྱབས་སུ་འགྲོ་དགོས་པར་བཤད། ལྷག་པར་དུ་ཀུན་ཏུ་བཟང་པོ། འཇམ་དབྱངས། སྤྱན་རས་གཟིགས། ནམ་མཁའི་སྙིང་པོ། རྡོ་རྗེ་འཆང་སོགས་བྱང་སེམས་ཆེན་པོ་རྣམས་ཀྱི་མཚན་ནས་བོས་ཏེ་སྐྱབས་འཚོལ་དགོས་པར་གདམས། འདི་ནི་སྡིག་པ་བཤགས་པའི་རྟེན་དང་དཔང་པོ་གཙོ་བོ་དེ་ཡིན།",
                    "key_concepts": [
                      "རྟེན་གྱི་སྟོབས།",
                      "སྐྱབས་སུ་འགྲོ་བ།",
                      "སངས་རྒྱས་ཀྱི་སྟོབས་བཅུ།",
                      "བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་བརྒྱད།",
                      "རྡོ་རྗེ་འཆང་།"
                    ],
                    "transformative_goal": "འཇིགས་སྐྲག་དང་ཡི་མུག་པའི་སེམས་ཁམས་ལས་གྲོལ་ཏེ། ནུས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པའི་སྐྱབས་གནས་དམ་པ་ལ་བློ་གཏད་པས། སྡིག་པ་སྦྱོང་བའི་གདེང་ཚོད་དང་སྤོབས་པ་བསྐྱེད་རྒྱུ།",
                    "function_in_hierarchy": "འགྱོད་པའི་སྟོབས་ཀྱིས་བསྐྱེད་པའི་འཇིགས་པ་ལ་བརྟེན་ནས། དེ་ལས་སྐྱོབ་པའི་ཐབས་ལམ་དངོས་སྟོན། འདིས་བཤགས་པའི་བྱ་བ་དེ་རང་གི་ནུས་པ་ཁོ་ན་ལ་བརྟེན་པ་མིན་པར། སྐྱབས་ཡུལ་གྱི་བྱིན་རླབས་དང་ནུས་པར་བརྟེན་དགོས་པ་གསལ་སྟོན་བྱེད།",
                    "inter_node_relationships": [
                      {
                        "related_node_id": "2.4.2.1",
                        "relationship_type": "འབྲས་བུར་གྱུར་པ།",
                        "conceptual_bridge": "འགྱོད་པའི་སྟོབས་ཀྱིས་སྐྱབས་འཚོལ་བའི་བསམ་པ་བསྐྱེད་པ་དང་། རྟེན་གྱི་སྟོབས་ཀྱིས་སྐྱབས་དེ་ངོས་ཟིན་པར་བྱེད།"
                      },
                      {
                        "related_node_id": "2.4.2.3",
                        "relationship_type": "རྨང་གཞི་འདིང་བ།",
                        "conceptual_bridge": "སྐྱབས་ཡུལ་དམ་པ་དེ་དག་གི་བཀའ་དང་དགོངས་པ་བཞིན་དུ་སྒྲུབ་པ་ནི། གཉེན་པོ་ཀུན་ཏུ་སྤྱོད་པའི་སྟོབས་ཀྱི་ཉམས་ལེན་དངོས་ཡིན།"
                      }
                    ],
                    "implicit_concepts": [
                      "བྱིན་རླབས་ཀྱི་ནུས་པ།",
                      "གསོལ་བ་འདེབས་པའི་གལ་ཆེའི་རང་བཞིན།",
                      "ཡི་དམ་ལྷ།"
                    ],
                    "pedagogical_strategy": "དང་པོ་སྐྱབས་ཡུལ་སྤྱི་སྟེ་དཀོན་མཆོག་གསུམ་བསྟན། དེ་ནས་བྱེ་བྲག་བྱང་ཆུབ་སེམས་དཔའ་རེ་རེའི་མཚན་ནས་བོས་ཏེ་གསོལ་བ་འདེབས་པའི་ཐབས་བསྟན་པས། ཉམས་ལེན་པ་དང་སྐྱབས་ཡུལ་བར་གྱི་འབྲེལ་བ་དེ་བས་ཀྱང་ཐག་ཉེ་རུ་དང་དམིགས་བསལ་ཅན་དུ་བསྒྱུར།",
                    "intended_impact_on_reader": "རང་ཉིད་ཉམ་ཐག་ཅིང་མགོན་མེད་དུ་མི་ཚོར་བར། ཐུགས་རྗེ་དང་ནུས་པ་ཚད་མེད་པ་དང་ལྡན་པའི་སྐྱབས་གནས་རྣམས་ཀྱིས་རྟག་ཏུ་གཟིགས་ཀྱིན་ཡོད་པའི་གདེང་ཚོད་བསྐྱེད་དེ། བཤགས་སྡོམ་གྱི་ཉམས་ལེན་ལ་སྤོབས་པ་ཆེན་པོས་འཇུག་པར་བྱ་རྒྱུ།",
                    "audience_assumptions": "ཀློག་པ་པོ་འཇིགས་སྐྲག་དང་ཡི་མུག་གི་སེམས་ཀྱིས་ནོན་ཡོད་སྲིད་པས། དེ་ལ་སྐྱབས་དང་བློ་གཏད་སའི་ཡུལ་དམ་པ་ཞིག་ངོ་སྤྲོད་བྱེད་དགོས་པར་ཆ་འཇོག་བྱེད།"
                  }
                },
                {
                  "level": "subsubsection",
                  "number": "2.4.2.3",
                  "title": "The strength of the remedial practice",
                  "verses_span": "54-64",
                  "summary": {
                    "content_summary": "ས་བཅད་འདིས་སྟོབས་བཞིའི་གསུམ་པ་སྟེ་གཉེན་པོ་ཀུན་ཏུ་སྤྱོད་པའི་སྟོབས་སྟོན། དེ་ཡང་སྡིག་པ་སྦྱོང་བའི་གཉེན་པོ་ནི་དགེ་བའི་བྱ་བ་ལ་འབད་པ་དེ་ཡིན། འདིར་ཉོན་མོངས་ནི་ནད་དང་འདྲ་ལ། སངས་རྒྱས་ནི་སྨན་པ་དང་ཆོས་ནི་སྨན་ལྟ་བུ་ཡིན་པས། སངས་རྒྱས་ཀྱི་བཀའ་བཞིན་བསྒྲུབ་དགོས་པར་བཤད། ལྷག་པར་དུ་ཚེ་འདི་སྐད་ཅིག་ཀྱང་མི་སྡོད་པར་འགོད་འགྲོ་བ་དང་། འཆི་བ་གདོན་མི་ཟ་བར་འབྱུང་བ། ལོངས་སྤྱོད་ལ་སྙིང་པོ་མེད་པ་སོགས་བསམས་ནས། ཉིན་མཚན་ཀུན་ཏུ་མི་དགེ་བ་ལས་ཇི་ལྟར་ཐར་བར་བསམ་དགོས་པ་དང་། སྡིག་པ་ཕྲ་མོ་ཡན་ཆད་ཀྱང་མགོན་པོའི་སྤྱན་སྔར་བཤགས་དགོས་པར་གདམས།",
                    "key_concepts": [
                      "གཉེན་པོ་ཀུན་ཏུ་སྤྱོད་པའི་སྟོབས།",
                      "དགེ་བའི་བྱ་བ།",
                      "ཉོན་མོངས་པའི་ནད།",
                      "མི་རྟག་པ།",
                      "ལོངས་སྤྱོད་ལ་སྙིང་པོ་མེད་པ།"
                    ],
                    "transformative_goal": "སྡིག་པའི་བྱ་བ་ལ་སུན་སྣང་སྐྱེས་པ་ཙམ་མ་ཡིན་པར། དེའི་གཉེན་པོ་སྟེ་དགེ་བའི་བྱ་བ་ལ་དངོས་སུ་འཇུག་པའི་བློ་བསྐྱེད་དེ། མི་ཚེ་དོན་དང་ལྡན་པ་ཞིག་སྐྱེལ་བའི་ལམ་དུ་གཞོལ་རྒྱུ།",
                    "function_in_hierarchy": "འགྱོད་པ་དང་རྟེན་ལ་བརྟེན་ནས་བཤགས་པའི་བསམ་པ་བསྐྱེད་རྗེས། ད་ནི་དངོས་སུ་སྡིག་པ་སྦྱོང་བྱེད་ཀྱི་བྱ་བ་དངོས་ལ་འཇུག་ཚུལ་སྟོན། འདིས་བཤགས་པ་དེ་བསམ་པ་ཙམ་མ་ཡིན་པར་བྱ་བ་དང་སྦྲེལ་དགོས་པ་གསལ་སྟོན་བྱེད།",
                    "inter_node_relationships": [
                      {
                        "related_node_id": "2.4.2.2",
                        "relationship_type": "བྱ་བ་དངོས།",
                        "conceptual_bridge": "རྟེན་གྱི་སྟོབས་ཀྱིས་སྐྱབས་ཡུལ་ངོས་ཟིན་རྗེས། དེ་དག་གི་དགོངས་པ་དང་མཐུན་པའི་དགེ་བའི་བྱ་བ་ལ་བརྩོན་པ་ནི་གཉེན་པོ་ཀུན་ཏུ་སྤྱོད་པའི་སྟོབས་ཀྱི་ཉམས་ལེན་ཡིན།"
                      },
                      {
                        "related_node_id": "2.4.2.4",
                        "relationship_type": "རྨང་གཞི་འདིང་བ།",
                        "conceptual_bridge": "དགེ་བའི་ལམ་ལ་གཞོལ་ཞིང་སྡིག་པའི་ཉེས་དམིགས་ཤེས་པའི་རྨང་གཞིའི་སྟེང་དུ། ཕྱིན་ཆད་སྡིག་པ་ལས་སླར་ལྡོག་པའི་དམ་བཅའ་བརྟན་པོ་བཞག་ཐུབ།"
                      }
                    ],
                    "implicit_concepts": [
                      "བརྩོན་འགྲུས་ཀྱི་གལ་ཆེའི་རང་བཞིན།",
                      "ཤེས་པ་དང་ལག་ལེན་གྱི་ཟུང་འབྲེལ།",
                      "དུས་ཚོད་དམ་འཛིན།"
                    ],
                    "pedagogical_strategy": "དཔེ་དང་རྒྱུ་མཚན་གྱི་སྒོ་ནས་གདམས། ནད་པས་སྨན་པའི་ངག་བཞིན་བྱེད་དགོས་པའི་དཔེས་ཆོས་ཉམས་ལེན་བྱེད་དགོས་པ་བསྟན། མི་རྟག་པ་དང་སྙིང་པོ་མེད་ཚུལ་ཡང་ཡང་བསྐྱར་ནས་དགེ་བ་ལ་བརྩོན་པའི་བྲེལ་བ་བསྐྱེད།",
                    "intended_impact_on_reader": "སྡིག་པ་བཤགས་པ་ནི་འགྱོད་པ་བྱེད་པ་ཙམ་གྱིས་མི་ཆོག་པར། དེའི་གཉེན་པོ་དགེ་བའི་བྱ་བ་ལ་འབད་དགོས་པའི་ངེས་ཤེས་བསྐྱེད་དེ། རང་གི་མི་ཚེ་དེ་དགེ་སྦྱོར་གྱི་ངང་དུ་སྐྱེལ་བའི་ཆོད་སེམས་འདྲོངས་རྒྱུ།",
                    "audience_assumptions": "ཀློག་པ་པོ་ལ་བཤགས་པའི་བསམ་པ་ཡོད་ཀྱང་། དེ་དང་ཆབས་ཅིག་ཏུ་དགེ་བའི་བྱ་བ་གང་ལ་འབད་དགོས་པའི་ལམ་སྟོན་གསལ་བོ་དགོས་པར་ཆ་འཇོག་བྱེད།"
                  }
                },
                {
                  "level": "subsubsection",
                  "number": "2.4.2.4",
                  "title": "The strength of amendment",
                  "verses_span": "65-65",
                  "summary": {
                    "content_summary": "ས་བཅད་འདིས་སྟོབས་བཞིའི་མཐའ་མ་སྟེ་ཉེས་པ་ལས་སླར་ལྡོག་པའི་སྟོབས་སྟོན། འདི་ནི་སྔར་བྱས་ཀྱི་སྡིག་པ་དང་ནོངས་པ་རྣམས་འདྲེན་པ་རྣམས་ཀྱིས་ནོངས་པར་གཟུང་བར་གསོལ་བ་དང་། བྱ་བ་འདི་དག་བཟང་པོ་མ་ཡིན་པ་ཤེས་ནས། ད་ནས་བཟུང་སླན་ཆད་སྲོག་ལ་བབས་ཀྱང་ཡོང་མི་བྱེད་དོ་ཞེས་སྙིང་ཐག་པ་ནས་དམ་བཅའ་འབུལ་བ་དེ་ཡིན། འདི་ནི་བཤགས་པའི་ཉམས་ལེན་གྱི་རྩེ་མོར་གྱུར་པ་དང་། སྡིག་པའི་རྒྱུན་གཅོད་པའི་ཐབས་མཆོག་ཡིན།",
                    "key_concepts": [
                      "ཉེས་པ་ལས་སླར་ལྡོག་པའི་སྟོབས།",
                      "དམ་བཅའ།",
                      "སྡོམ་སེམས།",
                      "སླན་ཆད་མི་བགྱིད་པ།"
                    ],
                    "transformative_goal": "སྡིག་པའི་བག་ཆགས་ཀྱི་དབང་དུ་མི་འགྲོ་བར། དྲན་ཤེས་བག་ཡོད་ཀྱི་སྒོ་ནས་རང་གི་སེམས་རྒྱུད་བསྲུངས་ཏེ། སྡིག་པའི་རྒྱུ་དང་རྐྱེན་དང་འཕྲད་ཀྱང་དེ་ལ་མི་འཇུག་པའི་བློ་སྟོབས་བརྟན་པོ་བསྐྱེད་རྒྱུ།",
                    "function_in_hierarchy": "སྡིག་བཤགས་ཀྱི་རིམ་པ་ཡོངས་རྫོགས་ཀྱི་མཇུག་བསྡུ་བ་དང་དེའི་འབྲས་བུ་མཐར་ཐུག་དེ་སྟོན། འདིས་བཤགས་པ་དེ་དུས་སྐབས་ཤིག་གི་བྱ་བ་ཙམ་མ་ཡིན་པར། མ་འོངས་པའི་མི་ཚེ་ཡོངས་ཀྱི་སྤྱོད་ཚུལ་ལ་འགྱུར་བ་གཏོང་བའི་དམ་བཅའ་ཞིག་ཏུ་བསྒྱུར།",
                    "inter_node_relationships": [
                      {
                        "related_node_id": "2.4.2.3",
                        "relationship_type": "མཐར་སྐྱེལ་བ།",
                        "conceptual_bridge": "གཉེན་པོའི་སྟོབས་ཀྱིས་དགེ་སྡིག་གི་ཁྱད་པར་ཤེས་ཤིང་དགེ་བ་ལ་གཞོལ་བས། ད་ནི་སྡིག་པའི་ལམ་དུ་ཕྱིར་མི་ལྡོག་པའི་དམ་བཅའ་བརྟན་པོ་འཇོག་ཐུབ།"
                      }
                    ],
                    "implicit_concepts": [
                      "རང་དབང་དང་འདམ་ཀ",
                      "ཆོད་སེམས་ཀྱི་ནུས་པ།",
                      "བག་ཡོད་བསྟེན་པ།"
                    ],
                    "pedagogical_strategy": "ཐད་ཀར་གྱི་དམ་བཅའི་ཚིག་གི་སྒོ་ནས་གདམས། \"ནོངས་པ་ལགས་པར་གཟུང་དུ་གསོལ།\" ཞེས་པས་གུས་པ་དང་། \"སླན་ཆད་བདག་ནི་ཡོང་མི་བགྱིད།\" ཅེས་པས་ཆོད་སེམས་བརྟན་པོ་མཚོན།",
                    "intended_impact_on_reader": "སྡིག་པ་བཤགས་པ་ནི་འགྱོད་པ་བྱས་པ་ཙམ་གྱིས་མི་ཆོག་པར། མ་འོངས་པར་སྡིག་པ་མི་བྱེད་པའི་དམ་བཅའ་བརྟན་པོ་ཞིག་མེད་ན་དོན་སྙིང་ཆུང་བར་ངོས་ཟིན་ཏེ། སྡོམ་སེམས་བསྐྱེད་དེ་རང་རྒྱུད་ཚུལ་བཞིན་བསྲུང་བར་སྐུལ་མ་ཐེབས་རྒྱུ།",
                    "audience_assumptions": "ཀློག་པ་པོས་སྟོབས་གསུམ་གྱི་ཉམས་ལེན་ཤེས་ཟིན་པས། ད་ནི་བཤགས་པའི་ཉམས་ལེན་དེ་མི་ཚེ་གང་བོའི་སྡོམ་པ་ཞིག་ཏུ་ཇི་ལྟར་བསྒྱུར་དགོས་པའི་ལམ་སྟོན་ལ་སྒུག་ཡོད་པར་ཆ་འཇོག་བྱེད།"
                  }
                }
              ]
            }
          ]
        }
      ]
    }
  ]