{
    "processing_notes": "འདི་ནི་བརྩོན་འགྲུས་ལེའུའི་རྩ་བའི་གཞུང་དང་འགྲེལ་པ་ལ་གཞི་བཅོལ་ནས་རིམ་པའི་དབྱེ་ཞིབ་བྱས་པ་ཞིག་ཡིན། དབྱེ་ཞིབ་འདི་རིམ་པ་འོག་མ་ནས་གོང་མ་བར་བྱས་ཡོད་ཅིང་། སྡེ་ཚན་རེ་རེའི་སጠቃནང་དོན་དང་། གནད་འགག་གི་བརྡ་ཆད། ནང་དོན་གྱི་འབྲེལ་བ་སོགས་བཀོད་ཡོད། འགྲེལ་པ་དང་རྩ་བའི་ཚིག་དབར་གྱི་འབྲེལ་བ་གསལ་པོར་ངོས་འཛིན་ཐུབ་མེད་པའི་སྐབས་འགར་དབྱེ་ཞིབ་འདི་གཙོ་བོར་རྩ་བའི་གཞུང་གི་ནང་དོན་ལ་བརྟེན་ཡོད།",
    "nodes": [
      {
        "level": "chapter-7",
        "title": "བརྩོན་འགྲུས་ཀྱི་ལེའུ། (Chapter on Diligence)",
        "verses_span": "1-78",
        "summary": {
          "content_summary": "ལེའུ་འདིས་བྱང་ཆུབ་ཀྱི་སེམས་རྒྱུད་ལ་སྐྱེས་པ་མི་ཉམས་ཤིང་གོང་ནས་གོང་དུ་སྤེལ་བའི་ཐབས་གཙོ་བོ་བརྩོན་འགྲུས་ཉམས་སུ་ལེན་ཚུལ་རྒྱ་ཆེར་བསྟན་ཡོད། དང་པོར་བརྩོན་འགྲུས་ཀྱི་ངོ་བོ་དང་དེའི་མི་མཐུན་ཕྱོགས་ལེ་ལོ་རྣམ་གསུམ་ངོས་བཟུང་ནས་དེ་དག་སྤོང་བའི་ཐབས་དང་། གཉིས་པར་བརྩོན་འགྲུས་ཀྱི་མཐུན་ཕྱོགས་དཔུང་བཞི་དང་སྟོབས་གཉིས་ཇི་ལྟར་བསྐྱེད་ཚུལ་ཞིབ་ཏུ་བཀྲལ་ཡོད། མདོར་ན། ལེའུ་འདིས་གོ་ཆའི་བརྩོན་འགྲུས་ནས་འཇུག་པའི་བརྩོན་འགྲུས་བར་རིམ་པར་བསྐྱེད་དེ་བྱང་ཆུབ་སྒྲུབ་པའི་ལམ་ལ་འགོག་རྐྱེན་མེད་པར་བྱེད་པའི་ཐབས་ལམ་ཆ་ཚང་ཞིག་བསྟན་ཡོད།",
          "key_concepts": [
            "བརྩོན་འགྲུས།",
            "ལེ་ལོ། (སྙོམ་ལས། བྱ་བ་ངན་ཞེན། སྒྱིད་ལུགས།)",
            "མི་རྟག་པ་བསྒོམ་པ།",
            "བྱང་ཆུབ་ཀྱི་སེམས།",
            "དཔུང་བཞི། (མོས་པ། བརྟན་པ། དགའ་བ། དོར་བ།)",
            "སྟོབས་གཉིས། (ལྷུར་ལེན་པ། དབང་སྒྱུར་བ།)",
            "ང་རྒྱལ་གསུམ། (ལས་ཀྱི། ནུས་པའི། ཉོན་མོངས་པའི།)"
          ],
          "transformative_goal": "སྒྱིད་ལུག་དང་ལེ་ལོ་སྤངས་ནས་དགེ་བའི་བྱ་བ་ལ་སྤྲོ་བ་ཆེན་པོས་རྟག་ཏུ་བརྩོན་པའི་ནུས་པ་རྒྱུད་ལ་བསྐྱེད་དེ། བྱང་ཆུབ་སྒྲུབ་པའི་ལམ་ལ་བར་ཆད་མེད་པར་མཐར་ཕྱིན་པར་བྱེད་པ་དེ་ཡིན།",
          "function_in_hierarchy": "བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱི་དང་། ལྷག་པར་དུ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྗེས་སུ་འབྲེལ་བའི་ཡན་ལག་གལ་ཆེན་ཞིག་ཡིན། འདིས་བསམ་གཏན་དང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྒྲུབ་པའི་ནུས་པ་དང་སྤྲོ་བ་བསྐྱེད་པའི་རྨང་གཞི་འདིང་གི་ཡོད།",
          "inter_node_relationships": [
            {
              "related_node_id": "chapter-6 (བཟོད་པའི་ལེའུ།)",
              "relationship_type": "builds_on",
              "conceptual_bridge": "དཀའ་སྤྱད་ལ་བཟོད་པ་བསྒོམས་པའི་སྟོབས་ལས་བྱང་ཆུབ་སྒྲུབ་པའི་ལས་ལ་བརྩོན་པར་འཇུག་ནུས་པས། བཟོད་པ་ནི་བརྩོན་འགྲུས་ཀྱི་སྔོན་འགྲོའི་ཆ་རྐྱེན་ལྟ་བུ་ཡིན།"
            },
            {
              "related_node_id": "chapter-8 (བསམ་གཏན་གྱི་ལེའུ།)",
              "relationship_type": "provides_foundation_for",
              "conceptual_bridge": "བརྩོན་འགྲུས་ཀྱིས་སེམས་དགེ་བའི་དམིགས་པ་ལ་གཏོད་པའི་སྤྲོ་བ་དང་ནུས་པ་བསྐྱེད་པ་དེས། སེམས་རྩེ་གཅིག་ཏུ་གནས་པའི་བསམ་གཏན་བསྒྲུབ་པའི་ཆ་རྐྱེན་གཙོ་བོ་གྲུབ་པར་བྱེད།"
            }
          ],
          "implicit_concepts": [
            "རྒྱུ་འབྲས་ཀྱི་རྣམ་བཞག",
            "རང་གཅུན་ནུས་པ།",
            "དམིགས་ཡུལ་གསལ་པོ་ཡོད་པའི་གལ་ཆེན་རང་བཞིན།",
            "རིམ་གྱིས་སློབ་པའི་ཐབས་ལམ།"
          ],
          "pedagogical_strategy": "དང་པོ་མི་མཐུན་ཕྱོགས་ངོས་བཟུང་ནས་དེའི་ཉེས་དམིགས་བསྟན། དེ་ནས་གཉེན་པོའི་ཕན་ཡོན་དང་བསྒྲུབ་ཚུལ་རིམ་པར་བཀྲལ་བའི་སྒོ་ནས། རྒྱུ་མཚན་དང་། དཔེ། སྐུལ་མ་བཅས་སྣ་ཚོགས་སྤྱད་དེ་སློབ་མ་རིམ་གྱིས་འཁྲིད་པའི་ཐབས་ལམ་སྤྱོད་ཡོད།",
          "intended_impact_on_reader": "ལེ་ལོ་དང་སྒྱིད་ལུག་གི་ཉེས་དམིགས་ལ་བསམ་ནས་དགེ་སྒྲུབ་ལ་བརྩོན་པའི་གོ་ཆ་གསར་དུ་བགོ་བའམ་ཡོད་པ་གོང་སྤེལ་བྱེད་པའི་སྤྲོ་བ་དང་ཆོད་སེམས་དྲག་པོ་བསྐྱེད་པ།",
          "audience_assumptions": "ཀློག་པ་པོས་ལས་རྒྱུ་འབྲས་དང་། འཁོར་བའི་སྡུག་བསྔལ། ཐར་པ་དང་ཐམས་ཅད་མཁྱེན་པའི་གོ་འཕང་སོགས་ནང་ཆོས་ཀྱི་གཞི་རྩའི་ལྟ་གྲུབ་ལ་རྒྱུས་མངའ་ཡོད་པར་ཆ་འཇོག་བྱས་ཡོད།"
        },
        "children": [
          {
            "level": "section-7.1",
            "title": "བརྩོན་འགྲུས་རྩོམ་དགོས་པའི་རྒྱུ་མཚན་མདོར་བསྟན་པ། (A Brief Explanation of the Reason for Applying Diligence)",
            "verses_span": "1-1",
            "summary": {
              "content_summary": "སྡེ་ཚན་འདིས་བརྩོན་འགྲུས་ནི་བཟོད་པའི་རྗེས་སུ་བསྒྲུབ་དགོས་པ་དང་། བྱང་ཆུབ་ཀྱི་གོ་འཕང་ནི་བརྩོན་འགྲུས་ལ་བརྟེན་ནས་འཐོབ་དགོས་པ་གསལ་སྟོན་བྱེད། བརྩོན་འགྲུས་མེད་ན་དགེ་བའི་ཚོགས་གང་ཡང་འབྱུང་མི་ཐུབ་པ་དེ་རླུང་མེད་ན་དངོས་པོ་གཡོ་སྐྱོད་མི་བྱེད་པ་དང་དཔེ་སྦྱར་ནས་བསྟན་ཡོད།",
              "key_concepts": [
                "བརྩོན་འགྲུས།",
                "བཟོད་པ།",
                "བྱང་ཆུབ།",
                "བསོད་ནམས།"
              ],
              "transformative_goal": "བརྩོན་འགྲུས་ནི་བྱང་ཆུབ་སྒྲུབ་པའི་ལམ་གྱི་སྲོག་ཤིང་ལྟ་བུ་ཡིན་པར་ངེས་ཤེས་བསྐྱེད་དེ་དེ་ལ་འཇུག་པའི་འདུན་པ་བསྐྱེད་པ།",
              "function_in_hierarchy": "ལེའུ་ཧྲིལ་པོའི་གླེང་གཞི་སློང་བའི་སྡེ་ཚན་ཡིན། འདིས་བརྩོན་འགྲུས་ཀྱི་གལ་ཆེའི་རང་བཞིན་དང་དགོས་པ་མདོར་བསྡུས་ནས་བསྟན་ཏེ། རྒྱས་པར་བཤད་པའི་སྡེ་ཚན་རྗེས་མ་དག་གི་རྨང་གཞི་འདིང་གི་ཡོད།",
              "inter_node_relationships": [
                {
                  "related_node_id": "section-7.2",
                  "relationship_type": "introduces",
                  "conceptual_bridge": "བརྩོན་འགྲུས་ཀྱི་དགོས་པ་དང་གལ་ཆེའི་རང་བཞིན་མདོར་བསྟན་པ་འདིས་ 'ཇི་ལྟར་བརྩོན་དགོས་' ཞེས་པའི་དྲི་བ་བསྐྱེད་དེ། དེའི་ལན་དུ་སྡེ་ཚན་རྗེས་མས་བརྩོན་ཚུལ་རྒྱས་པར་འཆད།"
                }
              ],
              "implicit_concepts": [
                "ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཀྱི་བར་གྱི་རྒྱུ་འབྲས་ཀྱི་འབྲེལ་བ།"
              ],
              "pedagogical_strategy": "དཔེ་དང་སྦྱར་ནས་གནད་དོན་གསལ་བཤད་བྱེད་པའི་ཐབས་ (རླུང་དང་གཡོ་བའི་དཔེ།) དང་། རྒྱུ་འབྲས་ཀྱི་རིགས་པ་སྤྱད་ནས་བརྩོན་འགྲུས་ཀྱི་དགོས་པ་ནན་བརྗོད་བྱེད་པ།",
              "intended_impact_on_reader": "བརྩོན་འགྲུས་ཀྱི་གལ་གནད་རྟོགས་ཤིང་། དེ་ཉམས་སུ་ལེན་པའི་ཐབས་ལ་ཤེས་འདོད་ཀྱི་བློ་བསྐྱེད་པ།",
              "audience_assumptions": "ཀློག་པ་པོས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་གོ་རིམ་དང་འབྲེལ་བ་ལ་རྒྱུས་གཞི་རྩའི་ཆ་ནས་ཡོད་པར་ཆ་འཇོག་བྱེད།"
            },
            "children": []
          },
          {
            "level": "section-7.2",
            "title": "ཇི་ལྟར་བརྩོན་ཚུལ་རྒྱས་པར་བཤད་པ། (A Detailed Explanation of How to Apply Diligence)",
            "verses_span": "2-78",
            "summary": {
              "content_summary": "སྡེ་ཚན་འདིས་བརྩོན་འགྲུས་ཇི་ལྟར་ཉམས་ལེན་བྱེད་ཚུལ་ཞིབ་ཕྲ་བསྟན་ཡོད། འདི་ནང་དང་པོ་བརྩོན་འགྲུས་ཀྱི་ངོ་བོ་ངོས་བཟུང་། དེ་ནས་དེའི་མི་མཐུན་ཕྱོགས་ལེ་ལོ་རྣམ་གསུམ་གྱི་ཉེས་དམིགས་དང་དེ་དག་སྤོང་བའི་གཉེན་པོ་རིམ་པར་བསྟན། མཐར་བརྩོན་འགྲུས་སྐྱེད་པའི་མཐུན་རྐྱེན་དཔུང་བཞི་དང་སྟོབས་གཉིས་བསྐྱེད་ཚུལ་དཔེ་དང་རྒྱུ་མཚན་དང་བཅས་ཏེ་རྒྱས་པར་བཀྲལ་ནས་བརྩོན་འགྲུས་ཉམས་ལེན་གྱི་ལམ་བུ་ཆ་ཚང་ཞིག་གསལ་སྟོན་བྱས་ཡོད།",
              "key_concepts": [
                "བརྩོན་འགྲུས་ཀྱི་ངོ་བོ།",
                "མི་མཐུན་ཕྱོགས་སྤོང་བ། (ལེ་ལོ།)",
                "མཐུན་ཕྱོགས་བསྒྲུབ་པ། (དཔུང་བཞི། སྟོབས་གཉིས།)"
              ],
              "transformative_goal": "བརྩོན་འགྲུས་ཀྱི་གེགས་སེལ་ཞིང་མཐུན་རྐྱེན་སྒྲུབ་པའི་ཐབས་ལམ་ཆ་ཚང་ཞིག་ཤེས་པར་བྱས་ཏེ། ཉམས་ལེན་དངོས་ལ་བརྟན་པོར་འཇུག་པའི་ནུས་པ་བསྐྱེད་པ།",
              "function_in_hierarchy": "འདི་ནི་ལེའུ་ཡི་གཞུང་དངོས་གཞི་ཡིན་ལ། སྡེ་ཚན་སྔོན་མས་བསྟན་པའི་བརྩོན་འགྲུས་ཀྱི་དགོས་པ་དེ་ཉིད་ལག་ལེན་དུ་ཇི་ལྟར་འདེབས་པའི་ཐབས་ལམ་ཞིབ་ཕྲ་བཀོད་ཡོད། དེ་ཡང་ནང་གསེས་ཀྱི་སྡེ་ཚན་གསུམ་ལ་བརྟེན་ནས་བརྩོན་འགྲུས་ཉམས་ལེན་གྱི་གོ་རིམ་གསལ་པོར་བྱས་ཡོད།",
              "inter_node_relationships": [
                {
                  "related_node_id": "section-7.1",
                  "relationship_type": "elaborates_on",
                  "conceptual_bridge": "སྡེ་ཚན་སྔོན་མས་བརྩོན་འགྲུས་རྩོམ་དགོས་ཞེས་མདོར་བསྟན་པ་དེ་ཉིད། སྡེ་ཚན་འདིས་ 'ཇི་ལྟར་རྩོམ་དགོས་' ཞེས་པའི་ཐབས་ལམ་རྒྱས་པར་བཤད་དེ་ཞིབ་འགྲེལ་བྱེད་ཀྱི་ཡོད།"
                }
              ],
              "implicit_concepts": [
                "རང་རྒྱུད་དབྱེ་ཞིབ་བྱེད་པའི་གལ་ཆེའི་རང་བཞིན།",
                "ཐབས་དང་ཤེས་རབ་ཟུང་འབྲེལ།",
                "ཉམས་ལེན་གྱི་གོ་རིམ་གསལ་པོ།"
              ],
              "pedagogical_strategy": "རྣམ་བཞག་གསུམ་གྱི་སྒོ་ནས་དབྱེ་བ་ཕྱེ་སྟེ་བཤད་པ། (ངོ་བོ། མི་མཐུན་ཕྱོགས་སྤོང་བ། མཐུན་ཕྱོགས་སྒྲུབ་པ།) འདིས་ནང་དོན་གྱི་གོ་རིམ་གསལ་ཞིང་ཆགས་པར་བྱས་ཡོད།",
              "intended_impact_on_reader": "བརྩོན་འགྲུས་ཉམས་ལེན་གྱི་ལམ་སྟོན་གསལ་པོ་ཞིག་ཐོབ་སྟེ། རང་གི་རྒྱུད་ཀྱི་ལེ་ལོ་ངོས་ཟིན་པ་དང་དེ་སྤོང་བའི་ཐབས་ཤེས་པར་བྱེད་པ།",
              "audience_assumptions": "ཀློག་པ་པོས་བརྩོན་འགྲུས་རྩོམ་པར་འདོད་པའི་ཀུན་སློང་ཡོད་པ་དང་། དེ་ཉམས་སུ་ལེན་པའི་ཐབས་ལམ་ཞིབ་ཕྲ་ལ་དོ་སྣང་བྱེད་པར་ཆ་འཇོག་བྱེད།"
            },
            "children": [
              {
                "level": "subsection-7.2.1",
                "title": "བརྩོན་འགྲུས་ཀྱི་ངོ་བོ་ངོས་བཟུང་བ། (Identifying the Nature of Diligence)",
                "verses_span": "2-2",
                "summary": {
                  "content_summary": "སྡེ་ཚན་འདིས་བརྩོན་འགྲུས་ཀྱི་མཚན་ཉིད་ངོས་བཟུང་ཡོད། བརྩོན་འགྲུས་ཟེར་བ་ནི་དགེ་བའི་ཕྱོགས་ལ་སེམས་སྤྲོ་ཞིང་དགའ་བའི་ཡིད་ཀྱི་བྱེད་པ་ཞིག་ལ་གོ་དགོས་པ་ལས་ལུས་ངག་གི་བྱ་བ་ཙམ་ལ་མི་གོ།",
                  "key_concepts": [
                    "བརྩོན་འགྲུས་ཀྱི་ངོ་བོ།",
                    "དགེ་བ་ལ་སྤྲོ་བ།"
                  ],
                  "transformative_goal": "བརྩོན་འགྲུས་ཀྱི་ངོ་བོ་ངོ་མ་དེ་གོ་ནས་ནང་སེམས་ཀྱི་སྤྲོ་བ་བསྐྱེད་རྒྱུ་གཙོ་བོ་ཡིན་པ་རྟོགས་པར་བྱེད་པ།",
                  "function_in_hierarchy": "ཇི་ལྟར་བརྩོན་ཚུལ་བཤད་པའི་ནང་གི་ནང་གསེས་དང་པོ་ཡིན། འདིས་བརྩོན་འགྲུས་ཞེས་པའི་ཐ་སྙད་ཀྱི་གོ་དོན་གསལ་བཤད་བྱས་ཏེ་རྗེས་ཀྱི་དོན་རྣམས་རྟོགས་པའི་རྨང་གཞི་འདིང་།",
                  "inter_node_relationships": [
                    {
                      "related_node_id": "subsection-7.2.2",
                      "relationship_type": "provides_basis_for_contrast",
                      "conceptual_bridge": "བརྩོན་འགྲུས་ནི་དགེ་བ་ལ་སྤྲོ་བ་ཡིན་པར་ངོས་བཟུང་བས། དེ་དང་ཐད་ཀར་འགལ་བའི་མི་མཐུན་ཕྱོགས་ 'ལེ་ལོ་' ངོས་འཛིན་རྒྱུ་དང་སྤོང་རྒྱུ་དེ་རིགས་པས་གྲུབ་པར་བྱེད།"
                    }
                  ],
                  "implicit_concepts": [
                    "སེམས་ཀྱི་བྱེད་པ་གཙོ་ཆེ་བའི་རང་བཞིན།",
                    "ནང་ཆོས་ཀྱི་ཐ་སྙད་ལ་མཚན་ཉིད་གསལ་པོ་ཡོད་པ།"
                  ],
                  "pedagogical_strategy": "མཚན་ཉིད་བརྗོད་པའི་ཐབས། ཐ་སྙད་ཀྱི་གོ་དོན་ཐད་ཀར་ངོས་འཛིན་བྱེད་པ་དེ་ཡིན།",
                  "intended_impact_on_reader": "བརྩོན་འགྲུས་ནི་ལུས་ཀྱི་ངལ་རྩོལ་ཙམ་མ་ཡིན་པར་ནང་སེམས་ཀྱི་དགའ་སྤྲོ་ཞིག་ཡིན་པ་གསལ་པོར་ཤེས་པ།",
                  "audience_assumptions": "ཀློག་པ་པོས་ 'བརྩོན་འགྲུས་' ཞེས་པའི་ཐ་སྙད་ལ་གོ་བ་ལོག་པའམ་མ་གསལ་བ་ཡོད་སྲིད་པར་བསམས་ནས་གསལ་བཤད་བྱས་ཡོད།"
                },
                "children": []
              },
              {
                "level": "subsection-7.2.2",
                "title": "མི་མཐུན་པའི་ཕྱོགས་སྤོང་བ། (Abandoning the Opposing Factors)",
                "verses_span": "3-32",
                "summary": {
                  "content_summary": "སྡེ་ཚན་འདིས་བརྩོན་འགྲུས་ཀྱི་མི་མཐུན་ཕྱོགས་གཙོ་བོ་ལེ་ལོ་རྣམ་གསུམ་སྟེ། སྙོམ་ལས་ཀྱི་ལེ་ལོ། བྱ་བ་ངན་ཞེན་གྱི་ལེ་ལོ། སྒྱིད་ལུགས་བདག་ཉིད་བརྙས་པའི་ལེ་ལོ་བཅས་ངོས་བཟུང་ཞིང་། དེ་དག་རེ་རེའི་རྒྱུ་དང་ངོ་བོ། དེ་སྤོང་བའི་གཉེན་པོའི་ཐབས་ལམ་བཅས་རྒྱས་པར་བསྟན་ཡོད། ལྷག་པར་དུ་མི་རྟག་པ་དང་། ངན་སོང་གི་སྡུག་བསྔལ། དལ་འབྱོར་རྙེད་དཀའ་བ་བསྒོམས་ནས་ལེ་ལོ་སྤོང་དགོས་པར་ནན་བརྗོད་བྱས་ཡོད།",
                  "key_concepts": [
                    "ལེ་ལོ་རྣམ་གསུམ།",
                    "སྙོམ་ལས།",
                    "བྱ་བ་ངན་ཞེན།",
                    "སྒྱིད་ལུགས།",
                    "གཉེན་པོ། (མི་རྟག་པ་བསྒོམ་པ། བྱང་ཆུབ་ཀྱི་ནུས་པ་ལ་ཡིད་ཆེས་པ།)"
                  ],
                  "transformative_goal": "རང་རྒྱུད་ཀྱི་ལེ་ལོའི་རིགས་མི་འདྲ་བ་དག་ངོས་ཟིན་ནས་དེ་དག་གི་གཉེན་པོ་བསྟེན་ཏེ་དགེ་བའི་བྱ་བ་ལ་འཇུག་པའི་བར་ཆད་ནང་ནས་སེལ་བ།",
                  "function_in_hierarchy": "འདི་ནི་བརྩོན་འགྲུས་བསྒྲུབ་པའི་གེགས་སེལ་བའི་སྐོར་ཡིན། བརྩོན་འགྲུས་ཀྱི་ངོ་བོ་བསྟན་པའི་རྗེས་སུ་དེའི་འགལ་ཟླ་ངོས་བཟུང་ནས་སྤོང་ཐབས་བསྟན་པ་ནི། ནད་ངོས་བཟུང་ནས་སྨན་སྤྲོད་པ་དང་འདྲ་བར་ཉམས་ལེན་གྱི་གོ་རིམ་གསལ་པོ་ཞིག་སྟོན་གྱི་ཡོད།",
                  "inter_node_relationships": [
                    {
                      "related_node_id": "subsection-7.2.1",
                      "relationship_type": "contrasts_with",
                      "conceptual_bridge": "དགེ་བ་ལ་སྤྲོ་བ་སྟེ་བརྩོན་འགྲུས་དང་ཐད་ཀར་འགལ་བའི་དགེ་བ་ལ་མི་སྤྲོ་བའི་ལེ་ལོ་རིགས་གསུམ་བསྟན་ནས་གནད་དོན་གསལ་བར་བྱེད།"
                    },
                    {
                      "related_node_id": "subsection-7.2.3",
                      "relationship_type": "prepares_for",
                      "conceptual_bridge": "མི་མཐུན་པའི་ཕྱོགས་ལེ་ལོ་སྤངས་པ་ལས་མཐུན་ཕྱོགས་བརྩོན་འགྲུས་བསྒྲུབ་པའི་གཞི་རྩ་འགྲུབ་པས། སྡེ་ཚན་འདིས་རྗེས་མའི་མཐུན་ཕྱོགས་བསྒྲུབ་པའི་གཞི་བཏིང་ཡོད།"
                    }
                  ],
                  "implicit_concepts": [
                    "རང་གིས་རང་ལ་འགན་འཁུར་དགོས་པ།",
                    "སེམས་ཁམས་རིག་པའི་དབྱེ་ཞིབ།",
                    "གནས་སྐབས་ཀྱི་བདེ་བ་ལ་ཞེན་པའི་ཉེས་དམིགས།"
                  ],
                  "pedagogical_strategy": "དབྱེ་བ་ཕྱེ་ནས་བཤད་པ། གཉེན་པོ་དང་སྤང་བྱ་ཆ་སྒྲིག་ནས་བསྟན་པ། དཔེ་དང་འབྲས་བུ་བསྟན་ནས་སྐྲག་པ་དང་སྤྲོ་བ་བསྐྱེད་པའི་ཐབས་སྤྱོད་ཡོད།",
                  "intended_impact_on_reader": "རང་གི་ལེ་ལོའི་རང་བཞིན་ངོས་ཟིན་ནས་དེ་ལས་ཐར་འདོད་ཀྱི་བློ་སྐྱེ་བ་དང་། དེ་སྤོང་བའི་ཐབས་ལམ་དངོས་ལ་འཇུག་པའི་སྤོབས་པ་བསྐྱེད་པ།",
                  "audience_assumptions": "ཀློག་པ་པོའི་རྒྱུད་ལ་འདིར་བསྟན་པའི་ལེ་ལོའི་རིགས་གང་རུང་ཡོད་སྲིད་པ་དང་། དེ་དག་སྤོང་འདོད་ཡོད་པར་ཆ་འཇོག་བྱས་ཡོད།"
                },
                "children": [
                  {
                    "level": "subsubsection-7.2.2.1",
                    "title": "ལེ་ལོ་རྒྱུ་འབྲས་དང་བཅས་པ་ངོས་བཟུང་བ། (Identifying Laziness with its Causes and Effects)",
                    "verses_span": "3-4",
                    "summary": {
                      "content_summary": "སྡེ་ཚན་འདིས་བརྩོན་འགྲུས་ཀྱི་མི་མཐུན་ཕྱོགས་ལེ་ལོ་ལ་ནང་གསེས་ཀྱི་དབྱེ་བ་གསུམ་སྟེ། བྱ་བ་ངན་ལ་ཞེན་པའི་ལེ་ལོ། སྒྱིད་ལུགས་ནས་བདག་ཉིད་བརྙས་པའི་ལེ་ལོ། སྙོམ་ལས་ཀྱི་ལེ་ལོ་བཅས་ངོས་བཟུང་ཡོད། ལྷག་པར་དུ་སྙོམ་ལས་ཀྱི་ལེ་ལོའི་རྒྱུ་གཙོ་བོ་ནི་བདེ་བའི་རོ་མྱང་ལ་ཞེན་པ་དང་། གཉིད་ལ་སྲེད་པ། འཁོར་བའི་སྡུག་བསྔལ་ལ་མི་སྐྱོ་བ་བཅས་ལས་བྱུང་བར་བསྟན་ཡོད།",
                      "key_concepts": [
                        "ལེ་ལོ་རྣམ་གསུམ།",
                        "སྙོམ་ལས།",
                        "བྱ་བ་ངན་ཞེན།",
                        "སྒྱིད་ལུགས།",
                        "བདེ་བའི་རོ་མྱང་།"
                      ],
                      "transformative_goal": "རང་རྒྱུད་ཀྱི་ལེ་ལོའི་རིགས་དང་དེའི་རྒྱུ་རྐྱེན་ངོས་ཟིན་ནས་དེ་དག་སྤོང་བའི་གཞི་འཛུགས་པ།",
                      "function_in_hierarchy": "མི་མཐུན་ཕྱོགས་སྤོང་བའི་ས་བཅད་ཀྱི་ནང་ནས། དང་པོ་སྤང་བྱ་ལེ་ལོའི་རིགས་དང་རྒྱུ་ངོས་འཛིན་གསལ་པོ་བྱེད་པའི་སྡེ་ཚན་ཡིན། འདིས་རྗེས་སུ་དེ་དག་གི་གཉེན་པོ་བསྟན་པའི་གཞི་བཏིང་ཡོད།",
                      "inter_node_relationships": [
                        {
                          "related_node_id": "subsubsection-7.2.2.2",
                          "relationship_type": "identifies_problem_for",
                          "conceptual_bridge": "ལེ་ལོའི་རིགས་དང་རྒྱུ་ངོས་བཟུང་བ་འདིས་ 'དེ་དག་ཇི་ལྟར་སྤང་' ཞེས་པའི་དྲི་བ་བསྐྱེད་ལ། དེའི་གཉེན་པོ་བསྟན་པའི་སྡེ་ཚན་རྗེས་མས་དེའི་ལན་འདེབས་ཀྱི་ཡོད།"
                        }
                      ],
                      "implicit_concepts": [
                        "ཉོན་མོངས་ཀྱི་རྒྱུ་རྐྱེན་ནང་སེམས་ན་ཡོད་པ།",
                        "རྣམ་རྟོག་དང་སྲེད་པའི་ཉེས་དམིགས།"
                      ],
                      "pedagogical_strategy": "དབྱེ་བ་ཕྱེ་ནས་ངོས་འཛིན་བྱེད་པའི་ཐབས། ལེ་ལོ་ལ་ནང་གསེས་ཀྱི་དབྱེ་བ་ཕྱེ་ནས་དེ་དག་གི་རྒྱུ་བསྟན་པ།",
                      "intended_impact_on_reader": "རང་རྒྱུད་ཀྱི་ལེ་ལོ་དེ་རིགས་གང་གཏོགས་དང་དེའི་རྒྱུ་ཅི་ཡིན་དཔྱད་པའི་བློ་བསྐྱེད་པ།",
                      "audience_assumptions": "ཀློག་པ་པོས་ལེ་ལོ་ཞེས་པ་སྤྱི་ཙམ་ཤེས་ཀྱང་དེའི་ནང་གསེས་ཀྱི་དབྱེ་བ་དང་རྒྱུ་ལ་དེ་ཙམ་རྒྱུས་མངའ་མེད་པར་ཆ་འཇོག་བྱེད།"
                    },
                    "children": []
                  },
                  {
                    "level": "subsubsection-7.2.2.2",
                    "title": "དེ་ཇི་ལྟར་སྤོང་ཐབས་ཀྱི་གཉེན་པོ་བཤད་པ། (Explaining the Antidote of How to Abandon Laziness)",
                    "verses_span": "5-32",
                    "summary": {
                      "content_summary": "སྡེ་ཚན་འདིས་ལེ་ལོ་རྣམ་གསུམ་སྤོང་བའི་གཉེན་པོ་རིམ་བཞིན་བསྟན་ཡོད། དང་པོ་སྙོམ་ལས་ཀྱི་ལེ་ལོ་སྤོང་བའི་ཆེད་དུ་འཆི་བ་མི་རྟག་པ་དང་ངན་སོང་གི་སྡུག་བསྔལ་དྲག་ཏུ་བསྒོམ་དགོས་པར་དཔེ་མང་པོ་དང་སྦྱར་ནས་བསྟན། གཉིས་པ་བྱ་བ་ངན་ཞེན་གྱི་ལེ་ལོ་སྤོང་བའི་ཆེད་དུ་དམ་པའི་ཆོས་ཀྱི་ཕན་ཡོན་དང་འཇིག་རྟེན་གྱི་བྱ་བའི་ཉེས་དམིགས་བསམ་དགོས་པར་བསྟན། གསུམ་པ་སྒྱིད་ལུགས་བདག་བརྙས་ཀྱི་ལེ་ལོ་སྤོང་བའི་ཆེད་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་སངས་རྒྱས་ཀྱི་རིགས་ཡོད་པས་བརྩོན་ན་བྱང་ཆུབ་འཐོབ་པའི་ནུས་པ་ཡོད་པར་ཡིད་ཆེས་བསྐྱེད་དགོས་ཚུལ་རྒྱས་པར་བསྟན་ཡོད།",
                      "key_concepts": [
                        "འཆི་བ་མི་རྟག་པ།",
                        "ངན་སོང་གི་སྡུག་བསྔལ།",
                        "དལ་འབྱོར་རྙེད་དཀའ།",
                        "དམ་ཆོས་ཀྱི་ཕན་ཡོན།",
                        "སངས་རྒྱས་ཀྱི་རིགས།",
                        "བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ།"
                      ],
                      "transformative_goal": "ལེ་ལོའི་རིགས་སོ་སོའི་གཉེན་པོ་ཤེས་ནས་ཉམས་སུ་བླངས་ཏེ། ནང་སེམས་ཀྱི་སྒྱིད་ལུག་དང་ཆགས་ཞེན་སྤངས་ནས་དགེ་བའི་ལས་ལ་སྤྲོ་སེམས་དང་སྤོབས་པ་བསྐྱེད་པ།",
                      "function_in_hierarchy": "འདི་ནི་ལེ་ལོ་སྤོང་བའི་ལག་ལེན་དངོས་ཀྱི་ལམ་སྟོན་ཡིན། སྡེ་ཚན་སྔོན་མས་ངོས་བཟུང་བའི་དཀའ་ངལ་རྣམས་སེལ་བའི་ཐབས་ལམ་ཞིབ་ཕྲ་འདིར་བཀོད་ཡོད།",
                      "inter_node_relationships": [
                        {
                          "related_node_id": "subsubsection-7.2.2.1",
                          "relationship_type": "provides_solution_to",
                          "conceptual_bridge": "སྡེ་ཚན་འདིས་སྔར་ངོས་བཟུང་བའི་ལེ་ལོ་རྣམ་གསུམ་པོ་རེ་རེའི་གཉེན་པོ་བསྟན་ནས་དཀའ་ངལ་སེལ་བའི་ཐབས་ལམ་གསལ་སྟོན་བྱེད།"
                        }
                      ],
                      "implicit_concepts": [
                        "བསམ་བློའི་ནུས་པས་སེམས་ཁམས་བསྒྱུར་ཐུབ་པ།",
                        "ཡིད་ཆེས་དང་སྤོབས་པའི་གལ་ཆེའི་རང་བཞིན།",
                        "རིམ་གྱིས་ཉམས་ལེན་བྱེད་པའི་ཐབས་ལམ།"
                      ],
                      "pedagogical_strategy": "ནད་རྟགས་རེ་རེ་ལ་སྨན་རེ་རེ་སྦྱོར་བའི་ཐབས་ལམ་སྤྱོད་ཡོད། དཔེ་འཇོག་པ་དང་། རྒྱུ་མཚན་འགོད་པ། སྐུལ་མ་གཏོང་བ་བཅས་ཀྱི་ཐབས་མང་པོ་སྤྱད་ནས་དོན་གསལ་བར་བྱས་ཡོད།",
                      "intended_impact_on_reader": "འཆི་བ་མི་རྟག་པ་དྲན་ནས་དགེ་བ་ལ་བརྩོན་པའི་བསྐུལ་མ་ཐེབས་པ་དང་། རང་ཉིད་ལ་བྱང་ཆུབ་སྒྲུབ་པའི་ནུས་པ་ཡོད་པར་སྤོབས་པ་སྐྱེ་བ། ཆོས་མིན་གྱི་བྱ་བ་ལ་ཞེན་པ་ལོག་པ།",
                      "audience_assumptions": "ཀློག་པ་པོས་འཆི་བ་དང་། ངན་སོང་། སངས་རྒྱས་ཀྱི་རིགས་སོགས་ཀྱི་གོ་དོན་ལ་རྒྱུས་ཡོད་པ་དང་། དེ་དག་གི་ཐོག་ཏུ་བསམ་གཞིག་བྱེད་པར་འདོད་པ་ཡོད་པར་ཆ་འཇོག་བྱེད།"
                    },
                    "children": []
                  }
                ]
              },
              {
                "level": "subsection-7.2.3",
                "title": "མཐུན་ཕྱོགས་བསྒྲུབ་པ། (Accomplishing the Favorable Factors)",
                "verses_span": "33-78",
                "summary": {
                  "content_summary": "མི་མཐུན་ཕྱོགས་ལེ་ལོ་སྤངས་པའི་རྗེས་སུ། སྡེ་ཚན་འདིས་བརྩོན་འགྲུས་ཀྱི་མཐུན་ཕྱོགས་ཇི་ལྟར་བསྐྱེད་ཅིང་སྒྲུབ་པའི་ཚུལ་རྒྱས་པར་བཤད་ཡོད། དེ་ཡང་བརྩོན་འགྲུས་སྤེལ་བར་བྱེད་པའི་དཔུང་བཞི་སྟེ། མོས་པའི་དཔུང་། བརྟན་པའི་དཔུང་ངམ་ང་རྒྱལ། དགའ་བའི་དཔུང་། དོར་བའི་དཔུང་བཅས་དང་། སྟོབས་གཉིས་ཏེ་ལྷུར་ལེན་པ་དང་དབང་སྒྱུར་བའི་སྟོབས་བཅས་བསྐྱེད་ཚུལ་ཞིབ་ཏུ་བཀྲལ་ཡོད། འདིས་བརྩོན་འགྲུས་རྒྱུན་སྐྱོང་དང་གོང་སྤེལ་བྱེད་པའི་ཐབས་ལམ་ཆ་ཚང་ཞིག་མཁོ་སྤྲོད་བྱེད།",
                  "key_concepts": [
                    "དཔུང་བཞི།",
                    "མོས་པ།",
                    "ང་རྒྱལ། (བརྟན་པ།)",
                    "དགའ་བ།",
                    "དོར་བ།",
                    "སྟོབས་གཉིས།",
                    "ལྷུར་ལེན་པ། (བག་ཡོད། དྲན་པ།)",
                    "དབང་སྒྱུར་བ།"
                  ],
                  "transformative_goal": "བརྩོན་འགྲུས་སྐྱེད་པའི་ཐབས་ལམ་དངོས་ལ་འཇུག་ཅིང་། མོས་པ་ནས་དབང་སྒྱུར་བའི་བར་གྱི་ནུས་པ་རིམ་གྱིས་བསྐྱེད་དེ་བརྩོན་འགྲུས་དེ་ཉིད་རྒྱུན་བརྟན་ཞིང་ནུས་པ་ལྡན་པ་ཞིག་ཏུ་བསྒྱུར་བ།",
                  "function_in_hierarchy": "འདི་ནི་བརྩོན་འགྲུས་ཉམས་ལེན་གྱི་ཡང་རྩེ་ལྟ་བུ་སྟེ། གེགས་སེལ་བ་ཙམ་མ་ཡིན་པར་དགེ་བའི་ནུས་པ་གོང་སྤེལ་གཏོང་བའི་ཐབས་ལམ་བསྟན་པའི་སྐོར་ཡིན།",
                  "inter_node_relationships": [
                    {
                      "related_node_id": "subsection-7.2.2",
                      "relationship_type": "builds_upon",
                      "conceptual_bridge": "མི་མཐུན་ཕྱོགས་ལེ་ལོ་སྤངས་པའི་གཞི་དེའི་སྟེང་དུ། མཐུན་རྐྱེན་གྱི་དཔུང་དང་སྟོབས་རྣམས་བསགས་ནས་བརྩོན་འགྲུས་ཀྱི་ནུས་པ་གོང་མཐོར་གཏོང་བར་བྱེད།"
                    }
                  ],
                  "implicit_concepts": [
                    "དམག་དཔུང་གི་རྣམ་པའི་ཐབས་ལམ།",
                    "ནང་སེམས་ཀྱི་ནུས་པ་རིམ་བཞིན་སྦྱོང་བརྡར་བྱེད་པ།",
                    "ཐབས་མཁས་པའི་གལ་ཆེན་རང་བཞིན།"
                  ],
                  "pedagogical_strategy": "དཔུང་དང་སྟོབས་ཀྱི་དཔེ་སྤྱད་དེ་ནང་སེམས་ཀྱི་ཉམས་ལེན་གྱི་གོ་རིམ་གསལ་བཤད་བྱེད་པ། ནང་གསེས་དབྱེ་བ་མང་པོ་ཕྱེ་ནས་གནད་དོན་རེ་རེ་བཞིན་གསལ་བར་བྱེད་པ།",
                  "intended_impact_on_reader": "བརྩོན་འགྲུས་བསྐྱེད་པའི་ཐབས་ལམ་གྱི་རྣམ་གྲངས་མང་པོ་ཤེས་ནས་རང་གི་ཁམས་དང་མོས་པ་དང་བསྟུན་ནས་ཉམས་ལེན་བྱེད་པའི་སྤྲོ་བ་དང་གདེང་ཚོད་བསྐྱེད་པ།",
                  "audience_assumptions": "ཀློག་པ་པོས་ལེ་ལོ་སྤོང་བའི་རྨང་གཞིའི་སྟེང་། བརྩོན་འགྲུས་གོང་སྤེལ་གཏོང་བའི་ཐབས་ལམ་ཞིབ་ཕྲ་ལ་སློབ་འདོད་ཡོད་པར་ཆ་འཇོག་བྱེད།"
                },
                "children": [
                  {
                    "level": "subsubsection-7.2.3.1",
                    "title": "མདོར་བསྟན། (Brief Explanation)",
                    "verses_span": "33-34",
                    "summary": {
                      "content_summary": "སྡེ་ཚན་འདིས་མཐུན་ཕྱོགས་བསྒྲུབ་པའི་རྣམ་བཞག་སྤྱི་མདོར་བསྟན་ཡོད། དེ་ཡང་སེམས་ཅན་གྱི་དོན་སྒྲུབ་པའི་ཕྱིར་དུ་དཔུང་བཞི་སྟེ་མོས་པ་དང་། བརྟན་པ། དགའ་བ། དོར་བ་བཅས་བསགས་དགོས་པ་དང་། དེ་དག་ལ་བརྟེན་ནས་སྟོབས་གཉིས་ཏེ་ལྷུར་ལེན་པ་དང་དབང་བསྒྱུར་བའི་སྟོབས་ཀྱིས་བརྩོན་འགྲུས་སྤེལ་དགོས་པར་བསྟན་ཡོད།",
                      "key_concepts": [
                        "དཔུང་བཞི།",
                        "སྟོབས་གཉིས།",
                        "བརྩོན་འགྲུས་སྤེལ་བ།"
                      ],
                      "transformative_goal": "བརྩོན་འགྲུས་སྤེལ་བའི་ཐབས་ལམ་གྱི་སྤྱི་ཁོག་ཤེས་ཏེ་རྒྱས་པར་ཤེས་པའི་འདུན་པ་བསྐྱེད་པ།",
                      "function_in_hierarchy": "འདི་ནི་མཐུན་ཕྱོགས་བསྒྲུབ་པའི་སྡེ་ཚན་གྱི་ས་བཅད་ལྟ་བུ་ཡིན། འདིས་རྗེས་སུ་རྒྱས་པར་བཤད་རྒྱུའི་དཔུང་བཞི་དང་སྟོབས་གཉིས་ཀྱི་རྣམ་གྲངས་ངོ་སྤྲོད་བྱེད།",
                      "inter_node_relationships": [
                        {
                          "related_node_id": "subsubsection-7.2.3.2",
                          "relationship_type": "summarizes_and_introduces",
                          "conceptual_bridge": "སྡེ་ཚན་འདིས་དཔུང་བཞི་དང་སྟོབས་གཉིས་ཞེས་མདོར་བསྟན་པ་དེ་ཉིད། སྡེ་ཚན་རྗེས་མས་རེ་རེ་བཞིན་རྒྱས་པར་འགྲེལ་བཤད་བྱེད།"
                        }
                      ],
                      "implicit_concepts": [
                        "ཉམས་ལེན་གྱི་རིམ་པ་ལྡན་པ།",
                        "ཐབས་ལམ་སྣ་ཚོགས་ཀྱི་ཕུང་པོ།"
                      ],
                      "pedagogical_strategy": "ས་བཅད་འགོད་པའི་ཐབས། བཤད་བྱའི་གནད་དོན་རྣམས་མདོར་བསྡུས་ནས་སྔོན་དུ་འགོད་པ།",
                      "intended_impact_on_reader": "མཐུན་ཕྱོགས་སྒྲུབ་པའི་ལམ་གྱི་སྤྱི་ཁོག་གསལ་པོར་ཤེས་ཏེ་དེའི་ནང་གསེས་ཀྱི་དོན་ལ་སློབ་པར་གྲ་སྒྲིག་བྱེད་པ།",
                      "audience_assumptions": "ཀློག་པ་པོས་རྒྱས་པར་མ་བཤད་གོང་དུ་སྤྱིའི་ས་བཅད་ཅིག་ཤེས་ན་གོ་བདེ་བར་འགྱུར་བར་བསམས་ཡོད།"
                    },
                    "children": []
                  },
                  {
                    "level": "subsubsection-7.2.3.2",
                    "title": "རྒྱས་བཤད། (Detailed Explanation)",
                    "verses_span": "35-78",
                    "summary": {
                      "content_summary": "སྡེ་ཚན་འདིས་གོང་དུ་མདོར་བསྟན་པའི་དཔུང་བཞི་དང་སྟོབས་གཉིས་ཇི་ལྟར་བསྐྱེད་ཚུལ་ཞིབ་ཏུ་བཀྲལ་ཡོད། དང་པོ་མོས་པའི་དཔུང་ནི་རྒྱུ་འབྲས་ལ་བསམས་ནས་བསྐྱེད་ཚུལ། གཉིས་པ་བརྟན་པའི་དཔུང་ངམ་ང་རྒྱལ་རྣམ་གསུམ་བསྒོམ་ཚུལ། གསུམ་པ་དགའ་བའི་དཔུང་ནི་བྱ་བ་དགེ་བ་ལ་ལན་དང་རྣམ་སྨིན་ལ་མི་ལྟོས་པར་སྤྲོ་བས་འཇུག་ཚུལ། བཞི་པ་དོར་བའི་དཔུང་ནི་ངལ་དུབ་སྐབས་དང་ལས་མཐར་ཕྱིན་སྐབས་གུ་ཡངས་བྱེད་ཚུལ། དེ་ནས་སྟོབས་གཉིས་ལས་ལྷུར་ལེན་པའི་སྟོབས་ཀྱིས་དྲན་ཤེས་བསྟེན་ཚུལ་དང་། དབང་སྒྱུར་བའི་སྟོབས་ཀྱིས་ལུས་སེམས་དགེ་བའི་ལས་ལ་དབང་བསྒྱུར་ཚུལ་བཅས་རྒྱས་པར་བཤད་ཡོད།",
                      "key_concepts": [
                        "མོས་པའི་དཔུང་།",
                        "བརྟན་པའི་དཔུང་།",
                        "དགའ་བའི་དཔུང་།",
                        "དོར་བའི་དཔུང་།",
                        "ལྷུར་ལེན་པའི་སྟོབས།",
                        "དབང་བསྒྱུར་བའི་སྟོབས།"
                      ],
                      "transformative_goal": "བརྩོན་འགྲུས་ཀྱི་མཐུན་ཕྱོགས་སོ་སོའི་ཉམས་ལེན་ཞིབ་ཕྲ་ཤེས་ནས། དེ་དག་རྒྱུད་ལ་སྦྱར་ཏེ་བརྩོན་འགྲུས་ཀྱི་ནུས་པ་མཐར་ཕྱིན་པ་ཞིག་བསྐྱེད་པ།",
                      "function_in_hierarchy": "འདི་ནི་མཐུན་ཕྱོགས་བསྒྲུབ་པའི་ལག་ལེན་དངོས་གཞིའི་སྐོར་ཡིན་ལ། སྡེ་ཚན་སྔོན་མས་བསྟན་པའི་ས་བཅད་ཀྱི་ནང་དོན་རྣམས་ཞིབ་ཏུ་འགྲེལ་བཤད་བྱེད་ཀྱི་ཡོད།",
                      "inter_node_relationships": [
                        {
                          "related_node_id": "subsubsection-7.2.3.1",
                          "relationship_type": "elaborates_on",
                          "conceptual_bridge": "སྡེ་ཚན་འདིས་སྔར་མདོར་བསྟན་པའི་དཔུང་བཞི་དང་སྟོབས་གཉིས་པོ་རེ་རེ་བཞིན་གྱི་ངོ་བོ་དང་། བསྐྱེད་ཐབས། ཕན་ཡོན་བཅས་རྒྱས་པར་བཀྲལ་ནས་གསལ་བཤད་བྱེད།"
                        }
                      ],
                      "implicit_concepts": [
                        "སེམས་ཁམས་སྦྱོང་བརྡར་གྱི་གོ་རིམ་གསལ་པོ།",
                        "རང་གི་ནུས་ཚོད་དང་བསྟུན་པའི་ཐབས་མཁས།",
                        "དགེ་བའི་ལས་རང་ངོས་ནས་བདེ་བ་ཡིན་པའི་ལྟ་བ།"
                      ],
                      "pedagogical_strategy": "ནང་གསེས་ཀྱི་དབྱེ་བ་མང་པོ་ཕྱེ་སྟེ་རིམ་པ་བཞིན་བཤད་པའི་ཐབས་ལམ་སྤྱོད་ཡོད། གནད་དོན་རེ་རེ་ལ་རྒྱུ་མཚན་དང་དཔེ་སྦྱར་ནས་གསལ་བཤད་བྱས་ཡོད།",
                      "intended_impact_on_reader": "བརྩོན་འགྲུས་བསྐྱེད་པ་དང་རྒྱུན་སྐྱོང་བྱེད་པའི་ཐབས་ལམ་ཞིབ་ཕྲ་དང་ལག་ལེན་དངོས་ཀྱི་ལམ་སྟོན་ཆ་ཚང་ཞིག་ཐོབ་པ།",
                      "audience_assumptions": "ཀློག་པ་པོ་ནི་ཉམས་ལེན་པ་ཞིག་ཡིན་པའི་ཆ་ནས་ལག་ལེན་གྱི་ཞིབ་ཕྲའི་ལམ་སྟོན་ལ་དགའ་མོས་ཡོད་པར་ཆ་འཇོག་བྱེད།"
                    },
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
  