[
  {
    "level": "chapter",
    "number": "9",
    "title": "ཤེས་རབ་ཀྱི་ལེའུ། (Chapter on Wisdom)",
    "verses_span": "1-168",
    "verse_text_excerpt": "ཡན་ལག་འདི་དག་ཐམས་ཅད་ནི། །ཐུབ་པས་ཤེས་རབ་དོན་དུ་གསུངས། །\nདེ་ཡི་ཕྱིར་ན་སྡུག་བསྔལ་དག །ཞི་བར་འདོད་པས་ཤེས་རབ་བསྐྱེད། །\n\nཀུན་རྫོབ་དང་ནི་དོན་དམ་སྟེ། །འདི་ནི་བདེན་པ་གཉིས་སུ་འདོད། །\n\nདོན་དམ་བློ་ཡི་སྤྱོད་ཡུལ་མིན། །བློ་ནི་ཀུན་རྫོབ་ཡིན་པར་བརྗོད། །\n\nདེ་ལ་འཇིག་རྟེན་རྣམ་གཉིས་མཐོང་། །རྣལ་འབྱོར་པ་དང་ཕལ་པའོ། །\nདེ་ལ་འཇིག་རྟེན་ཕལ་པ་ནི། །རྣལ་འབྱོར་འཇིག་རྟེན་གྱིས་གནོད་ཅིང་། །\nརྣལ་འབྱོར་པ་ཡང་བློ་ཁྱད་ཀྱིས། །གོང་མ་གོང་མ་རྣམས་ཀྱིས་གནོད། །\n\nགཉི་ག་ཡང་ནི་འདོད་པའི་དཔེས། །འབྲས་བུའི་དོན་དུ་མ་དཔྱད་ཕྱིར། །\nའཇིག་རྟེན་པ་ཡིས་དངོས་མཐོང་ཞིང་། །ཡང་དག་ཉིད་དུའང་རྟོག་བྱེད་ཀྱི། །\nསྒྱུ་མ་ལྟ་བུར་མིན་པས་འདིར། །རྣལ་འབྱོར་པ་དང་འཇིག་རྟེན་རྩོད། །\n\nགཟུགས་སོགས་མངོན་སུམ་ཉིད་ཀྱང་ནི། །གྲགས་པས་ཡིན་གྱི་ཚད་མས་མིན། །\nདེ་ནི་མི་གཙང་ལ་སོགས་ལ། །གཙང་སོགས་གྲགས་པ་བཞིན་དུ་རྫུན། །\nའཇིག་རྟེན་གཞུག་པའི་དོན་དུ་ནི། །མགོན་པོས་དངོས་བསྟན་དེ་ཉིད་དུ། །\nདེ་དག་སྐད་ཅིག་མ་ཉིད་མིན། །ཀུན་རྫོབ་ཏུ་ཡང་འགལ་ཞེ་ན། །\nརྣལ་འབྱོར་ཀུན་རྫོབ་ཉེས་མེད་དེ། །འཇིག་རྟེན་ལ་ལྟོས་དེ་ཉིད་མཐོང་། །\nགཞན་དུ་བུད་མེད་མི་གཙང་བར། །དེས་རྟོག་འཇིག་རྟེན་གྱིས་གནོད་འགྱུར། །\nསྒྱུ་འདྲའི་རྒྱལ་ལས་བསོད་ནམས་ནི། །ཇི་ལྟར་དངོས་ཡོད་ལ་ཇི་བཞིན། །\nགལ་ཏེ་སེམས་ཅན་སྒྱུ་འདྲ་ན། །ཤི་ནས་ཇི་ལྟར་སྐྱེ་ཞེ་ན། །\nཇི་སྲིད་རྐྱེན་རྣམས་འཚོགས་གྱུར་པ། །དེ་སྲིད་སྒྱུ་མའང་འབྱུང་བར་འགྱུར། །\nརྒྱུན་རིང་ཙམ་གྱིས་ཇི་ལྟར་ན། །སེམས་ཅན་བདེན་པར་ཡོད་པ་ཡིན། །\nསྒྱུ་མའི་སྐྱེས་བུ་བསད་སོགས་ལ། །སེམས་མེད་ཕྱིར་ན་སྡིག་མེད་དེ། །\nསྒྱུ་མའི་སེམས་དང་ལྡན་པ་ལ། །བསོད་ནམས་དང་ནི་སྡིག་པ་འབྱུང་། །\nསྔགས་སོགས་རྣམས་ལ་ནུས་མེད་ཕྱིར། །སྒྱུ་མའི་སེམས་ནི་འབྱུང་བ་མེད། །\nསྣ་ཚོགས་རྐྱེན་ལས་བྱུང་བ་ཡི། །སྒྱུ་མ་དེ་ཡང་སྣ་ཚོགས་ཉིད། །\nརྐྱེན་གཅིག་གིས་ནི་ཀུན་ནུས་པ། །གང་ན་ཡང་ནི་ཡོད་མ་ཡིན། །\nགལ་ཏེ་དོན་དམ་མྱ་ངན་འདས། །འཁོར་བ་ཀུན་རྫོབ་དེ་ལྟ་ན། །\nསངས་རྒྱས་ཀྱང་ནི་འཁོར་འགྱུར་བས། །བྱང་ཆུབ་སྤྱོད་པས་ཅི་ཞིག་བྱ། །\nརྐྱེན་རྣམས་རྒྱུན་ནི་མ་ཆད་ན། །སྒྱུ་མའང་ལྡོག་པར་མི་འགྱུར་གྱི། །\nརྐྱེན་རྣམས་རྒྱུན་ནི་ཆད་པས་ན། །ཀུན་རྫོབ་ཏུ་ཡང་མི་འབྱུང་ངོ་། །\n\nགང་ཚེ་འཁྲུལ་པའང་ཡོད་མིན་ན། །སྒྱུ་མ་གང་གིས་དམིགས་པར་འགྱུར། །\nགང་ཚེ་ཁྱོད་ལ་སྒྱུ་མ་ཉིད། །མེད་ནའང་དེ་ཚེ་ཅི་ཞིག་དམིགས། །\nགལ་ཏེ་དེ་ཉིད་དུ་གཞན་ཡོད། །རྣམ་པ་དེ་ནི་སེམས་ཉིད་ཡིན། །\nགང་ཚེ་སེམས་ཉིད་སྒྱུ་མ་ན། །དེ་ཚེ་གང་ཞིག་གང་གིས་མཐོང་། །\nའཇིག་རྟེན་གྱི་ནི་མགོན་པོས་ཀྱང་། །སེམས་ཀྱིས་སེམས་མི་མཐོང་ཞེས་གསུངས། །\nརལ་གྲི་སོ་ནི་རང་ལ་རང་། །ཇི་ལྟར་མི་གཅོད་དེ་བཞིན་ཡིད། །\nཇི་ལྟར་མར་མེ་རང་གི་དངོས། །ཡང་དག་གསལ་བར་བྱེད་བཞིན་ན། །\nམར་མེ་གསལ་བར་བྱ་མིན་ཏེ། །གང་ཕྱིར་མུན་གྱིས་བསྒྲིབས་པ་མེད། །\nཤེལ་བཞིན་སྔོན་པོ་སྔོ་ཉིད་ལ། །གཞན་ལ་ལྟོས་པ་ཡོད་མ་ཡིན། །\nདེ་བཞིན་འགའ་ཞིག་གཞན་ལ་ནི། །ལྟོས་དང་ལྟོས་མེད་པ་ཡང་མཐོང་། །\nསྔོ་ཉིད་མིན་ལ་སྔོན་པོར་དེ། །བདག་གིས་བདག་ཉིད་བྱས་པ་མེད། །\nམར་མེ་གསལ་བར་བྱེད་དོ་ཞེས། །ཤེས་པས་ཤེས་ཏེ་རྗོད་བྱེད་ན། །\nབློ་ནི་གསལ་བ་ཉིད་ཡིན་ཞེས། །གང་གིས་ཤེས་ནས་དེ་སྐད་བརྗོད། །\nགང་ཚེ་འགས་ཀྱང་མཐོང་མིན་ན། །གསལ་བའམ་ནི་མི་གསལ་བ། །\nམོ་གཤམ་བུ་མོའི་འགྱིང་བག་བཞིན། །དེ་ནི་བརྗོད་ཀྱང་དོན་མེད་དོ། །\nགལ་ཏེ་རང་རིག་ཡོད་མིན་ན། །རྣམ་ཤེས་དྲན་པར་ཇི་ལྟར་འགྱུར། །\nགཞན་མྱོང་བ་ན་འབྲེལ་པ་ལས། །དྲན་འགྱུར་བྱི་བའི་དུག་བཞིན་ནོ། །\nརྐྱེན་གཞན་དག་དང་ལྡན་པ་ནི། །མཐོང་ཕྱིར་རང་ཉིད་རབ་གསལ་ན། །\nགྲུབ་པའི་མིག་སྨན་སྦྱོར་བ་ལས། །བུམ་མཐོང་མིག་སྨན་ཉིད་འགྱུར་མིན། །\nཇི་ལྟར་མཐོང་ཐོས་ཤེས་པ་དག །འདིར་ནི་དགག་པར་བྱ་མིན་ཏེ། །\nའདིར་ནི་སྡུག་བསྔལ་རྒྱུར་གྱུར་པ། །བདེན་པར་རྟོག་པ་བཟློག་བྱ་ཡིན། །\nསེམས་ལས་སྒྱུ་མ་གཞན་མིན་ཞིང་། །གཞན་མིན་པར་ཡང་མི་རྟག་ན། །\nདངོས་ན་ཇི་ལྟར་དེ་གཞན་མིན། །གཞན་མིན་ཞེ་ན་དངོས་པོར་མེད། །\nཇི་ལྟར་སྒྱུ་མ་བདེན་མིན་ཡང་། །བལྟ་བྱ་དེ་བཞིན་ལྟ་བྱེད་ཡིད། །\nགལ་ཏེ་འཁོར་བ་དངོས་རྟེན་ཅན། །དེ་ནི་གཞན་དུ་མཁའ་འདྲར་འགྱུར། །\nདངོས་མེད་དངོས་ལ་བརྟེན་པས་ན། །བྱེད་དང་ལྡན་པར་ཇི་ལྟར་འགྱུར། །\nཁྱོད་ཀྱི་སེམས་ནི་གྲོགས་མེད་པར། །གཅིག་པུ་ཉིད་དུ་འགྱུར་བ་ཡིན། །\nགང་ཚེ་སེམས་ནི་གཟུང་བྲལ་བ། །དེ་ཚེ་ཐམས་ཅད་དེ་བཞིན་གཤེགས། །\nདེ་ལྟ་ན་ཡང་སེམས་ཙམ་དུ། །བརྟགས་ལ་ཡོན་ཏན་ཅི་ཞིག་ཡོད། །\n\nསྒྱུ་མ་ལྟ་བུར་ཤེས་ན་ཡང་། །ཇི་ལྟར་ཉོན་མོངས་ལྡོག་འགྱུར་ཏེ། །\nགང་ཚེ་སྒྱུ་མའི་བུད་མེད་ལ། །དེ་བྱེད་ཉིད་ཀྱང་ཆགས་སྐྱེ་འགྱུར། །\nདེ་བྱེད་པ་ནི་ཤེས་བྱ་ལ། །ཉོན་མོངས་བག་ཆགས་མ་སྤངས་པ། །\nདེས་ན་དེ་མཐོང་བ་ན་དེ། །སྟོང་ཉིད་བག་ཆགས་ཉམ་ཆུང་ཉིད། །\nསྟོང་ཉིད་བག་ཆགས་གོམས་པས་ནི། །དངོས་པོའི་བག་ཆགས་སྤོང་འགྱུར་ཞིང་། །\nཅི་ཡང་མེད་ཅེས་གོམས་པས་ནི། །དེ་ཡང་ཕྱི་ནས་སྤོང་བར་འགྱུར། །\nགང་ཚེ་གང་ཞིག་མེད་དོ་ཞེས། །བརྟག་བྱའི་དངོས་པོ་མི་དམིགས་པ། །\nདེ་ཚེ་དངོས་མེད་རྟེན་བྲལ་བ། །བློ་ཡི་མདུན་ན་ཇི་ལྟར་གནས། །\nགང་ཚེ་དངོས་དང་དངོས་མེད་དག །བློ་ཡི་མདུན་ན་མི་གནས་པ། །\nདེ་ཚེ་རྣམ་པ་གཞན་མེད་པས། །དམིགས་པ་མེད་པར་རབ་ཏུ་ཞི། །\n\nཡིད་བཞིན་ནོར་བུ་དཔག་བསམ་ཤིང་། །ཇི་ལྟར་རེ་བ་ཡོངས་སྐོང་བ། །\nདེ་བཞིན་གདུལ་བྱ་སྨོན་ལམ་གྱི། །དབང་གིས་རྒྱལ་བའི་སྐུར་སྣང་ངོ་། །\nདཔེར་ན་ནམ་མཁའ་ལྡིང་གི་ནི། །མཆོད་སྡོང་བསྒྲུབས་ནས་འདས་གྱུར་པ། །\nདེ་འདས་ཡུན་རིང་ལོན་ཡང་དེ། །དུག་ལ་སོགས་པ་ཞི་བྱེད་བཞིན། །\nབྱང་ཆུབ་སྤྱོད་པའི་རྗེས་མཐུན་པར། །རྒྱལ་བའི་མཆོད་སྡོང་བསྒྲུབས་པ་ཡང་། །\nབྱང་ཆུབ་སེམས་དཔའ་མྱ་ངན་ལས། །འདས་ཀྱང་དོན་རྣམས་ཐམས་ཅད་མཛད། །\nསེམས་མེད་པ་ལ་མཆོད་བྱས་པས། །ཇི་ལྟར་འབྲས་བུ་ལྡན་པར་འགྱུར། །\nགང་ཕྱིར་བཞུགས་པའམ་མྱ་ངན་འདས། །མཚུངས་པ་ཉིད་དུ་བཤད་ཕྱིར་རོ། །\nཀུན་རྫོབ་བམ་ནི་དེ་ཉིད་དུའང་། །རུང་སྟེ་དེར་འབྲས་ལུང་ལས་ཡིན། །\nདཔེར་ན་བདེན་པའི་སངས་རྒྱས་ལ། །ཇི་ལྟར་འབྲས་བུར་བཅས་པ་བཞིན། །\n\nབདེན་པ་མཐོང་བས་གྲོལ་འགྱུར་གྱི། །སྟོང་ཉིད་མཐོང་བས་ཅི་ཞིག་བྱ། །\nགང་ཕྱིར་ལུང་ལས་ལམ་འདི་ནི། །མེད་པར་བྱང་ཆུབ་མེད་པར་གསུངས། །\nགལ་ཏེ་ཐེག་ཆེན་མ་གྲུབ་ན། །ཁྱོད་ཀྱི་ལུང་ནི་ཇི་ལྟར་གྲུབ། །\nགང་ཕྱིར་གཉིས་ཀ་ལ་འདི་གྲུབ། །དང་པོ་ཁྱོད་ལ་འདི་མ་གྲུབ། །\nརྐྱེན་གང་གིས་ནི་དེར་ཡིད་ཆེས། །དེ་ནི་ཐེག་ཆེན་ལ་ཡང་མཚུངས། །\nགཞན་གཉིས་འདོད་པས་བདེན་ན་ནི། །རིག་བྱེད་སོགས་ཀྱང་བདེན་པར་འགྱུར། །\nཐེག་ཆེན་རྩོད་བཅས་ཕྱིར་ཞེ་ན། །ལུང་ལ་མུ་སྟེགས་པ་རྣམས་དང་། །\nལུང་གཞན་ལ་ཡང་རང་གཞན་དག །རྩོད་བཅས་ཡིན་ཕྱིར་དོར་བྱར་འགྱུར། །\nབསྟན་རྩ་དགེ་སློང་ཉིད་ཡིན་ན། །དགེ་སློང་ཉིད་ཀྱང་དཀའ་བར་གནས། །\nསེམས་ནི་དམིགས་དང་བཅས་རྣམས་ཀྱི། །མྱ་ངན་འདས་པའང་དཀའ་བར་གནས། །\nཉོན་མོངས་སྤངས་པས་གྲོལ་ན་དེའི། །དེ་མ་ཐག་ཏུ་དེར་འགྱུར་རོ། །\nཉོན་མོངས་མེད་ཀྱང་དེ་དག་ལ། །ལས་ཀྱི་ནུས་པ་མཐོང་བ་ཡིན། །\nརེ་ཞིག་ཉེར་ལེན་སྲེད་པ་ནི། །མེད་ཅེས་ངེས་པ་ཉིད་ཅེ་ན། །\nསྲེད་དེ་ཉོན་མོངས་ཅན་མིན་ཡང་། །ཀུན་རྨོངས་བཞིན་དུ་ཅི་སྟེ་མེད། །\nཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ་ཡིན། །ཚོར་བ་དེ་དག་ལ་ཡང་ཡོད། །\nདམིགས་པ་དང་ནི་བཅས་པའི་སེམས། །འགའ་ཞིག་ལ་ནི་གནས་པར་འགྱུར། །\nསྟོང་ཉིད་དང་ནི་བྲལ་བའི་སེམས། །འགགས་པ་སླར་ཡང་སྐྱེ་འགྱུར་ཏེ། །\nའདུ་ཤེས་མེད་པའི་སྙོམས་འཇུག་བཞིན། །དེས་ན་སྟོང་ཉིད་བསྒོམ་པར་བྱ། །\n\nངག་གང་མདོ་སྡེ་ལ་འཇུག་དེ། །གལ་ཏེ་སངས་རྒྱས་གསུངས་འདོད་ན། །\nཐེག་ཆེན་ཕལ་ཆེར་ཁྱེད་ཅག་གི །མདོ་དང་མཚུངས་འདོད་མིན་ནམ་ཅི། །\nགལ་ཏེ་མ་གཏོགས་གཅིག་གིས་ནི། །ཐམས་ཅད་སྐྱོན་དང་བཅས་འགྱུར་ན། །\nམདོ་མཚུངས་གཅིག་གིས་ཐམས་ཅད་ནི། །རྒྱལ་བས་གསུངས་པ་ཅིས་མ་ཡིན། །\nངག་གང་འོད་སྲུངས་ཆེན་པོ་ལ། །སོགས་པས་གཏིང་དཔོགས་མ་གྱུར་པ། །\nདེ་ནི་ཁྱོད་ཀྱིས་མ་རྟོགས་པས། །གཟུང་བྱ་མིན་པར་སུ་ཞིག་བྱེད། །\nརྨོངས་པས་སྡུག་བསྔལ་ཅན་དོན་དུ། །ཆགས་དང་འཇིགས་མཐའ་ལས་གྲོལ་བ། །\nའཁོར་བར་གནས་པ་གྲུབ་འགྱུར་བ། །འདི་ནི་སྟོང་ཉིད་འབྲས་བུ་ཡིན། །\nདེ་ལྟར་སྟོང་པ་ཉིད་ཕྱོགས་ལ། །སུན་འབྱིན་པ་ནི་འཐད་མ་ཡིན། །\nདེས་ན་ཐེ་ཚོམ་མི་ཟ་བར། །སྟོང་པ་ཉིད་ནི་བསྒོམ་པར་བྱ། །\nཉོན་མོངས་ཤེས་བྱའི་སྒྲིབ་པ་ཡི། །མུན་པའི་གཉེན་པོ་སྟོང་པ་ཉིད། །\nམྱུར་དུ་ཐམས་ཅད་མཁྱེན་འདོད་པས། །དེ་ནི་ཇི་ལྟར་སྒོམ་མི་བྱེད། །\nདངོས་གང་སྡུག་བསྔལ་སྐྱེད་བྱེད་པ། །དེ་ལས་སྐྲག་པ་སྐྱེ་འགྱུར་ན། །\nསྟོང་ཉིད་སྡུག་བསྔལ་ཞི་བྱེད་པ། །དེ་ལ་འཇིགས་པ་ཇི་ལྟར་སྐྱེ། །\nགལ་ཏེ་བདག་འགའ་ཡོད་ན་ནི། །ཅི་ཡང་རུང་ལས་འཇིགས་འགྱུར་ན། །\nབདག་ཉིད་འགའ་ཡང་ཡོད་མིན་པས། །འཇིགས་པར་འགྱུར་བ་སུ་ཞིག་ཡིན། །\n\nསོ་དང་སྐྲ་སེན་བདག་མ་ཡིན། །བདག་ནི་རུས་པ་ཁྲག་མ་ཡིན། །\nསྣབས་མིན་བད་ཀན་མ་ཡིན་ཏེ། །ཆུ་སེར་དང་ནི་རྣག་ཀྱང་མིན། །\nབདག་ནི་ཞག་དང་རྔུལ་མིན་ཏེ། །གློ་མཆིན་དག་ཀྱང་བདག་མ་ཡིན། །\nནང་ཁྲོལ་གཞན་ཡང་བདག་མིན་ཏེ། །བདག་ནི་ཕྱི་ས་གཅིན་མ་ཡིན། །\nཤ་དང་པགས་པ་བདག་མིན་ཏེ། །དྲོད་དང་རླུང་ཡང་བདག་མ་ཡིན། །\nབུ་ག་བདག་མིན་རྣམ་ཀུན་དུ། །རྣམ་ཤེས་དྲུག་ཀྱང་བདག་མ་ཡིན། །\n\nགལ་ཏེ་སྒྲ་ཡི་ཤེས་རྟག་ན། །ཐམས་ཅད་ཚེ་ན་སྒྲ་འཛིན་འགྱུར། །\nཤེས་བྱ་མེད་ན་ཅི་ཞིག་རིག །གང་གིས་ཤེས་པ་ཞེས་རྗོད་བྱེད། །\nགལ་ཏེ་ཤེས་མེད་ཤེས་ཡིན་ན། །ཤིང་ཡང་ཤེས་པར་ཐལ་བར་འགྱུར། །\nདེས་ན་ཤེས་བྱ་ཉེར་གནས་པ། །མེད་པར་ཤེས་པ་མེད་ཅེས་ངེས། །\nདེ་ཉིད་ཀྱིས་ནི་གཟུགས་ཤེས་ན། །དེ་ཚེ་ཐོས་པའང་ཅི་སྟེ་མིན། །\nགལ་ཏེ་སྒྲ་མི་ཉེ་ཕྱིར་ན། །དེས་ན་དེ་ཡི་ཤེས་པའང་མེད། །\nསྒྲ་འཛིན་རང་བཞིན་གང་ཡིན་པ། །དེ་གཟུགས་འཛིན་པར་ཇི་ལྟར་འགྱུར། །\nགཅིག་ནི་ཕ་དང་བུ་ཉིད་དུ། །བརྟགས་ཡིན་ཡང་དག་ཉིད་མིན་ཏེ། །\nའདི་ལྟར་སྙིང་སྟོབས་རྡུལ་དང་ནི། །མུན་པ་བུ་མིན་ཕ་ཡང་མིན། །\nདེ་ནི་སྒྲ་འཛིན་དང་ལྡན་པའི། །རང་བཞིན་དུ་ནི་མཐོང་མ་ཡིན། །\nགར་མཁན་ལྟ་བུར་ཚུལ་གཞན་གྱིས། །དེ་ཉིད་མཐོང་ན་དེ་རྟག་མིན། །\nགལ་ཏེ་ཚུལ་གཞན་དེ་ཉིད་ན། །གཅིག་ཉིད་དེ་ནི་སྔོན་མེད་གཅིག །\nགལ་ཏེ་ཚུལ་གཞན་བདེན་མིན་ན། །དེ་ཡི་རང་གི་རང་བཞིན་སྨྲོས། །\nཤེས་ཉིད་ཅེ་ན་དེ་ལྟ་ན། །སྐྱེས་ཀུན་གཅིག་ཏུ་ཐལ་བར་འགྱུར། །\nསེམས་པ་སེམས་མེད་དེ་དག་ཀྱང་། །གཅིག་འགྱུར་གང་ཕྱིར་ཡོད་ཉིད་མཚུངས། །\nགང་ཚེ་བྱེ་བྲག་ཕྱིན་ཅི་ལོག །དེ་ཚེ་འདྲ་བའི་རྟེན་གང་ཡིན། །\n\nསེམས་མེད་པ་ཡང་བདག་མིན་ཏེ། །སེམས་མེད་ཉིད་ཕྱིར་བུམ་སོགས་བཞིན། །\nའོན་ཏེ་སེམས་དང་ལྡན་པའི་ཕྱིར། །ཤེས་ན་མི་ཤེས་འཇིག་པར་ཐལ། །\nཇི་སྟེ་བདག་ལ་འགྱུར་མེད་ན། །སེམས་པས་དེ་ལ་ཅི་ཞིག་བྱས། །\nདེ་ལྟར་ཤེས་མེད་བྱ་བྲལ་བ། །ནམ་མཁའ་བདག་ཏུ་བྱས་པར་འགྱུར། །\n\nགལ་ཏེ་བདག་ནི་ཡོད་མིན་ན། །ལས་འབྲས་འབྲེལ་པ་རིགས་མིན་ཏེ། །\nལས་བྱས་ནས་ནི་ཞིག་པས་ན། །སུ་ཡི་ལས་སུ་འགྱུར་ཞེ་ན། །\nབྱ་བ་འབྲས་གཞི་ཐ་དད་དང་། །དེར་བདག་བྱེད་པ་མེད་པར་ཡང་། །\nཡུ་བུ་གཉི་ག་ལ་གྲུབ་པས། །འདིར་བརྩད་དོན་མེད་མ་ཡིན་ནམ། །\nརྒྱུ་ལྡན་འབྲས་བུ་དང་བཅས་ཞེས། །མཐོང་བ་འདི་ནི་སྲིད་མ་ཡིན། །\nརྒྱུད་གཅིག་ལ་ནི་བརྟེན་ནས་སུ། །བྱེད་པོ་སྤྱོད་པོ་ཞེས་བྱར་བསྟན། །\nའདས་དང་མ་འོངས་པ་ཡི་སེམས། །བདག་མིན་དེ་ནི་མེད་པའི་ཕྱིར། །\nའོན་ཏེ་སྐྱེས་སེམས་བདག་ཡིན་ན། །དེ་ཞིག་ན་ཡང་བདག་མེད་དོ། །\n\nདཔེར་ན་ཆུ་ཤིང་སྡོང་པོ་དག །ཆ་ཤས་ཕྱེ་ན་འགའ་མེད་པ། །\nདེ་བཞིན་རྣམ་པར་དཔྱད་པ་ཡིས། །བཙལ་ན་བདག་ཀྱང་ཡང་དག་མིན། །\n\nགལ་ཏེ་སེམས་ཅན་ཡོད་མིན་ན། །སུ་ལ་སྙིང་རྗེ་བྱ་ཞེ་ན། །\nའབྲས་བུའི་དོན་དུ་ཁས་བླངས་པའི། །རྨོངས་པས་བརྟགས་པ་གང་ཡིན་པའོ། །\nསེམས་ཅན་མེད་འབྲས་སུ་ཡི་ཡིན། །བདེན་ཏེ་འོན་ཀྱང་རྨོངས་ལས་འདོད། །\nསྡུག་བསྔལ་ཉེ་བར་ཞི་དོན་དུ། །འབྲས་བུའི་རྨོངས་པ་བཟློག་མི་བྱ། །\nསྡུག་བསྔལ་རྒྱུ་ཡི་ང་རྒྱལ་ནི། །བདག་ཏུ་རྨོངས་པས་འཕེལ་བར་འགྱུར། །\nདེ་ལས་ཀྱང་བཟློག་མེད་ཅེ་ན། །བདག་མེད་བསྒོམ་པ་མཆོག་ཡིན་ནོ། །\n\nལུས་ནི་རྐང་པ་བྱིན་པ་མིན། །བརླ་དང་རྐེད་པའང་ལུས་མ་ཡིན། །\nལྟོ་དང་རྒྱབ་ཀྱང་ལུས་མིན་ཏེ། །བྲང་དང་དཔུང་པའང་ལུས་མ་ཡིན། །\nརྩིབ་ལོགས་ལག་པའང་ལུས་མིན་ཏེ། །མཆན་ཁུང་ཕྲག་པའང་ལུས་མ་ཡིན། །\nནང་ཁྲོལ་རྣམས་ཀྱང་དེ་མིན་ལ། །མགོ་དང་མགྲིན་པའང་ལུས་མིན་ན། །\nའདི་ལ་ལུས་ནི་གང་ཞིག་ཡིན། །གལ་ཏེ་ལུས་འདི་ཐམས་ཅད་ལ། །\nཕྱོགས་རེ་ཡིས་ནི་གནས་གྱུར་ན། །ཆ་རྣམས་ཆ་ལ་གནས་གྱུར་མོད། །\nདེ་རང་ཉིད་ནི་གང་ལ་གནས། །གལ་ཏེ་བདག་ཉིད་ཀུན་གྱི་ལུས། །\nལག་སོགས་རྣམས་ལ་གནས་ན་ནི། །ལག་སོགས་དེ་དག་ཇི་སྙེད་པ། །\nདེ་སྙེད་ཀྱི་ནི་ལུས་སུ་འགྱུར། །ཕྱི་དང་ནང་ན་ལུས་མེད་ན། །\nཇི་ལྟར་ལག་སོགས་ལ་ལུས་ཡོད། །ལག་སོགས་རྣམས་ལས་གཞན་མེད་ན། །\nདེ་ནི་ཇི་ལྟར་ཡོད་པ་ཡིན། །དེས་ན་ལུས་མེད་ལག་སོགས་ལ། །\nརྨོངས་པ་ཡིས་ནི་ལུས་བློར་འགྱུར། །དབྱིབས་སུ་བཀོད་པའི་ཁྱད་པར་གྱིས། །\nཐོ་ཡོར་ལ་ནི་མི་བློ་བཞིན། །ཇི་སྲིད་རྐྱེན་ཚོགས་དེ་སྲིད་དུ། །\nལུས་ནི་སྐྱེས་བུ་ལྟར་སྣང་བ། །དེ་བཞིན་ཇི་སྲིད་ལག་སོགས་ལ། །\nདེ་ཡོད་དེ་སྲིད་དེར་ལུས་སྣང་། །\n\nདེ་བཞིན་སོར་མོའི་ཚོགས་ཡིན་ཕྱིར། །ལག་པའང་གང་ཞིག་ཡིན་པར་འགྱུར། །\nདེ་ཡང་ཚིགས་ཀྱི་ཚོགས་ཡིན་ཕྱིར། །ཚིགས་ཀྱང་རང་གི་ཆ་ཕྱེ་བས། །\nཆ་ཡང་རྡུལ་དུ་ཕྱེ་བས་ཏེ། །རྡུལ་དེའང་ཕྱོགས་ཆའི་དབྱེ་བ་ཡིས། །\nཕྱོགས་དབྱེའང་ཆ་ཤས་དང་བྲལ་ཕྱིར། །མཁའ་བཞིན་དེས་ན་རྡུལ་ཡང་མེད། །\n\nདེ་ལྟར་རྨི་ལམ་ལྟ་བུ་ཡི། །གཟུགས་ལ་དཔྱོད་ལྡན་སུ་ཞིག་ཆགས། །\nགང་ཚེ་དེ་ལྟར་ལུས་མེད་པ། །དེ་ཚེ་སྐྱེས་གང་བུད་མེད་གང་། །\n\nསྡུག་བསྔལ་དེ་ཉིད་དུ་ཡོད་ན། །ཅི་སྟེ་རབ་དགའ་ལ་མི་གནོད། །\nབདེ་ན་མྱ་ངན་གདུང་སོགས་ལ། །ཞིམ་སོགས་ཅི་སྟེ་དགའ་མི་བྱེད། །\nསྟོབས་དང་ལྡན་པས་ཟིལ་མནན་ཕྱིར། །གལ་ཏེ་དེ་མྱོང་མ་ཡིན་ན། །\nགང་ཞིག་ཉམས་མྱོང་བདག་ཉིད་མིན། །དེ་ནི་ཚོར་བ་ཇི་ལྟར་ཡིན། །\nསྡུག་བསྔལ་ཕྲ་མོ་ཉིད་དུ་ཡོད། །འདི་ཡི་རགས་པ་བསལ་མིན་ནམ། །\nདེ་ནི་དེ་ལས་གཞན་དགའ་ཙམ། །ཞེ་ན་ཕྲ་ཉིད་དེ་ཡང་དེའི། །\nགལ་ཏེ་འགལ་རྐྱེན་སྐྱེས་པས་ན། །སྡུག་བསྔལ་སྐྱེས་པ་མིན་ན་ནི། །\nཚོར་བར་རྟོག་པ་མངོན་ཞེན་ཉིད། །ཡིན་ཞེས་བྱ་བར་གྲུབ་མིན་ནམ། །\nདེ་ཉིད་ཕྱིར་ན་འདི་ཡི་ནི། །གཉེན་པོ་རྣམ་དཔྱོད་འདི་བསྒོམ་སྟེ། །\nརྣམ་བརྟགས་ཞིང་ལས་བྱུང་བ་ཡི། །བསམ་གཏན་རྣལ་འབྱོར་པ་ཡི་ཟས། །\n\nགལ་ཏེ་དབང་དོན་བར་བཅས་ན། །དེ་དག་གང་དུ་ཕྲད་པར་འགྱུར། །\nབར་མེད་ན་ཡང་གཅིག་ཉིད་དེ། །གང་ཞིག་གང་དང་ཕྲད་པར་འགྱུར། །\nརྡུལ་ཕྲན་རྡུལ་ཕྲན་ལ་འཇུག་མེད། །དེ་ནི་སྐབས་མེད་མཉམ་པ་ཡིན། །\nམ་ཞུགས་པ་ལ་འདྲེས་མེད་ཅིང་། །མ་འདྲེས་པ་ལ་ཕྲད་པ་མེད། །\nཆ་མེད་པ་ལའང་ཕྲད་པ་ཞེས། །བྱ་བ་ཇི་ལྟར་འཐད་པར་འགྱུར། །\nཕྲད་པ་དང་ནི་ཆ་མེད་པར། །གལ་ཏེ་མཐོང་ན་བསྟན་པར་གྱིས། །\nརྣམ་ཤེས་ལུས་མེད་པ་ལ་ནི། །ཕྲད་པ་འཐད་པ་མ་ཡིན་ཉིད། །\nཚོགས་པའང་དངོས་པོ་མེད་ཕྱིར་ཏེ། །སྔར་ནི་ཇི་ལྟར་རྣམ་དཔྱད་བཞིན། །\n\nདེ་ལྟར་རེག་པ་ཡོད་མིན་ན། །ཚོར་བ་གང་ལས་འབྱུང་བར་འགྱུར། །\nངལ་འདི་ཅི་ཡི་དོན་དུ་ཡིན། །གང་གིས་གང་ལ་གནོད་པར་འགྱུར། །\n\nགང་ཚེ་ཚོར་པོ་འགའ་མེད་ཅིང་། །ཚོར་བའང་ཡོད་པ་མ་ཡིན་པ། །\nདེ་ཚེ་གནས་སྐབས་འདི་མཐོང་ནས། །སྲེད་པ་ཅི་ཕྱིར་ལྡོག་མི་འགྱུར། །\nམཐོང་བ་འམ་ནི་རེག་པ་ཡང་། །རྨི་ལམ་སྒྱུ་འདྲའི་བདག་ཉིད་ཀྱིས། །\nསེམས་དང་ལྷན་ཅིག་སྐྱེས་པའི་ཕྱིར། །ཚོར་བ་དེ་ཡིས་མཐོང་མ་ཡིན། །\nསྔར་དང་ཕྱི་མར་སྐྱེས་པས་ཀྱང་། །དྲན་པར་འགྱུར་གྱི་མྱོང་མ་ཡིན། །\nརང་གིས་བདག་ཉིད་མྱོང་མིན་ལ། །གཞན་དག་གིས་ཀྱང་མྱོང་མ་ཡིན། །\n༔ཚོར་པོ་འགའ་ཡང་ཡོད་མིན་ཏེ། །དེས་ན་ཚོར་བ་དེ་ཉིད་མིན། །\nདེ་ལྟར་བདག་མེད་ཚོགས་འདི་ལ། །འདི་ཡིས་ཅི་སྟེ་གནོད་པར་བྱ། །\n\nཡིད་ནི་དབང་རྣམས་ལ་མི་གནས། །གཟུགས་སོགས་ལ་མིན་བར་ནའང་མིན། །\nནང་ཡང་སེམས་མིན་ཕྱི་མིན་ཞིང་། །གཞན་དུ་ཡང་ནི་རྙེད་མ་ཡིན། །\nགང་ཞིག་ལུས་མིན་གཞན་དུ་མིན། །འདྲེས་མིན་ལོགས་སུའང་འགར་མེད་པ། །\nདེ་ནི་ཅུང་ཟད་མིན་དེའི་ཕྱིར། །སེམས་ཅན་རང་བཞིན་མྱ་ངན་འདས། །\n\nཤེས་བྱ་ལས་སྔར་ཤེས་ཡོད་ན། །དེ་ནི་ཅི་ལ་དམིགས་ནས་སྐྱེ། །\nཤེས་དང་ཤེས་བྱ་ལྷན་ཅིག་ན། །དེ་ནི་ཅི་ལ་དམིགས་ནས་སྐྱེ། །\nའོན་ཏེ་ཤེས་བྱའི་ཕྱིས་ཡོད་ན། །དེ་ཚེ་ཤེས་པ་གང་ལས་སྐྱེ། །\n\nདེ་ལྟར་ཆོས་རྣམས་ཐམས་ཅད་ཀྱི། །སྐྱེ་བ་རྟོགས་པར་འགྱུར་མ་ཡིན། །\n\nགལ་ཏེ་དེ་ལྟར་ཀུན་རྫོབ་མེད། །དེ་ལ་བདེན་གཉིས་ག་ལ་ཡོད། །\nདེ་ཡང་ཀུན་རྫོབ་གཞན་གྱིས་ན། །སེམས་ཅན་མྱ་ངན་ག་ལ་འདའ། །\nའདི་ནི་གཞན་སེམས་རྣམ་རྟོག་སྟེ། །དེ་ནི་རང་གི་ཀུན་རྫོབ་མིན། །\nཕྱིས་དེ་ངེས་ན་དེ་ཡོད་དེ། །མིན་ན་ཀུན་རྫོབ་མེད་པ་ཉིད། །\n\nརྟོག་དང་བརྟག་པར་བྱ་བ་དག །གཉིས་པོ་ཕན་ཚུན་བརྟེན་པ་ཡིན། །\nཇི་ལྟར་གྲགས་པ་ལ་བརྟེན་ནས། །རྣམ་པར་དཔྱད་པ་ཐམས་ཅད་བརྗོད། །\n\nགང་ཚེ་རྣམ་པར་དཔྱད་པ་ཡི། །རྣམ་དཔྱོད་ཀྱིས་ནི་དཔྱོད་བྱེད་ན། །\nདེ་ཚེ་རྣམ་དཔྱོད་དེ་ཡང་ནི། །རྣམ་དཔྱོད་ཕྱིར་ན་ཐུག་པ་མེད། །\nདཔྱད་བྱ་རྣམ་པར་དཔྱད་བྱས་ན། །རྣམ་དཔྱོད་ལ་ནི་རྟེན་ཡོད་མིན། །\nརྟེན་མེད་ཕྱིར་ན་མི་སྐྱེ་སྟེ། །དེ་ཡང་མྱ་ངན་འདས་པར་བརྗོད། །\n\nདེ་ལྟར་སྟོང་པའི་དངོས་རྣམས་ལ། །ཐོབ་པ་ཅི་ཡོད་ཤོར་ཅི་ཡོད། །\nགང་གིས་རིམ་གྲོ་བྱས་པའམ། །ཡོངས་སུ་བརྙས་པའང་ཅི་ཞིག་ཡོད། །\nབདེ་བའང་སྡུག་བསྔལ་གང་ལས་ཡིན། །མི་དགར་ཅི་ཡོད་དགར་ཅི་ཡོད། །\nདེ་ཉིད་དུ་ནི་བཙལ་བྱས་ན། །གང་ཞིག་སྲེད་ཅིང་གང་ལ་སྲེད། །\nདཔྱད་ན་གསོན་པོའི་འཇིག་རྟེན་འདི། །གང་ཞིག་འདིར་ནི་འཆི་འགྱུར་ཏེ། །\nའབྱུང་འགྱུར་གང་ཡིན་བྱུང་གྱུར་གང་། །གཉེན་དང་བཤེས་ཀྱང་གང་ཞིག་ཡིན། །\nཐམས་ཅད་ནམ་མཁའ་འདྲ་བར་ནི། །བདག་འདྲས་ཡོངས་སུ་གཟུང་བར་གྱིས། །\nབདག་ཉིད་བདེ་བར་འདོད་རྣམས་ནི། །འཐབ་དང་སྤྲོ་བའི་རྒྱུ་དག་གིས། །\nརབ་ཏུ་འཁྲུག་དང་དགའ་བར་བྱེད། །མྱ་ངན་འབད་རྩོལ་རྩོད་པ་དང་། །\nཕན་ཚུན་གཅོད་དང་འབིགས་པ་དང་། །སྡིག་དག་གིས་ནི་ཚེགས་ཆེན་འཚོ། །\n\nབདེ་འགྲོར་ཡང་དང་ཡང་འོངས་ཏེ། །བདེ་བ་མང་པོ་སྤྱད་སྤྱད་ནས། །\nཤི་ནས་ངན་སོང་སྡུག་བསྔལ་ནི། །ཡུན་རིང་མི་བཟད་རྣམས་སུ་ལྟུང་། །\nསྲིད་པ་ན་ནི་གཡང་ས་མང་། །དེར་ནི་དེ་ཉིད་མིན་འདི་འདྲ། །\nདེར་ཡང་ཕན་ཚུན་འགལ་བས་ན། །སྲིད་ན་དེ་ཉིད་འདི་འདྲ་མེད། །\nདེ་ཡང་དཔེ་མེད་མི་བཟད་པའི། །སྡུག་བསྔལ་རྒྱ་མཚོ་མཐའ་ལས་འདས། །\nདེར་ནི་དེ་ལྟར་སྟོབས་ཆུང་ཞིང་། །དེར་ནི་ཚེ་ཡང་ཐུང་བ་ཉིད། །\nདེར་ཡང་གསོན་དང་ནད་མེད་ཀྱི། །བྱེད་དང་བཀྲེས་ནའི་ངལ་བ་དང་། །\nགཉིད་དང་འཚེ་དང་དེ་བཞིན་དུ། །བྱིས་དང་འགྲོགས་པ་དོན་མེད་ཀྱིས། །\nཚེ་ནི་དོན་མེད་མྱུར་འདའ་ཡི། །རྣམ་དཔྱོད་ཤིན་ཏུ་རྙེད་པར་དཀའ། །\nདེར་ཡང་རྣམ་གཡེང་གོམས་པ་ནི། །བཟློག་པའི་ཐབས་ནི་ག་ལ་ཡོད། །\nདེར་ཡང་ངན་སོང་ཆེན་པོར་ནི། །ལྟུང་ཕྱིར་བདུད་ནི་བརྩོན་པར་བྱེད། །\nདེར་ནི་ལོག་པའི་ལམ་མང་ཞིང་། །ཐེ་ཚོམ་ལས་ཀྱང་བརྒལ་དཀའ་སྟེ། །\nསླར་ཡང་དལ་བ་རྙེད་དཀའ་ཞིང་། །སངས་རྒྱས་འབྱུང་རྙེད་ཤིན་ཏུ་དཀའ། །\nཉོན་མོངས་ཆུ་བོ་སྤང་དཀའ་སྟེ། །ཨེ་མ་སྡུག་བསྔལ་བརྒྱུད་པར་འགྱུར། །\nདེ་ལྟར་ཤིན་ཏུ་སྡུག་བསྔལ་ཡང་། །རང་སྡུག་མི་མཐོང་གང་ཡིན་པ། །\nསྡུག་བསྔལ་ཆུ་བོར་གནས་འདི་དག །ཀྱི་ཧུད་མྱ་ངན་བྱ་བར་འོས། །\nདཔེར་ན་འགའ་ཞིག་ཡང་ཡང་ཁྲུས། །བྱས་ཏེ་ཡང་ཡང་མེར་འཇུག་པ། །\nདེ་ལྟར་ཤིན་ཏུ་སྡུག་བསྔལ་བར། །གནས་ཀྱང་བདག་ཉིད་བདེར་རློམ་བཞིན། །\nདེ་ལྟར་རྒ་དང་འཆི་མེད་པ། །བཞིན་དུ་སྤྱོད་པས་གནས་རྣམས་ལ། །\nདང་པོ་ཉིད་དུ་བསད་བྱས་ནས། །ངན་སོང་ལྟུང་བ་མི་བཟད་འོང་། །\nདེ་ལྟར་སྡུག་བསྔལ་མེས་གདུངས་ལ། །བསོད་ནམས་སྤྲིན་ལས་ལེགས་འཁྲུངས་པའི། །\nརང་གི་བདེ་བའི་ཚོགས་ཆར་གྱིས། །ཞི་བྱེད་པར་བདག་ནམ་ཞིག་འགྱུར། །\nནམ་ཞིག་དམིགས་པ་མེད་ཚུལ་དུ། །གུས་པས་བསོད་ནམས་ཚོགས་བསགས་ཏེ། །\nདམིགས་པས་ཕུང་བར་འགྱུར་རྣམས་ལ། །སྟོང་པ་ཉིད་ནི་སྟོན་པར་འགྱུར། །",
    "children": [
      {
        "level": "section",
        "number": "9.1",
        "title": "ཤེས་རབ་བསྐྱེད་པ་མདོར་བསྟན་པ། (Brief Explanation of Generating Wisdom)",
        "verses_span": "1-2",
        "verse_text_excerpt": "ཡན་ལག་འདི་དག་ཐམས་ཅད་ནི། །ཐུབ་པས་ཤེས་རབ་དོན་དུ་གསུངས། །\nདེ་ཡི་ཕྱིར་ན་སྡུག་བསྔལ་དག །ཞི་བར་འདོད་པས་ཤེས་རབ་བསྐྱེད། །",
        "children": []
      },
      {
        "level": "section",
        "number": "9.2",
        "title": "དེ་རྒྱས་པར་བཤད་པ། (Detailed Explanation of That)",
        "verses_span": "3-168",
        "verse_text_excerpt": "ཀུན་རྫོབ་དང་ནི་དོན་དམ་སྟེ། །འདི་ནི་བདེན་པ་གཉིས་སུ་འདོད། །\n\nདོན་དམ་བློ་ཡི་སྤྱོད་ཡུལ་མིན། །བློ་ནི་ཀུན་རྫོབ་ཡིན་པར་བརྗོད། །\n\nདེ་ལ་འཇིག་རྟེན་རྣམ་གཉིས་མཐོང་། །རྣལ་འབྱོར་པ་དང་ཕལ་པའོ། །\nདེ་ལ་འཇིག་རྟེན་ཕལ་པ་ནི། །རྣལ་འབྱོར་འཇིག་རྟེན་གྱིས་གནོད་ཅིང་། །\nརྣལ་འབྱོར་པ་ཡང་བློ་ཁྱད་ཀྱིས། །གོང་མ་གོང་མ་རྣམས་ཀྱིས་གནོད། །\n\nགཉི་ག་ཡང་ནི་འདོད་པའི་དཔེས། །འབྲས་བུའི་དོན་དུ་མ་དཔྱད་ཕྱིར། །\nའཇིག་རྟེན་པ་ཡིས་དངོས་མཐོང་ཞིང་། །ཡང་དག་ཉིད་དུའང་རྟོག་བྱེད་ཀྱི། །\nསྒྱུ་མ་ལྟ་བུར་མིན་པས་འདིར། །རྣལ་འབྱོར་པ་དང་འཇིག་རྟེན་རྩོད། །\n\nགཟུགས་སོགས་མངོན་སུམ་ཉིད་ཀྱང་ནི། །གྲགས་པས་ཡིན་གྱི་ཚད་མས་མིན། །\nདེ་ནི་མི་གཙང་ལ་སོགས་ལ། །གཙང་སོགས་གྲགས་པ་བཞིན་དུ་རྫུན། །\nའཇིག་རྟེན་གཞུག་པའི་དོན་དུ་ནི། །མགོན་པོས་དངོས་བསྟན་དེ་ཉིད་དུ། །\nདེ་དག་སྐད་ཅིག་མ་ཉིད་མིན། །ཀུན་རྫོབ་ཏུ་ཡང་འགལ་ཞེ་ན། །\nརྣལ་འབྱོར་ཀུན་རྫོབ་ཉེས་མེད་དེ། །འཇིག་རྟེན་ལ་ལྟོས་དེ་ཉིད་མཐོང་། །\nགཞན་དུ་བུད་མེད་མི་གཙང་བར། །དེས་རྟོག་འཇིག་རྟེན་གྱིས་གནོད་འགྱུར། །\nསྒྱུ་འདྲའི་རྒྱལ་ལས་བསོད་ནམས་ནི། །ཇི་ལྟར་དངོས་ཡོད་ལ་ཇི་བཞིན། །\nགལ་ཏེ་སེམས་ཅན་སྒྱུ་འདྲ་ན། །ཤི་ནས་ཇི་ལྟར་སྐྱེ་ཞེ་ན། །\nཇི་སྲིད་རྐྱེན་རྣམས་འཚོགས་གྱུར་པ། །དེ་སྲིད་སྒྱུ་མའང་འབྱུང་བར་འགྱུར། །\nརྒྱུན་རིང་ཙམ་གྱིས་ཇི་ལྟར་ན། །སེམས་ཅན་བདེན་པར་ཡོད་པ་ཡིན། །\nསྒྱུ་མའི་སྐྱེས་བུ་བསད་སོགས་ལ། །སེམས་མེད་ཕྱིར་ན་སྡིག་མེད་དེ། །\nསྒྱུ་མའི་སེམས་དང་ལྡན་པ་ལ། །བསོད་ནམས་དང་ནི་སྡིག་པ་འབྱུང་། །\nསྔགས་སོགས་རྣམས་ལ་ནུས་མེད་ཕྱིར། །སྒྱུ་མའི་སེམས་ནི་འབྱུང་བ་མེད། །\nསྣ་ཚོགས་རྐྱེན་ལས་བྱུང་བ་ཡི། །སྒྱུ་མ་དེ་ཡང་སྣ་ཚོགས་ཉིད། །\nརྐྱེན་གཅིག་གིས་ནི་ཀུན་ནུས་པ། །གང་ན་ཡང་ནི་ཡོད་མ་ཡིན། །\nགལ་ཏེ་དོན་དམ་མྱ་ངན་འདས། །འཁོར་བ་ཀུན་རྫོབ་དེ་ལྟ་ན། །\nསངས་རྒྱས་ཀྱང་ནི་འཁོར་འགྱུར་བས། །བྱང་ཆུབ་སྤྱོད་པས་ཅི་ཞིག་བྱ། །\nརྐྱེན་རྣམས་རྒྱུན་ནི་མ་ཆད་ན། །སྒྱུ་མའང་ལྡོག་པར་མི་འགྱུར་གྱི། །\nརྐྱེན་རྣམས་རྒྱུན་ནི་ཆད་པས་ན། །ཀུན་རྫོབ་ཏུ་ཡང་མི་འབྱུང་ངོ་། །\n\nགང་ཚེ་འཁྲུལ་པའང་ཡོད་མིན་ན། །སྒྱུ་མ་གང་གིས་དམིགས་པར་འགྱུར། །\nགང་ཚེ་ཁྱོད་ལ་སྒྱུ་མ་ཉིད། །མེད་ནའང་དེ་ཚེ་ཅི་ཞིག་དམིགས། །\nགལ་ཏེ་དེ་ཉིད་དུ་གཞན་ཡོད། །རྣམ་པ་དེ་ནི་སེམས་ཉིད་ཡིན། །\nགང་ཚེ་སེམས་ཉིད་སྒྱུ་མ་ན། །དེ་ཚེ་གང་ཞིག་གང་གིས་མཐོང་། །\nའཇིག་རྟེན་གྱི་ནི་མགོན་པོས་ཀྱང་། །སེམས་ཀྱིས་སེམས་མི་མཐོང་ཞེས་གསུངས། །\nརལ་གྲི་སོ་ནི་རང་ལ་རང་། །ཇི་ལྟར་མི་གཅོད་དེ་བཞིན་ཡིད། །\nཇི་ལྟར་མར་མེ་རང་གི་དངོས། །ཡང་དག་གསལ་བར་བྱེད་བཞིན་ན། །\nམར་མེ་གསལ་བར་བྱ་མིན་ཏེ། །གང་ཕྱིར་མུན་གྱིས་བསྒྲིབས་པ་མེད། །\nཤེལ་བཞིན་སྔོན་པོ་སྔོ་ཉིད་ལ། །གཞན་ལ་ལྟོས་པ་ཡོད་མ་ཡིན། །\nདེ་བཞིན་འགའ་ཞིག་གཞན་ལ་ནི། །ལྟོས་དང་ལྟོས་མེད་པ་ཡང་མཐོང་། །\nསྔོ་ཉིད་མིན་ལ་སྔོན་པོར་དེ། །བདག་གིས་བདག་ཉིད་བྱས་པ་མེད། །\nམར་མེ་གསལ་བར་བྱེད་དོ་ཞེས། །ཤེས་པས་ཤེས་ཏེ་རྗོད་བྱེད་ན། །\nབློ་ནི་གསལ་བ་ཉིད་ཡིན་ཞེས། །གང་གིས་ཤེས་ནས་དེ་སྐད་བརྗོད། །\nགང་ཚེ་འགས་ཀྱང་མཐོང་མིན་ན། །གསལ་བའམ་ནི་མི་གསལ་བ། །\nམོ་གཤམ་བུ་མོའི་འགྱིང་བག་བཞིན། །དེ་ནི་བརྗོད་ཀྱང་དོན་མེད་དོ། །\nགལ་ཏེ་རང་རིག་ཡོད་མིན་ན། །རྣམ་ཤེས་དྲན་པར་ཇི་ལྟར་འགྱུར། །\nགཞན་མྱོང་བ་ན་འབྲེལ་པ་ལས། །དྲན་འགྱུར་བྱི་བའི་དུག་བཞིན་ནོ། །\nརྐྱེན་གཞན་དག་དང་ལྡན་པ་ནི། །མཐོང་ཕྱིར་རང་ཉིད་རབ་གསལ་ན། །\nགྲུབ་པའི་མིག་སྨན་སྦྱོར་བ་ལས། །བུམ་མཐོང་མིག་སྨན་ཉིད་འགྱུར་མིན། །\nཇི་ལྟར་མཐོང་ཐོས་ཤེས་པ་དག །འདིར་ནི་དགག་པར་བྱ་མིན་ཏེ། །\nའདིར་ནི་སྡུག་བསྔལ་རྒྱུར་གྱུར་པ། །བདེན་པར་རྟོག་པ་བཟློག་བྱ་ཡིན། །\nསེམས་ལས་སྒྱུ་མ་གཞན་མིན་ཞིང་། །གཞན་མིན་པར་ཡང་མི་རྟག་ན། །\nདངོས་ན་ཇི་ལྟར་དེ་གཞན་མིན། །གཞན་མིན་ཞེ་ན་དངོས་པོར་མེད། །\nཇི་ལྟར་སྒྱུ་མ་བདེན་མིན་ཡང་། །བལྟ་བྱ་དེ་བཞིན་ལྟ་བྱེད་ཡིད། །\nགལ་ཏེ་འཁོར་བ་དངོས་རྟེན་ཅན། །དེ་ནི་གཞན་དུ་མཁའ་འདྲར་འགྱུར། །\nདངོས་མེད་དངོས་ལ་བརྟེན་པས་ན། །བྱེད་དང་ལྡན་པར་ཇི་ལྟར་འགྱུར། །\nཁྱོད་ཀྱི་སེམས་ནི་གྲོགས་མེད་པར། །གཅིག་པུ་ཉིད་དུ་འགྱུར་བ་ཡིན། །\nགང་ཚེ་སེམས་ནི་གཟུང་བྲལ་བ། །དེ་ཚེ་ཐམས་ཅད་དེ་བཞིན་གཤེགས། །\nདེ་ལྟ་ན་ཡང་སེམས་ཙམ་དུ། །བརྟགས་ལ་ཡོན་ཏན་ཅི་ཞིག་ཡོད། །\n\nསྒྱུ་མ་ལྟ་བུར་ཤེས་ན་ཡང་། །ཇི་ལྟར་ཉོན་མོངས་ལྡོག་འགྱུར་ཏེ། །\nགང་ཚེ་སྒྱུ་མའི་བུད་མེད་ལ། །དེ་བྱེད་ཉིད་ཀྱང་ཆགས་སྐྱེ་འགྱུར། །\nདེ་བྱེད་པ་ནི་ཤེས་བྱ་ལ། །ཉོན་མོངས་བག་ཆགས་མ་སྤངས་པ། །\nདེས་ན་དེ་མཐོང་བ་ན་དེ། །སྟོང་ཉིད་བག་ཆགས་ཉམ་ཆུང་ཉིད། །\nསྟོང་ཉིད་བག་ཆགས་གོམས་པས་ནི། །དངོས་པོའི་བག་ཆགས་སྤོང་འགྱུར་ཞིང་། །\nཅི་ཡང་མེད་ཅེས་གོམས་པས་ནི། །དེ་ཡང་ཕྱི་ནས་སྤོང་བར་འགྱུར། །\nགང་ཚེ་གང་ཞིག་མེད་དོ་ཞེས། །བརྟག་བྱའི་དངོས་པོ་མི་དམིགས་པ། །\nདེ་ཚེ་དངོས་མེད་རྟེན་བྲལ་བ། །བློ་ཡི་མདུན་ན་ཇི་ལྟར་གནས། །\nགང་ཚེ་དངོས་དང་དངོས་མེད་དག །བློ་ཡི་མདུན་ན་མི་གནས་པ། །\nདེ་ཚེ་རྣམ་པ་གཞན་མེད་པས། །དམིགས་པ་མེད་པར་རབ་ཏུ་ཞི། །\n\nཡིད་བཞིན་ནོར་བུ་དཔག་བསམ་ཤིང་། །ཇི་ལྟར་རེ་བ་ཡོངས་སྐོང་བ། །\nདེ་བཞིན་གདུལ་བྱ་སྨོན་ལམ་གྱི། །དབང་གིས་རྒྱལ་བའི་སྐུར་སྣང་ངོ་། །\nདཔེར་ན་ནམ་མཁའ་ལྡིང་གི་ནི། །མཆོད་སྡོང་བསྒྲུབས་ནས་འདས་གྱུར་པ། །\nདེ་འདས་ཡུན་རིང་ལོན་ཡང་དེ། །དུག་ལ་སོགས་པ་ཞི་བྱེད་བཞིན། །\nབྱང་ཆུབ་སྤྱོད་པའི་རྗེས་མཐུན་པར། །རྒྱལ་བའི་མཆོད་སྡོང་བསྒྲུབས་པ་ཡང་། །\nབྱང་ཆུབ་སེམས་དཔའ་མྱ་ངན་ལས། །འདས་ཀྱང་དོན་རྣམས་ཐམས་ཅད་མཛད། །\nསེམས་མེད་པ་ལ་མཆོད་བྱས་པས། །ཇི་ལྟར་འབྲས་བུ་ལྡན་པར་འགྱུར། །\nགང་ཕྱིར་བཞུགས་པའམ་མྱ་ངན་འདས། །མཚུངས་པ་ཉིད་དུ་བཤད་ཕྱིར་རོ། །\nཀུན་རྫོབ་བམ་ནི་དེ་ཉིད་དུའང་། །རུང་སྟེ་དེར་འབྲས་ལུང་ལས་ཡིན། །\nདཔེར་ན་བདེན་པའི་སངས་རྒྱས་ལ། །ཇི་ལྟར་འབྲས་བུར་བཅས་པ་བཞིན། །\n\nབདེན་པ་མཐོང་བས་གྲོལ་འགྱུར་གྱི། །སྟོང་ཉིད་མཐོང་བས་ཅི་ཞིག་བྱ། །\nགང་ཕྱིར་ལུང་ལས་ལམ་འདི་ནི། །མེད་པར་བྱང་ཆུབ་མེད་པར་གསུངས། །\nགལ་ཏེ་ཐེག་ཆེན་མ་གྲུབ་ན། །ཁྱོད་ཀྱི་ལུང་ནི་ཇི་ལྟར་གྲུབ། །\nགང་ཕྱིར་གཉིས་ཀ་ལ་འདི་གྲུབ། །དང་པོ་ཁྱོད་ལ་འདི་མ་གྲུབ། །\nརྐྱེན་གང་གིས་ནི་དེར་ཡིད་ཆེས། །དེ་ནི་ཐེག་ཆེན་ལ་ཡང་མཚུངས། །\nགཞན་གཉིས་འདོད་པས་བདེན་ན་ནི། །རིག་བྱེད་སོགས་ཀྱང་བདེན་པར་འགྱུར། །\nཐེག་ཆེན་རྩོད་བཅས་ཕྱིར་ཞེ་ན། །ལུང་ལ་མུ་སྟེགས་པ་རྣམས་དང་། །\nལུང་གཞན་ལ་ཡང་རང་གཞན་དག །རྩོད་བཅས་ཡིན་ཕྱིར་དོར་བྱར་འགྱུར། །\nབསྟན་རྩ་དགེ་སློང་ཉིད་ཡིན་ན། །དགེ་སློང་ཉིད་ཀྱང་དཀའ་བར་གནས། །\nསེམས་ནི་དམིགས་དང་བཅས་རྣམས་ཀྱི། །མྱ་ངན་འདས་པའང་དཀའ་བར་གནས། །\nཉོན་མོངས་སྤངས་པས་གྲོལ་ན་དེའི། །དེ་མ་ཐག་ཏུ་དེར་འགྱུར་རོ། །\nཉོན་མོངས་མེད་ཀྱང་དེ་དག་ལ། །ལས་ཀྱི་ནུས་པ་མཐོང་བ་ཡིན། །\nརེ་ཞིག་ཉེར་ལེན་སྲེད་པ་ནི། །མེད་ཅེས་ངེས་པ་ཉིད་ཅེ་ན། །\nསྲེད་དེ་ཉོན་མོངས་ཅན་མིན་ཡང་། །ཀུན་རྨོངས་བཞིན་དུ་ཅི་སྟེ་མེད། །\nཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ་ཡིན། །ཚོར་བ་དེ་དག་ལ་ཡང་ཡོད། །\nདམིགས་པ་དང་ནི་བཅས་པའི་སེམས། །འགའ་ཞིག་ལ་ནི་གནས་པར་འགྱུར། །\nསྟོང་ཉིད་དང་ནི་བྲལ་བའི་སེམས། །འགགས་པ་སླར་ཡང་སྐྱེ་འགྱུར་ཏེ། །\nའདུ་ཤེས་མེད་པའི་སྙོམས་འཇུག་བཞིན། །དེས་ན་སྟོང་ཉིད་བསྒོམ་པར་བྱ། །\n\nངག་གང་མདོ་སྡེ་ལ་འཇུག་དེ། །གལ་ཏེ་སངས་རྒྱས་གསུངས་འདོད་ན། །\nཐེག་ཆེན་ཕལ་ཆེར་ཁྱེད་ཅག་གི །མདོ་དང་མཚུངས་འདོད་མིན་ནམ་ཅི། །\nགལ་ཏེ་མ་གཏོགས་གཅིག་གིས་ནི། །ཐམས་ཅད་སྐྱོན་དང་བཅས་འགྱུར་ན། །\nམདོ་མཚུངས་གཅིག་གིས་ཐམས་ཅད་ནི། །རྒྱལ་བས་གསུངས་པ་ཅིས་མ་ཡིན། །\nངག་གང་འོད་སྲུངས་ཆེན་པོ་ལ། །སོགས་པས་གཏིང་དཔོགས་མ་གྱུར་པ། །\nདེ་ནི་ཁྱོད་ཀྱིས་མ་རྟོགས་པས། །གཟུང་བྱ་མིན་པར་སུ་ཞིག་བྱེད། །\nརྨོངས་པས་སྡུག་བསྔལ་ཅན་དོན་དུ། །ཆགས་དང་འཇིགས་མཐའ་ལས་གྲོལ་བ། །\nའཁོར་བར་གནས་པ་གྲུབ་འགྱུར་བ། །འདི་ནི་སྟོང་ཉིད་འབྲས་བུ་ཡིན། །\nདེ་ལྟར་སྟོང་པ་ཉིད་ཕྱོགས་ལ། །སུན་འབྱིན་པ་ནི་འཐད་མ་ཡིན། །\nདེས་ན་ཐེ་ཚོམ་མི་ཟ་བར། །སྟོང་པ་ཉིད་ནི་བསྒོམ་པར་བྱ། །\nཉོན་མོངས་ཤེས་བྱའི་སྒྲིབ་པ་ཡི། །མུན་པའི་གཉེན་པོ་སྟོང་པ་ཉིད། །\nམྱུར་དུ་ཐམས་ཅད་མཁྱེན་འདོད་པས། །དེ་ནི་ཇི་ལྟར་སྒོམ་མི་བྱེད། །\nདངོས་གང་སྡུག་བསྔལ་སྐྱེད་བྱེད་པ། །དེ་ལས་སྐྲག་པ་སྐྱེ་འགྱུར་ན། །\nསྟོང་ཉིད་སྡུག་བསྔལ་ཞི་བྱེད་པ། །དེ་ལ་འཇིགས་པ་ཇི་ལྟར་སྐྱེ། །\nགལ་ཏེ་བདག་འགའ་ཡོད་ན་ནི། །ཅི་ཡང་རུང་ལས་འཇིགས་འགྱུར་ན། །\nབདག་ཉིད་འགའ་ཡང་ཡོད་མིན་པས། །འཇིགས་པར་འགྱུར་བ་སུ་ཞིག་ཡིན། །\n\nསོ་དང་སྐྲ་སེན་བདག་མ་ཡིན། །བདག་ནི་རུས་པ་ཁྲག་མ་ཡིན། །\nསྣབས་མིན་བད་ཀན་མ་ཡིན་ཏེ། །ཆུ་སེར་དང་ནི་རྣག་ཀྱང་མིན། །\nབདག་ནི་ཞག་དང་རྔུལ་མིན་ཏེ། །གློ་མཆིན་དག་ཀྱང་བདག་མ་ཡིན། །\nནང་ཁྲོལ་གཞན་ཡང་བདག་མིན་ཏེ། །བདག་ནི་ཕྱི་ས་གཅིན་མ་ཡིན། །\nཤ་དང་པགས་པ་བདག་མིན་ཏེ། །དྲོད་དང་རླུང་ཡང་བདག་མ་ཡིན། །\nབུ་ག་བདག་མིན་རྣམ་ཀུན་དུ། །རྣམ་ཤེས་དྲུག་ཀྱང་བདག་མ་ཡིན། །\n\nགལ་ཏེ་སྒྲ་ཡི་ཤེས་རྟག་ན། །ཐམས་ཅད་ཚེ་ན་སྒྲ་འཛིན་འགྱུར། །\nཤེས་བྱ་མེད་ན་ཅི་ཞིག་རིག །གང་གིས་ཤེས་པ་ཞེས་རྗོད་བྱེད། །\nགལ་ཏེ་ཤེས་མེད་ཤེས་ཡིན་ན། །ཤིང་ཡང་ཤེས་པར་ཐལ་བར་འགྱུར། །\nདེས་ན་ཤེས་བྱ་ཉེར་གནས་པ། །མེད་པར་ཤེས་པ་མེད་ཅེས་ངེས། །\nདེ་ཉིད་ཀྱིས་ནི་གཟུགས་ཤེས་ན། །དེ་ཚེ་ཐོས་པའང་ཅི་སྟེ་མིན། །\nགལ་ཏེ་སྒྲ་མི་ཉེ་ཕྱིར་ན། །དེས་ན་དེ་ཡི་ཤེས་པའང་མེད། །\nསྒྲ་འཛིན་རང་བཞིན་གང་ཡིན་པ། །དེ་གཟུགས་འཛིན་པར་ཇི་ལྟར་འགྱུར། །\nགཅིག་ནི་ཕ་དང་བུ་ཉིད་དུ། །བརྟགས་ཡིན་ཡང་དག་ཉིད་མིན་ཏེ། །\nའདི་ལྟར་སྙིང་སྟོབས་རྡུལ་དང་ནི། །མུན་པ་བུ་མིན་ཕ་ཡང་མིན། །\nདེ་ནི་སྒྲ་འཛིན་དང་ལྡན་པའི། །རང་བཞིན་དུ་ནི་མཐོང་མ་ཡིན། །\nགར་མཁན་ལྟ་བུར་ཚུལ་གཞན་གྱིས། །དེ་ཉིད་མཐོང་ན་དེ་རྟག་མིན། །\nགལ་ཏེ་ཚུལ་གཞན་དེ་ཉིད་ན། །གཅིག་ཉིད་དེ་ནི་སྔོན་མེད་གཅིག །\nགལ་ཏེ་ཚུལ་གཞན་བདེན་མིན་ན། །དེ་ཡི་རང་གི་རང་བཞིན་སྨྲོས། །\nཤེས་ཉིད་ཅེ་ན་དེ་ལྟ་ན། །སྐྱེས་ཀུན་གཅིག་ཏུ་ཐལ་བར་འགྱུར། །\nསེམས་པ་སེམས་མེད་དེ་དག་ཀྱང་། །གཅིག་འགྱུར་གང་ཕྱིར་ཡོད་ཉིད་མཚུངས། །\nགང་ཚེ་བྱེ་བྲག་ཕྱིན་ཅི་ལོག །དེ་ཚེ་འདྲ་བའི་རྟེན་གང་ཡིན། །\n\nསེམས་མེད་པ་ཡང་བདག་མིན་ཏེ། །སེམས་མེད་ཉིད་ཕྱིར་བུམ་སོགས་བཞིན། །\nའོན་ཏེ་སེམས་དང་ལྡན་པའི་ཕྱིར། །ཤེས་ན་མི་ཤེས་འཇིག་པར་ཐལ། །\nཇི་སྟེ་བདག་ལ་འགྱུར་མེད་ན། །སེམས་པས་དེ་ལ་ཅི་ཞིག་བྱས། །\nདེ་ལྟར་ཤེས་མེད་བྱ་བྲལ་བ། །ནམ་མཁའ་བདག་ཏུ་བྱས་པར་འགྱུར། །\n\nགལ་ཏེ་བདག་ནི་ཡོད་མིན་ན། །ལས་འབྲས་འབྲེལ་པ་རིགས་མིན་ཏེ། །\nལས་བྱས་ནས་ནི་ཞིག་པས་ན། །སུ་ཡི་ལས་སུ་འགྱུར་ཞེ་ན། །\nབྱ་བ་འབྲས་གཞི་ཐ་དད་དང་། །དེར་བདག་བྱེད་པ་མེད་པར་ཡང་། །\nཡུ་བུ་གཉི་ག་ལ་གྲུབ་པས། །འདིར་བརྩད་དོན་མེད་མ་ཡིན་ནམ། །\nརྒྱུ་ལྡན་འབྲས་བུ་དང་བཅས་ཞེས། །མཐོང་བ་འདི་ནི་སྲིད་མ་ཡིན། །\nརྒྱུད་གཅིག་ལ་ནི་བརྟེན་ནས་སུ། །བྱེད་པོ་སྤྱོད་པོ་ཞེས་བྱར་བསྟན། །\nའདས་དང་མ་འོངས་པ་ཡི་སེམས། །བདག་མིན་དེ་ནི་མེད་པའི་ཕྱིར། །\nའོན་ཏེ་སྐྱེས་སེམས་བདག་ཡིན་ན། །དེ་ཞིག་ན་ཡང་བདག་མེད་དོ། །\n\nདཔེར་ན་ཆུ་ཤིང་སྡོང་པོ་དག །ཆ་ཤས་ཕྱེ་ན་འགའ་མེད་པ། །\nདེ་བཞིན་རྣམ་པར་དཔྱད་པ་ཡིས། །བཙལ་ན་བདག་ཀྱང་ཡང་དག་མིན། །\n\nགལ་ཏེ་སེམས་ཅན་ཡོད་མིན་ན། །སུ་ལ་སྙིང་རྗེ་བྱ་ཞེ་ན། །\nའབྲས་བུའི་དོན་དུ་ཁས་བླངས་པའི། །རྨོངས་པས་བརྟགས་པ་གང་ཡིན་པའོ། །\nསེམས་ཅན་མེད་འབྲས་སུ་ཡི་ཡིན། །བདེན་ཏེ་འོན་ཀྱང་རྨོངས་ལས་འདོད། །\nསྡུག་བསྔལ་ཉེ་བར་ཞི་དོན་དུ། །འབྲས་བུའི་རྨོངས་པ་བཟློག་མི་བྱ། །\nསྡུག་བསྔལ་རྒྱུ་ཡི་ང་རྒྱལ་ནི། །བདག་ཏུ་རྨོངས་པས་འཕེལ་བར་འགྱུར། །\nདེ་ལས་ཀྱང་བཟློག་མེད་ཅེ་ན། །བདག་མེད་བསྒོམ་པ་མཆོག་ཡིན་ནོ། །\n\nལུས་ནི་རྐང་པ་བྱིན་པ་མིན། །བརླ་དང་རྐེད་པའང་ལུས་མ་ཡིན། །\nལྟོ་དང་རྒྱབ་ཀྱང་ལུས་མིན་ཏེ། །བྲང་དང་དཔུང་པའང་ལུས་མ་ཡིན། །\nརྩིབ་ལོགས་ལག་པའང་ལུས་མིན་ཏེ། །མཆན་ཁུང་ཕྲག་པའང་ལུས་མ་ཡིན། །\nནང་ཁྲོལ་རྣམས་ཀྱང་དེ་མིན་ལ། །མགོ་དང་མགྲིན་པའང་ལུས་མིན་ན། །\nའདི་ལ་ལུས་ནི་གང་ཞིག་ཡིན། །གལ་ཏེ་ལུས་འདི་ཐམས་ཅད་ལ། །\nཕྱོགས་རེ་ཡིས་ནི་གནས་གྱུར་ན། །ཆ་རྣམས་ཆ་ལ་གནས་གྱུར་མོད། །\nདེ་རང་ཉིད་ནི་གང་ལ་གནས། །གལ་ཏེ་བདག་ཉིད་ཀུན་གྱི་ལུས། །\nལག་སོགས་རྣམས་ལ་གནས་ན་ནི། །ལག་སོགས་དེ་དག་ཇི་སྙེད་པ། །\nདེ་སྙེད་ཀྱི་ནི་ལུས་སུ་འགྱུར། །ཕྱི་དང་ནང་ན་ལུས་མེད་ན། །\nཇི་ལྟར་ལག་སོགས་ལ་ལུས་ཡོད། །ལག་སོགས་རྣམས་ལས་གཞན་མེད་ན། །\nདེ་ནི་ཇི་ལྟར་ཡོད་པ་ཡིན། །དེས་ན་ལུས་མེད་ལག་སོགས་ལ། །\nརྨོངས་པ་ཡིས་ནི་ལུས་བློར་འགྱུར། །དབྱིབས་སུ་བཀོད་པའི་ཁྱད་པར་གྱིས། །\nཐོ་ཡོར་ལ་ནི་མི་བློ་བཞིན། །ཇི་སྲིད་རྐྱེན་ཚོགས་དེ་སྲིད་དུ། །\nལུས་ནི་སྐྱེས་བུ་ལྟར་སྣང་བ། །དེ་བཞིན་ཇི་སྲིད་ལག་སོགས་ལ། །\nདེ་ཡོད་དེ་སྲིད་དེར་ལུས་སྣང་། །\n\nདེ་བཞིན་སོར་མོའི་ཚོགས་ཡིན་ཕྱིར། །ལག་པའང་གང་ཞིག་ཡིན་པར་འགྱུར། །\nདེ་ཡང་ཚིགས་ཀྱི་ཚོགས་ཡིན་ཕྱིར། །ཚིགས་ཀྱང་རང་གི་ཆ་ཕྱེ་བས། །\nཆ་ཡང་རྡུལ་དུ་ཕྱེ་བས་ཏེ། །རྡུལ་དེའང་ཕྱོགས་ཆའི་དབྱེ་བ་ཡིས། །\nཕྱོགས་དབྱེའང་ཆ་ཤས་དང་བྲལ་ཕྱིར། །མཁའ་བཞིན་དེས་ན་རྡུལ་ཡང་མེད། །\n\nདེ་ལྟར་རྨི་ལམ་ལྟ་བུ་ཡི། །གཟུགས་ལ་དཔྱོད་ལྡན་སུ་ཞིག་ཆགས། །\nགང་ཚེ་དེ་ལྟར་ལུས་མེད་པ། །དེ་ཚེ་སྐྱེས་གང་བུད་མེད་གང་། །\n\nསྡུག་བསྔལ་དེ་ཉིད་དུ་ཡོད་ན། །ཅི་སྟེ་རབ་དགའ་ལ་མི་གནོད། །\nབདེ་ན་མྱ་ངན་གདུང་སོགས་ལ། །ཞིམ་སོགས་ཅི་སྟེ་དགའ་མི་བྱེད། །\nསྟོབས་དང་ལྡན་པས་ཟིལ་མནན་ཕྱིར། །གལ་ཏེ་དེ་མྱོང་མ་ཡིན་ན། །\nགང་ཞིག་ཉམས་མྱོང་བདག་ཉིད་མིན། །དེ་ནི་ཚོར་བ་ཇི་ལྟར་ཡིན། །\nསྡུག་བསྔལ་ཕྲ་མོ་ཉིད་དུ་ཡོད། །འདི་ཡི་རགས་པ་བསལ་མིན་ནམ། །\nདེ་ནི་དེ་ལས་གཞན་དགའ་ཙམ། །ཞེ་ན་ཕྲ་ཉིད་དེ་ཡང་དེའི། །\nགལ་ཏེ་འགལ་རྐྱེན་སྐྱེས་པས་ན། །སྡུག་བསྔལ་སྐྱེས་པ་མིན་ན་ནི། །\nཚོར་བར་རྟོག་པ་མངོན་ཞེན་ཉིད། །ཡིན་ཞེས་བྱ་བར་གྲུབ་མིན་ནམ། །\nདེ་ཉིད་ཕྱིར་ན་འདི་ཡི་ནི། །གཉེན་པོ་རྣམ་དཔྱོད་འདི་བསྒོམ་སྟེ། །\nརྣམ་བརྟགས་ཞིང་ལས་བྱུང་བ་ཡི། །བསམ་གཏན་རྣལ་འབྱོར་པ་ཡི་ཟས། །\n\nགལ་ཏེ་དབང་དོན་བར་བཅས་ན། །དེ་དག་གང་དུ་ཕྲད་པར་འགྱུར། །\nབར་མེད་ན་ཡང་གཅིག་ཉིད་དེ། །གང་ཞིག་གང་དང་ཕྲད་པར་འགྱུར། །\nརྡུལ་ཕྲན་རྡུལ་ཕྲན་ལ་འཇུག་མེད། །དེ་ནི་སྐབས་མེད་མཉམ་པ་ཡིན། །\nམ་ཞུགས་པ་ལ་འདྲེས་མེད་ཅིང་། །མ་འདྲེས་པ་ལ་ཕྲད་པ་མེད། །\nཆ་མེད་པ་ལའང་ཕྲད་པ་ཞེས། །བྱ་བ་ཇི་ལྟར་འཐད་པར་འགྱུར། །\nཕྲད་པ་དང་ནི་ཆ་མེད་པར། །གལ་ཏེ་མཐོང་ན་བསྟན་པར་གྱིས། །\nརྣམ་ཤེས་ལུས་མེད་པ་ལ་ནི། །ཕྲད་པ་འཐད་པ་མ་ཡིན་ཉིད། །\nཚོགས་པའང་དངོས་པོ་མེད་ཕྱིར་ཏེ། །སྔར་ནི་ཇི་ལྟར་རྣམ་དཔྱད་བཞིན། །\n\nདེ་ལྟར་རེག་པ་ཡོད་མིན་ན། །ཚོར་བ་གང་ལས་འབྱུང་བར་འགྱུར། །\nངལ་འདི་ཅི་ཡི་དོན་དུ་ཡིན། །གང་གིས་གང་ལ་གནོད་པར་འགྱུར། །\n\nགང་ཚེ་ཚོར་པོ་འགའ་མེད་ཅིང་། །ཚོར་བའང་ཡོད་པ་མ་ཡིན་པ། །\nདེ་ཚེ་གནས་སྐབས་འདི་མཐོང་ནས། །སྲེད་པ་ཅི་ཕྱིར་ལྡོག་མི་འགྱུར། །\nམཐོང་བ་འམ་ནི་རེག་པ་ཡང་། །རྨི་ལམ་སྒྱུ་འདྲའི་བདག་ཉིད་ཀྱིས། །\nསེམས་དང་ལྷན་ཅིག་སྐྱེས་པའི་ཕྱིར། །ཚོར་བ་དེ་ཡིས་མཐོང་མ་ཡིན། །\nསྔར་དང་ཕྱི་མར་སྐྱེས་པས་ཀྱང་། །དྲན་པར་འགྱུར་གྱི་མྱོང་མ་ཡིན། །\nརང་གིས་བདག་ཉིད་མྱོང་མིན་ལ། །གཞན་དག་གིས་ཀྱང་མྱོང་མ་ཡིན། །\n༔ཚོར་པོ་འགའ་ཡང་ཡོད་མིན་ཏེ། །དེས་ན་ཚོར་བ་དེ་ཉིད་མིན། །\nདེ་ལྟར་བདག་མེད་ཚོགས་འདི་ལ། །འདི་ཡིས་ཅི་སྟེ་གནོད་པར་བྱ། །\n\nཡིད་ནི་དབང་རྣམས་ལ་མི་གནས། །གཟུགས་སོགས་ལ་མིན་བར་ནའང་མིན། །\nནང་ཡང་སེམས་མིན་ཕྱི་མིན་ཞིང་། །གཞན་དུ་ཡང་ནི་རྙེད་མ་ཡིན། །\nགང་ཞིག་ལུས་མིན་གཞན་དུ་མིན། །འདྲེས་མིན་ལོགས་སུའང་འགར་མེད་པ། །\nདེ་ནི་ཅུང་ཟད་མིན་དེའི་ཕྱིར། །སེམས་ཅན་རང་བཞིན་མྱ་ངན་འདས། །\n\nཤེས་བྱ་ལས་སྔར་ཤེས་ཡོད་ན། །དེ་ནི་ཅི་ལ་དམིགས་ནས་སྐྱེ། །\nཤེས་དང་ཤེས་བྱ་ལྷན་ཅིག་ན། །དེ་ནི་ཅི་ལ་དམིགས་ནས་སྐྱེ། །\nའོན་ཏེ་ཤེས་བྱའི་ཕྱིས་ཡོད་ན། །དེ་ཚེ་ཤེས་པ་གང་ལས་སྐྱེ། །\n\nདེ་ལྟར་ཆོས་རྣམས་ཐམས་ཅད་ཀྱི། །སྐྱེ་བ་རྟོགས་པར་འགྱུར་མ་ཡིན། །\n\nགལ་ཏེ་དེ་ལྟར་ཀུན་རྫོབ་མེད། །དེ་ལ་བདེན་གཉིས་ག་ལ་ཡོད། །\nདེ་ཡང་ཀུན་རྫོབ་གཞན་གྱིས་ན། །སེམས་ཅན་མྱ་ངན་ག་ལ་འདའ། །\nའདི་ནི་གཞན་སེམས་རྣམ་རྟོག་སྟེ། །དེ་ནི་རང་གི་ཀུན་རྫོབ་མིན། །\nཕྱིས་དེ་ངེས་ན་དེ་ཡོད་དེ། །མིན་ན་ཀུན་རྫོབ་མེད་པ་ཉིད། །\n\nརྟོག་དང་བརྟག་པར་བྱ་བ་དག །གཉིས་པོ་ཕན་ཚུན་བརྟེན་པ་ཡིན། །\nཇི་ལྟར་གྲགས་པ་ལ་བརྟེན་ནས། །རྣམ་པར་དཔྱད་པ་ཐམས་ཅད་བརྗོད། །\n\nགང་ཚེ་རྣམ་པར་དཔྱད་པ་ཡི། །རྣམ་དཔྱོད་ཀྱིས་ནི་དཔྱོད་བྱེད་ན། །\nདེ་ཚེ་རྣམ་དཔྱོད་དེ་ཡང་ནི། །རྣམ་དཔྱོད་ཕྱིར་ན་ཐུག་པ་མེད། །\nདཔྱད་བྱ་རྣམ་པར་དཔྱད་བྱས་ན། །རྣམ་དཔྱོད་ལ་ནི་རྟེན་ཡོད་མིན། །\nརྟེན་མེད་ཕྱིར་ན་མི་སྐྱེ་སྟེ། །དེ་ཡང་མྱ་ངན་འདས་པར་བརྗོད། །\n\nདེ་ལྟར་སྟོང་པའི་དངོས་རྣམས་ལ། །ཐོབ་པ་ཅི་ཡོད་ཤོར་ཅི་ཡོད། །\nགང་གིས་རིམ་གྲོ་བྱས་པའམ། །ཡོངས་སུ་བརྙས་པའང་ཅི་ཞིག་ཡོད། །\nབདེ་བའང་སྡུག་བསྔལ་གང་ལས་ཡིན། །མི་དགར་ཅི་ཡོད་དགར་ཅི་ཡོད། །\nདེ་ཉིད་དུ་ནི་བཙལ་བྱས་ན། །གང་ཞིག་སྲེད་ཅིང་གང་ལ་སྲེད། །\nདཔྱད་ན་གསོན་པོའི་འཇིག་རྟེན་འདི། །གང་ཞིག་འདིར་ནི་འཆི་འགྱུར་ཏེ། །\nའབྱུང་འགྱུར་གང་ཡིན་བྱུང་གྱུར་གང་། །གཉེན་དང་བཤེས་ཀྱང་གང་ཞིག་ཡིན། །\nཐམས་ཅད་ནམ་མཁའ་འདྲ་བར་ནི། །བདག་འདྲས་ཡོངས་སུ་གཟུང་བར་གྱིས། །\nབདག་ཉིད་བདེ་བར་འདོད་རྣམས་ནི། །འཐབ་དང་སྤྲོ་བའི་རྒྱུ་དག་གིས། །\nརབ་ཏུ་འཁྲུག་དང་དགའ་བར་བྱེད། །མྱ་ངན་འབད་རྩོལ་རྩོད་པ་དང་། །\nཕན་ཚུན་གཅོད་དང་འབིགས་པ་དང་། །སྡིག་དག་གིས་ནི་ཚེགས་ཆེན་འཚོ། །\n\nབདེ་འགྲོར་ཡང་དང་ཡང་འོངས་ཏེ། །བདེ་བ་མང་པོ་སྤྱད་སྤྱད་ནས། །\nཤི་ནས་ངན་སོང་སྡུག་བསྔལ་ནི། །ཡུན་རིང་མི་བཟད་རྣམས་སུ་ལྟུང་། །\nསྲིད་པ་ན་ནི་གཡང་ས་མང་། །དེར་ནི་དེ་ཉིད་མིན་འདི་འདྲ། །\nདེར་ཡང་ཕན་ཚུན་འགལ་བས་ན། །སྲིད་ན་དེ་ཉིད་འདི་འདྲ་མེད། །\nདེ་ཡང་དཔེ་མེད་མི་བཟད་པའི། །སྡུག་བསྔལ་རྒྱ་མཚོ་མཐའ་ལས་འདས། །\nདེར་ནི་དེ་ལྟར་སྟོབས་ཆུང་ཞིང་། །དེར་ནི་ཚེ་ཡང་ཐུང་བ་ཉིད། །\nདེར་ཡང་གསོན་དང་ནད་མེད་ཀྱི། །བྱེད་དང་བཀྲེས་ནའི་ངལ་བ་དང་། །\nགཉིད་དང་འཚེ་དང་དེ་བཞིན་དུ། །བྱིས་དང་འགྲོགས་པ་དོན་མེད་ཀྱིས། །\nཚེ་ནི་དོན་མེད་མྱུར་འདའ་ཡི། །རྣམ་དཔྱོད་ཤིན་ཏུ་རྙེད་པར་དཀའ། །\nདེར་ཡང་རྣམ་གཡེང་གོམས་པ་ནི། །བཟློག་པའི་ཐབས་ནི་ག་ལ་ཡོད། །\nདེར་ཡང་ངན་སོང་ཆེན་པོར་ནི། །ལྟུང་ཕྱིར་བདུད་ནི་བརྩོན་པར་བྱེད། །\nདེར་ནི་ལོག་པའི་ལམ་མང་ཞིང་། །ཐེ་ཚོམ་ལས་ཀྱང་བརྒལ་དཀའ་སྟེ། །\nསླར་ཡང་དལ་བ་རྙེད་དཀའ་ཞིང་། །སངས་རྒྱས་འབྱུང་རྙེད་ཤིན་ཏུ་དཀའ། །\nཉོན་མོངས་ཆུ་བོ་སྤང་དཀའ་སྟེ། །ཨེ་མ་སྡུག་བསྔལ་བརྒྱུད་པར་འགྱུར། །\nདེ་ལྟར་ཤིན་ཏུ་སྡུག་བསྔལ་ཡང་། །རང་སྡུག་མི་མཐོང་གང་ཡིན་པ། །\nསྡུག་བསྔལ་ཆུ་བོར་གནས་འདི་དག །ཀྱི་ཧུད་མྱ་ངན་བྱ་བར་འོས། །\nདཔེར་ན་འགའ་ཞིག་ཡང་ཡང་ཁྲུས། །བྱས་ཏེ་ཡང་ཡང་མེར་འཇུག་པ། །\nདེ་ལྟར་ཤིན་ཏུ་སྡུག་བསྔལ་བར། །གནས་ཀྱང་བདག་ཉིད་བདེར་རློམ་བཞིན། །\nདེ་ལྟར་རྒ་དང་འཆི་མེད་པ། །བཞིན་དུ་སྤྱོད་པས་གནས་རྣམས་ལ། །\nདང་པོ་ཉིད་དུ་བསད་བྱས་ནས། །ངན་སོང་ལྟུང་བ་མི་བཟད་འོང་། །\nདེ་ལྟར་སྡུག་བསྔལ་མེས་གདུངས་ལ། །བསོད་ནམས་སྤྲིན་ལས་ལེགས་འཁྲུངས་པའི། །\nརང་གི་བདེ་བའི་ཚོགས་ཆར་གྱིས། །ཞི་བྱེད་པར་བདག་ནམ་ཞིག་འགྱུར། །\nནམ་ཞིག་དམིགས་པ་མེད་ཚུལ་དུ། །གུས་པས་བསོད་ནམས་ཚོགས་བསགས་ཏེ། །\nདམིགས་པས་ཕུང་བར་འགྱུར་རྣམས་ལ། །སྟོང་པ་ཉིད་ནི་སྟོན་པར་འགྱུར། །",
        "children": [
          {
            "level": "subsection",
            "number": "9.2.1",
            "title": "ལྟ་བས་གཏན་ལ་ཕབ་པ། (Establishing Through View)",
            "verses_span": "3-89",
            "verse_text_excerpt": "ཀུན་རྫོབ་དང་ནི་དོན་དམ་སྟེ། །འདི་ནི་བདེན་པ་གཉིས་སུ་འདོད། །\n\nདོན་དམ་བློ་ཡི་སྤྱོད་ཡུལ་མིན། །བློ་ནི་ཀུན་རྫོབ་ཡིན་པར་བརྗོད། །\n\nདེ་ལ་འཇིག་རྟེན་རྣམ་གཉིས་མཐོང་། །རྣལ་འབྱོར་པ་དང་ཕལ་པའོ། །\nདེ་ལ་འཇིག་རྟེན་ཕལ་པ་ནི། །རྣལ་འབྱོར་འཇིག་རྟེན་གྱིས་གནོད་ཅིང་། །\nརྣལ་འབྱོར་པ་ཡང་བློ་ཁྱད་ཀྱིས། །གོང་མ་གོང་མ་རྣམས་ཀྱིས་གནོད། །\n\nགཉི་ག་ཡང་ནི་འདོད་པའི་དཔེས། །འབྲས་བུའི་དོན་དུ་མ་དཔྱད་ཕྱིར། །\nའཇིག་རྟེན་པ་ཡིས་དངོས་མཐོང་ཞིང་། །ཡང་དག་ཉིད་དུའང་རྟོག་བྱེད་ཀྱི། །\nསྒྱུ་མ་ལྟ་བུར་མིན་པས་འདིར། །རྣལ་འབྱོར་པ་དང་འཇིག་རྟེན་རྩོད། །\n\nགཟུགས་སོགས་མངོན་སུམ་ཉིད་ཀྱང་ནི། །གྲགས་པས་ཡིན་གྱི་ཚད་མས་མིན། །\nདེ་ནི་མི་གཙང་ལ་སོགས་ལ། །གཙང་སོགས་གྲགས་པ་བཞིན་དུ་རྫུན། །\nའཇིག་རྟེན་གཞུག་པའི་དོན་དུ་ནི། །མགོན་པོས་དངོས་བསྟན་དེ་ཉིད་དུ། །\nདེ་དག་སྐད་ཅིག་མ་ཉིད་མིན། །ཀུན་རྫོབ་ཏུ་ཡང་འགལ་ཞེ་ན། །\nརྣལ་འབྱོར་ཀུན་རྫོབ་ཉེས་མེད་དེ། །འཇིག་རྟེན་ལ་ལྟོས་དེ་ཉིད་མཐོང་། །\nགཞན་དུ་བུད་མེད་མི་གཙང་བར། །དེས་རྟོག་འཇིག་རྟེན་གྱིས་གནོད་འགྱུར། །\nསྒྱུ་འདྲའི་རྒྱལ་ལས་བསོད་ནམས་ནི། །ཇི་ལྟར་དངོས་ཡོད་ལ་ཇི་བཞིན། །\nགལ་ཏེ་སེམས་ཅན་སྒྱུ་འདྲ་ན། །ཤི་ནས་ཇི་ལྟར་སྐྱེ་ཞེ་ན། །\nཇི་སྲིད་རྐྱེན་རྣམས་འཚོགས་གྱུར་པ། །དེ་སྲིད་སྒྱུ་མའང་འབྱུང་བར་འགྱུར། །\nརྒྱུན་རིང་ཙམ་གྱིས་ཇི་ལྟར་ན། །སེམས་ཅན་བདེན་པར་ཡོད་པ་ཡིན། །\nསྒྱུ་མའི་སྐྱེས་བུ་བསད་སོགས་ལ། །སེམས་མེད་ཕྱིར་ན་སྡིག་མེད་དེ། །\nསྒྱུ་མའི་སེམས་དང་ལྡན་པ་ལ། །བསོད་ནམས་དང་ནི་སྡིག་པ་འབྱུང་། །\nསྔགས་སོགས་རྣམས་ལ་ནུས་མེད་ཕྱིར། །སྒྱུ་མའི་སེམས་ནི་འབྱུང་བ་མེད། །\nསྣ་ཚོགས་རྐྱེན་ལས་བྱུང་བ་ཡི། །སྒྱུ་མ་དེ་ཡང་སྣ་ཚོགས་ཉིད། །\nརྐྱེན་གཅིག་གིས་ནི་ཀུན་ནུས་པ། །གང་ན་ཡང་ནི་ཡོད་མ་ཡིན། །\nགལ་ཏེ་དོན་དམ་མྱ་ངན་འདས། །འཁོར་བ་ཀུན་རྫོབ་དེ་ལྟ་ན། །\nསངས་རྒྱས་ཀྱང་ནི་འཁོར་འགྱུར་བས། །བྱང་ཆུབ་སྤྱོད་པས་ཅི་ཞིག་བྱ། །\nརྐྱེན་རྣམས་རྒྱུན་ནི་མ་ཆད་ན། །སྒྱུ་མའང་ལྡོག་པར་མི་འགྱུར་གྱི། །\nརྐྱེན་རྣམས་རྒྱུན་ནི་ཆད་པས་ན། །ཀུན་རྫོབ་ཏུ་ཡང་མི་འབྱུང་ངོ་། །\n\nགང་ཚེ་འཁྲུལ་པའང་ཡོད་མིན་ན། །སྒྱུ་མ་གང་གིས་དམིགས་པར་འགྱུར། །\nགང་ཚེ་ཁྱོད་ལ་སྒྱུ་མ་ཉིད། །མེད་ནའང་དེ་ཚེ་ཅི་ཞིག་དམིགས། །\nགལ་ཏེ་དེ་ཉིད་དུ་གཞན་ཡོད། །རྣམ་པ་དེ་ནི་སེམས་ཉིད་ཡིན། །\nགང་ཚེ་སེམས་ཉིད་སྒྱུ་མ་ན། །དེ་ཚེ་གང་ཞིག་གང་གིས་མཐོང་། །\nའཇིག་རྟེན་གྱི་ནི་མགོན་པོས་ཀྱང་། །སེམས་ཀྱིས་སེམས་མི་མཐོང་ཞེས་གསུངས། །\nརལ་གྲི་སོ་ནི་རང་ལ་རང་། །ཇི་ལྟར་མི་གཅོད་དེ་བཞིན་ཡིད། །\nཇི་ལྟར་མར་མེ་རང་གི་དངོས། །ཡང་དག་གསལ་བར་བྱེད་བཞིན་ན། །\nམར་མེ་གསལ་བར་བྱ་མིན་ཏེ། །གང་ཕྱིར་མུན་གྱིས་བསྒྲིབས་པ་མེད། །\nཤེལ་བཞིན་སྔོན་པོ་སྔོ་ཉིད་ལ། །གཞན་ལ་ལྟོས་པ་ཡོད་མ་ཡིན། །\nདེ་བཞིན་འགའ་ཞིག་གཞན་ལ་ནི། །ལྟོས་དང་ལྟོས་མེད་པ་ཡང་མཐོང་། །\nསྔོ་ཉིད་མིན་ལ་སྔོན་པོར་དེ། །བདག་གིས་བདག་ཉིད་བྱས་པ་མེད། །\nམར་མེ་གསལ་བར་བྱེད་དོ་ཞེས། །ཤེས་པས་ཤེས་ཏེ་རྗོད་བྱེད་ན། །\nབློ་ནི་གསལ་བ་ཉིད་ཡིན་ཞེས། །གང་གིས་ཤེས་ནས་དེ་སྐད་བརྗོད། །\nགང་ཚེ་འགས་ཀྱང་མཐོང་མིན་ན། །གསལ་བའམ་ནི་མི་གསལ་བ། །\nམོ་གཤམ་བུ་མོའི་འགྱིང་བག་བཞིན། །དེ་ནི་བརྗོད་ཀྱང་དོན་མེད་དོ། །\nགལ་ཏེ་རང་རིག་ཡོད་མིན་ན། །རྣམ་ཤེས་དྲན་པར་ཇི་ལྟར་འགྱུར། །\nགཞན་མྱོང་བ་ན་འབྲེལ་པ་ལས། །དྲན་འགྱུར་བྱི་བའི་དུག་བཞིན་ནོ། །\nརྐྱེན་གཞན་དག་དང་ལྡན་པ་ནི། །མཐོང་ཕྱིར་རང་ཉིད་རབ་གསལ་ན། །\nགྲུབ་པའི་མིག་སྨན་སྦྱོར་བ་ལས། །བུམ་མཐོང་མིག་སྨན་ཉིད་འགྱུར་མིན། །\nཇི་ལྟར་མཐོང་ཐོས་ཤེས་པ་དག །འདིར་ནི་དགག་པར་བྱ་མིན་ཏེ། །\nའདིར་ནི་སྡུག་བསྔལ་རྒྱུར་གྱུར་པ། །བདེན་པར་རྟོག་པ་བཟློག་བྱ་ཡིན། །\nསེམས་ལས་སྒྱུ་མ་གཞན་མིན་ཞིང་། །གཞན་མིན་པར་ཡང་མི་རྟག་ན། །\nདངོས་ན་ཇི་ལྟར་དེ་གཞན་མིན། །གཞན་མིན་ཞེ་ན་དངོས་པོར་མེད། །\nཇི་ལྟར་སྒྱུ་མ་བདེན་མིན་ཡང་། །བལྟ་བྱ་དེ་བཞིན་ལྟ་བྱེད་ཡིད། །\nགལ་ཏེ་འཁོར་བ་དངོས་རྟེན་ཅན། །དེ་ནི་གཞན་དུ་མཁའ་འདྲར་འགྱུར། །\nདངོས་མེད་དངོས་ལ་བརྟེན་པས་ན། །བྱེད་དང་ལྡན་པར་ཇི་ལྟར་འགྱུར། །\nཁྱོད་ཀྱི་སེམས་ནི་གྲོགས་མེད་པར། །གཅིག་པུ་ཉིད་དུ་འགྱུར་བ་ཡིན། །\nགང་ཚེ་སེམས་ནི་གཟུང་བྲལ་བ། །དེ་ཚེ་ཐམས་ཅད་དེ་བཞིན་གཤེགས། །\nདེ་ལྟ་ན་ཡང་སེམས་ཙམ་དུ། །བརྟགས་ལ་ཡོན་ཏན་ཅི་ཞིག་ཡོད། །\n\nསྒྱུ་མ་ལྟ་བུར་ཤེས་ན་ཡང་། །ཇི་ལྟར་ཉོན་མོངས་ལྡོག་འགྱུར་ཏེ། །\nགང་ཚེ་སྒྱུ་མའི་བུད་མེད་ལ། །དེ་བྱེད་ཉིད་ཀྱང་ཆགས་སྐྱེ་འགྱུར། །\nདེ་བྱེད་པ་ནི་ཤེས་བྱ་ལ། །ཉོན་མོངས་བག་ཆགས་མ་སྤངས་པ། །\nདེས་ན་དེ་མཐོང་བ་ན་དེ། །སྟོང་ཉིད་བག་ཆགས་ཉམ་ཆུང་ཉིད། །\nསྟོང་ཉིད་བག་ཆགས་གོམས་པས་ནི། །དངོས་པོའི་བག་ཆགས་སྤོང་འགྱུར་ཞིང་། །\nཅི་ཡང་མེད་ཅེས་གོམས་པས་ནི། །དེ་ཡང་ཕྱི་ནས་སྤོང་བར་འགྱུར། །\nགང་ཚེ་གང་ཞིག་མེད་དོ་ཞེས། །བརྟག་བྱའི་དངོས་པོ་མི་དམིགས་པ། །\nདེ་ཚེ་དངོས་མེད་རྟེན་བྲལ་བ། །བློ་ཡི་མདུན་ན་ཇི་ལྟར་གནས། །\nགང་ཚེ་དངོས་དང་དངོས་མེད་དག །བློ་ཡི་མདུན་ན་མི་གནས་པ། །\nདེ་ཚེ་རྣམ་པ་གཞན་མེད་པས། །དམིགས་པ་མེད་པར་རབ་ཏུ་ཞི། །\n\nཡིད་བཞིན་ནོར་བུ་དཔག་བསམ་ཤིང་། །ཇི་ལྟར་རེ་བ་ཡོངས་སྐོང་བ། །\nདེ་བཞིན་གདུལ་བྱ་སྨོན་ལམ་གྱི། །དབང་གིས་རྒྱལ་བའི་སྐུར་སྣང་ངོ་། །\nདཔེར་ན་ནམ་མཁའ་ལྡིང་གི་ནི། །མཆོད་སྡོང་བསྒྲུབས་ནས་འདས་གྱུར་པ། །\nདེ་འདས་ཡུན་རིང་ལོན་ཡང་དེ། །དུག་ལ་སོགས་པ་ཞི་བྱེད་བཞིན། །\nབྱང་ཆུབ་སྤྱོད་པའི་རྗེས་མཐུན་པར། །རྒྱལ་བའི་མཆོད་སྡོང་བསྒྲུབས་པ་ཡང་། །\nབྱང་ཆུབ་སེམས་དཔའ་མྱ་ངན་ལས། །འདས་ཀྱང་དོན་རྣམས་ཐམས་ཅད་མཛད། །\nསེམས་མེད་པ་ལ་མཆོད་བྱས་པས། །ཇི་ལྟར་འབྲས་བུ་ལྡན་པར་འགྱུར། །\nགང་ཕྱིར་བཞུགས་པའམ་མྱ་ངན་འདས། །མཚུངས་པ་ཉིད་དུ་བཤད་ཕྱིར་རོ། །\nཀུན་རྫོབ་བམ་ནི་དེ་ཉིད་དུའང་། །རུང་སྟེ་དེར་འབྲས་ལུང་ལས་ཡིན། །\nདཔེར་ན་བདེན་པའི་སངས་རྒྱས་ལ། །ཇི་ལྟར་འབྲས་བུར་བཅས་པ་བཞིན། །\n\nབདེན་པ་མཐོང་བས་གྲོལ་འགྱུར་གྱི། །སྟོང་ཉིད་མཐོང་བས་ཅི་ཞིག་བྱ། །\nགང་ཕྱིར་ལུང་ལས་ལམ་འདི་ནི། །མེད་པར་བྱང་ཆུབ་མེད་པར་གསུངས། །\nགལ་ཏེ་ཐེག་ཆེན་མ་གྲུབ་ན། །ཁྱོད་ཀྱི་ལུང་ནི་ཇི་ལྟར་གྲུབ། །\nགང་ཕྱིར་གཉིས་ཀ་ལ་འདི་གྲུབ། །དང་པོ་ཁྱོད་ལ་འདི་མ་གྲུབ། །\nརྐྱེན་གང་གིས་ནི་དེར་ཡིད་ཆེས། །དེ་ནི་ཐེག་ཆེན་ལ་ཡང་མཚུངས། །\nགཞན་གཉིས་འདོད་པས་བདེན་ན་ནི། །རིག་བྱེད་སོགས་ཀྱང་བདེན་པར་འགྱུར། །\nཐེག་ཆེན་རྩོད་བཅས་ཕྱིར་ཞེ་ན། །ལུང་ལ་མུ་སྟེགས་པ་རྣམས་དང་། །\nལུང་གཞན་ལ་ཡང་རང་གཞན་དག །རྩོད་བཅས་ཡིན་ཕྱིར་དོར་བྱར་འགྱུར། །\nབསྟན་རྩ་དགེ་སློང་ཉིད་ཡིན་ན། །དགེ་སློང་ཉིད་ཀྱང་དཀའ་བར་གནས། །\nསེམས་ནི་དམིགས་དང་བཅས་རྣམས་ཀྱི། །མྱ་ངན་འདས་པའང་དཀའ་བར་གནས། །\nཉོན་མོངས་སྤངས་པས་གྲོལ་ན་དེའི། །དེ་མ་ཐག་ཏུ་དེར་འགྱུར་རོ། །\nཉོན་མོངས་མེད་ཀྱང་དེ་དག་ལ། །ལས་ཀྱི་ནུས་པ་མཐོང་བ་ཡིན། །\nརེ་ཞིག་ཉེར་ལེན་སྲེད་པ་ནི། །མེད་ཅེས་ངེས་པ་ཉིད་ཅེ་ན། །\nསྲེད་དེ་ཉོན་མོངས་ཅན་མིན་ཡང་། །ཀུན་རྨོངས་བཞིན་དུ་ཅི་སྟེ་མེད། །\nཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ་ཡིན། །ཚོར་བ་དེ་དག་ལ་ཡང་ཡོད། །\nདམིགས་པ་དང་ནི་བཅས་པའི་སེམས། །འགའ་ཞིག་ལ་ནི་གནས་པར་འགྱུར། །\nསྟོང་ཉིད་དང་ནི་བྲལ་བའི་སེམས། །འགགས་པ་སླར་ཡང་སྐྱེ་འགྱུར་ཏེ། །\nའདུ་ཤེས་མེད་པའི་སྙོམས་འཇུག་བཞིན། །དེས་ན་སྟོང་ཉིད་བསྒོམ་པར་བྱ། །\n\nངག་གང་མདོ་སྡེ་ལ་འཇུག་དེ། །གལ་ཏེ་སངས་རྒྱས་གསུངས་འདོད་ན། །\nཐེག་ཆེན་ཕལ་ཆེར་ཁྱེད་ཅག་གི །མདོ་དང་མཚུངས་འདོད་མིན་ནམ་ཅི། །\nགལ་ཏེ་མ་གཏོགས་གཅིག་གིས་ནི། །ཐམས་ཅད་སྐྱོན་དང་བཅས་འགྱུར་ན། །\nམདོ་མཚུངས་གཅིག་གིས་ཐམས་ཅད་ནི། །རྒྱལ་བས་གསུངས་པ་ཅིས་མ་ཡིན། །\nངག་གང་འོད་སྲུངས་ཆེན་པོ་ལ། །སོགས་པས་གཏིང་དཔོགས་མ་གྱུར་པ། །\nདེ་ནི་ཁྱོད་ཀྱིས་མ་རྟོགས་པས། །གཟུང་བྱ་མིན་པར་སུ་ཞིག་བྱེད། །\nརྨོངས་པས་སྡུག་བསྔལ་ཅན་དོན་དུ། །ཆགས་དང་འཇིགས་མཐའ་ལས་གྲོལ་བ། །\nའཁོར་བར་གནས་པ་གྲུབ་འགྱུར་བ། །འདི་ནི་སྟོང་ཉིད་འབྲས་བུ་ཡིན། །\nདེ་ལྟར་སྟོང་པ་ཉིད་ཕྱོགས་ལ། །སུན་འབྱིན་པ་ནི་འཐད་མ་ཡིན། །\nདེས་ན་ཐེ་ཚོམ་མི་ཟ་བར། །སྟོང་པ་ཉིད་ནི་བསྒོམ་པར་བྱ། །\nཉོན་མོངས་ཤེས་བྱའི་སྒྲིབ་པ་ཡི། །མུན་པའི་གཉེན་པོ་སྟོང་པ་ཉིད། །\nམྱུར་དུ་ཐམས་ཅད་མཁྱེན་འདོད་པས། །དེ་ནི་ཇི་ལྟར་སྒོམ་མི་བྱེད། །\nདངོས་གང་སྡུག་བསྔལ་སྐྱེད་བྱེད་པ། །དེ་ལས་སྐྲག་པ་སྐྱེ་འགྱུར་ན། །\nསྟོང་ཉིད་སྡུག་བསྔལ་ཞི་བྱེད་པ། །དེ་ལ་འཇིགས་པ་ཇི་ལྟར་སྐྱེ། །\nགལ་ཏེ་བདག་འགའ་ཡོད་ན་ནི། །ཅི་ཡང་རུང་ལས་འཇིགས་འགྱུར་ན། །\nབདག་ཉིད་འགའ་ཡང་ཡོད་མིན་པས། །འཇིགས་པར་འགྱུར་བ་སུ་ཞིག་ཡིན། །",
            "children": [
              {
                "level": "subsubsection",
                "number": "9.2.1.1",
                "title": "བདེན་གཉིས་རྣམ་པར་བཞག་པ། (The Presentation of the Two Truths)",
                "verses_span": "3-7",
                "verse_text_excerpt": "ཀུན་རྫོབ་དང་ནི་དོན་དམ་སྟེ། །འདི་ནི་བདེན་པ་གཉིས་སུ་འདོད། །\n\nདོན་དམ་བློ་ཡི་སྤྱོད་ཡུལ་མིན། །བློ་ནི་ཀུན་རྫོབ་ཡིན་པར་བརྗོད། །\n\nདེ་ལ་འཇིག་རྟེན་རྣམ་གཉིས་མཐོང་། །རྣལ་འབྱོར་པ་དང་ཕལ་པའོ། །\nདེ་ལ་འཇིག་རྟེན་ཕལ་པ་ནི། །རྣལ་འབྱོར་འཇིག་རྟེན་གྱིས་གནོད་ཅིང་། །\nརྣལ་འབྱོར་པ་ཡང་བློ་ཁྱད་ཀྱིས། །གོང་མ་གོང་མ་རྣམས་ཀྱིས་གནོད། །",
                "children": [
                  {
                    "level": "subsubsubsection",
                    "number": "9.2.1.1.1",
                    "title": "བདེན་གཉིས་ཀྱི་དབྱེ་བ། (The Division of the Two Truths)",
                    "verses_span": "3-3",
                    "verse_text_excerpt": "ཀུན་རྫོབ་དང་ནི་དོན་དམ་སྟེ། །འདི་ནི་བདེན་པ་གཉིས་སུ་འདོད། །",
                    "children": []
                  },
                  {
                    "level": "subsubsubsection",
                    "number": "9.2.1.1.2",
                    "title": "བདེན་གཉིས་ཀྱི་མཚན་ཉིད། (The Definition of the Two Truths)",
                    "verses_span": "4-4",
                    "verse_text_excerpt": "དོན་དམ་བློ་ཡི་སྤྱོད་ཡུལ་མིན། །བློ་ནི་ཀུན་རྫོབ་ཡིན་པར་བརྗོད། །",
                    "children": []
                  },
                  {
                    "level": "subsubsubsection",
                    "number": "9.2.1.1.3",
                    "title": "བདེན་གཉིས་གཏན་ལ་འབེབ་པའི་གང་ཟག (The Individuals Who Ascertain the Two Truths)",
                    "verses_span": "5-7",
                    "verse_text_excerpt": "དེ་ལ་འཇིག་རྟེན་རྣམ་གཉིས་མཐོང་། །རྣལ་འབྱོར་པ་དང་ཕལ་པའོ། །\nདེ་ལ་འཇིག་རྟེན་ཕལ་པ་ནི། །རྣལ་འབྱོར་འཇིག་རྟེན་གྱིས་གནོད་ཅིང་། །\nརྣལ་འབྱོར་པ་ཡང་བློ་ཁྱད་ཀྱིས། །གོང་མ་གོང་མ་རྣམས་ཀྱིས་གནོད། །",
                    "children": []
                  }
                ]
              },
              {
                "level": "subsubsection",
                "number": "9.2.1.2",
                "title": "དེ་ལ་རྩོད་པ་སྤོང་བ། (Dispelling Disputes Regarding That [the Two Truths])",
                "verses_span": "8-51",
                "verse_text_excerpt": "གཉི་ག་ཡང་ནི་འདོད་པའི་དཔེས། །འབྲས་བུའི་དོན་དུ་མ་དཔྱད་ཕྱིར། །\nའཇིག་རྟེན་པ་ཡིས་དངོས་མཐོང་ཞིང་། །ཡང་དག་ཉིད་དུའང་རྟོག་བྱེད་ཀྱི། །\nསྒྱུ་མ་ལྟ་བུར་མིན་པས་འདིར། །རྣལ་འབྱོར་པ་དང་འཇིག་རྟེན་རྩོད། །\n\nགཟུགས་སོགས་མངོན་སུམ་ཉིད་ཀྱང་ནི། །གྲགས་པས་ཡིན་གྱི་ཚད་མས་མིན། །\nདེ་ནི་མི་གཙང་ལ་སོགས་ལ། །གཙང་སོགས་གྲགས་པ་བཞིན་དུ་རྫུན། །\nའཇིག་རྟེན་གཞུག་པའི་དོན་དུ་ནི། །མགོན་པོས་དངོས་བསྟན་དེ་ཉིད་དུ། །\nདེ་དག་སྐད་ཅིག་མ་ཉིད་མིན། །ཀུན་རྫོབ་ཏུ་ཡང་འགལ་ཞེ་ན། །\nརྣལ་འབྱོར་ཀུན་རྫོབ་ཉེས་མེད་དེ། །འཇིག་རྟེན་ལ་ལྟོས་དེ་ཉིད་མཐོང་། །\nགཞན་དུ་བུད་མེད་མི་གཙང་བར། །དེས་རྟོག་འཇིག་རྟེན་གྱིས་གནོད་འགྱུར། །\nསྒྱུ་འདྲའི་རྒྱལ་ལས་བསོད་ནམས་ནི། །ཇི་ལྟར་དངོས་ཡོད་ལ་ཇི་བཞིན། །\nགལ་ཏེ་སེམས་ཅན་སྒྱུ་འདྲ་ན། །ཤི་ནས་ཇི་ལྟར་སྐྱེ་ཞེ་ན། །\nཇི་སྲིད་རྐྱེན་རྣམས་འཚོགས་གྱུར་པ། །དེ་སྲིད་སྒྱུ་མའང་འབྱུང་བར་འགྱུར། །\nརྒྱུན་རིང་ཙམ་གྱིས་ཇི་ལྟར་ན། །སེམས་ཅན་བདེན་པར་ཡོད་པ་ཡིན། །\nསྒྱུ་མའི་སྐྱེས་བུ་བསད་སོགས་ལ། །སེམས་མེད་ཕྱིར་ན་སྡིག་མེད་དེ། །\nསྒྱུ་མའི་སེམས་དང་ལྡན་པ་ལ། །བསོད་ནམས་དང་ནི་སྡིག་པ་འབྱུང་། །\nསྔགས་སོགས་རྣམས་ལ་ནུས་མེད་ཕྱིར། །སྒྱུ་མའི་སེམས་ནི་འབྱུང་བ་མེད། །\nསྣ་ཚོགས་རྐྱེན་ལས་བྱུང་བ་ཡི། །སྒྱུ་མ་དེ་ཡང་སྣ་ཚོགས་ཉིད། །\nརྐྱེན་གཅིག་གིས་ནི་ཀུན་ནུས་པ། །གང་ན་ཡང་ནི་ཡོད་མ་ཡིན། །\nགལ་ཏེ་དོན་དམ་མྱ་ངན་འདས། །འཁོར་བ་ཀུན་རྫོབ་དེ་ལྟ་ན། །\nསངས་རྒྱས་ཀྱང་ནི་འཁོར་འགྱུར་བས། །བྱང་ཆུབ་སྤྱོད་པས་ཅི་ཞིག་བྱ། །\nརྐྱེན་རྣམས་རྒྱུན་ནི་མ་ཆད་ན། །སྒྱུ་མའང་ལྡོག་པར་མི་འགྱུར་གྱི། །\nརྐྱེན་རྣམས་རྒྱུན་ནི་ཆད་པས་ན། །ཀུན་རྫོབ་ཏུ་ཡང་མི་འབྱུང་ངོ་། །\n\nགང་ཚེ་འཁྲུལ་པའང་ཡོད་མིན་ན། །སྒྱུ་མ་གང་གིས་དམིགས་པར་འགྱུར། །\nགང་ཚེ་ཁྱོད་ལ་སྒྱུ་མ་ཉིད། །མེད་ནའང་དེ་ཚེ་ཅི་ཞིག་དམིགས། །\nགལ་ཏེ་དེ་ཉིད་དུ་གཞན་ཡོད། །རྣམ་པ་དེ་ནི་སེམས་ཉིད་ཡིན། །\nགང་ཚེ་སེམས་ཉིད་སྒྱུ་མ་ན། །དེ་ཚེ་གང་ཞིག་གང་གིས་མཐོང་། །\nའཇིག་རྟེན་གྱི་ནི་མགོན་པོས་ཀྱང་། །སེམས་ཀྱིས་སེམས་མི་མཐོང་ཞེས་གསུངས། །\nརལ་གྲི་སོ་ནི་རང་ལ་རང་། །ཇི་ལྟར་མི་གཅོད་དེ་བཞིན་ཡིད། །\nཇི་ལྟར་མར་མེ་རང་གི་དངོས། །ཡང་དག་གསལ་བར་བྱེད་བཞིན་ན། །\nམར་མེ་གསལ་བར་བྱ་མིན་ཏེ། །གང་ཕྱིར་མུན་གྱིས་བསྒྲིབས་པ་མེད། །\nཤེལ་བཞིན་སྔོན་པོ་སྔོ་ཉིད་ལ། །གཞན་ལ་ལྟོས་པ་ཡོད་མ་ཡིན། །\nདེ་བཞིན་འགའ་ཞིག་གཞན་ལ་ནི། །ལྟོས་དང་ལྟོས་མེད་པ་ཡང་མཐོང་། །\nསྔོ་ཉིད་མིན་ལ་སྔོན་པོར་དེ། །བདག་གིས་བདག་ཉིད་བྱས་པ་མེད། །\nམར་མེ་གསལ་བར་བྱེད་དོ་ཞེས། །ཤེས་པས་ཤེས་ཏེ་རྗོད་བྱེད་ན། །\nབློ་ནི་གསལ་བ་ཉིད་ཡིན་ཞེས། །གང་གིས་ཤེས་ནས་དེ་སྐད་བརྗོད། །\nགང་ཚེ་འགས་ཀྱང་མཐོང་མིན་ན། །གསལ་བའམ་ནི་མི་གསལ་བ། །\nམོ་གཤམ་བུ་མོའི་འགྱིང་བག་བཞིན། །དེ་ནི་བརྗོད་ཀྱང་དོན་མེད་དོ། །\nགལ་ཏེ་རང་རིག་ཡོད་མིན་ན། །རྣམ་ཤེས་དྲན་པར་ཇི་ལྟར་འགྱུར། །\nགཞན་མྱོང་བ་ན་འབྲེལ་པ་ལས། །དྲན་འགྱུར་བྱི་བའི་དུག་བཞིན་ནོ། །\nརྐྱེན་གཞན་དག་དང་ལྡན་པ་ནི། །མཐོང་ཕྱིར་རང་ཉིད་རབ་གསལ་ན། །\nགྲུབ་པའི་མིག་སྨན་སྦྱོར་བ་ལས། །བུམ་མཐོང་མིག་སྨན་ཉིད་འགྱུར་མིན། །\nཇི་ལྟར་མཐོང་ཐོས་ཤེས་པ་དག །འདིར་ནི་དགག་པར་བྱ་མིན་ཏེ། །\nའདིར་ནི་སྡུག་བསྔལ་རྒྱུར་གྱུར་པ། །བདེན་པར་རྟོག་པ་བཟློག་བྱ་ཡིན། །\nསེམས་ལས་སྒྱུ་མ་གཞན་མིན་ཞིང་། །གཞན་མིན་པར་ཡང་མི་རྟག་ན། །\nདངོས་ན་ཇི་ལྟར་དེ་གཞན་མིན། །གཞན་མིན་ཞེ་ན་དངོས་པོར་མེད། །\nཇི་ལྟར་སྒྱུ་མ་བདེན་མིན་ཡང་། །བལྟ་བྱ་དེ་བཞིན་ལྟ་བྱེད་ཡིད། །\nགལ་ཏེ་འཁོར་བ་དངོས་རྟེན་ཅན། །དེ་ནི་གཞན་དུ་མཁའ་འདྲར་འགྱུར། །\nདངོས་མེད་དངོས་ལ་བརྟེན་པས་ན། །བྱེད་དང་ལྡན་པར་ཇི་ལྟར་འགྱུར། །\nཁྱོད་ཀྱི་སེམས་ནི་གྲོགས་མེད་པར། །གཅིག་པུ་ཉིད་དུ་འགྱུར་བ་ཡིན། །\nགང་ཚེ་སེམས་ནི་གཟུང་བྲལ་བ། །དེ་ཚེ་ཐམས་ཅད་དེ་བཞིན་གཤེགས། །\nདེ་ལྟ་ན་ཡང་སེམས་ཙམ་དུ། །བརྟགས་ལ་ཡོན་ཏན་ཅི་ཞིག་ཡོད། །",
                "children": [
                  {
                    "level": "subsubsubsection",
                    "number": "9.2.1.2.1",
                    "title": "འཇིག་རྟེན་ཕལ་པའི་རྩོད་སྤོང༌། (Dispelling Disputes of the Ordinary Worldly Person)",
                    "verses_span": "8-10",
                    "verse_text_excerpt": "གཉི་ག་ཡང་ནི་འདོད་པའི་དཔེས། །འབྲས་བུའི་དོན་དུ་མ་དཔྱད་ཕྱིར། །\nའཇིག་རྟེན་པ་ཡིས་དངོས་མཐོང་ཞིང་། །ཡང་དག་ཉིད་དུའང་རྟོག་བྱེད་ཀྱི། །\nསྒྱུ་མ་ལྟ་བུར་མིན་པས་འདིར། །རྣལ་འབྱོར་པ་དང་འཇིག་རྟེན་རྩོད། །",
                    "children": []
                  },
                  {
                    "level": "subsubsubsection",
                    "number": "9.2.1.2.2",
                    "title": "ཉན་ཐོས་ཀྱི་རྩོད་སྤོང༌། (Dispelling Disputes of the Shravakas)",
                    "verses_span": "11-29",
                    "verse_text_excerpt": "གཟུགས་སོགས་མངོན་སུམ་ཉིད་ཀྱང་ནི། །གྲགས་པས་ཡིན་གྱི་ཚད་མས་མིན། །\nདེ་ནི་མི་གཙང་ལ་སོགས་ལ། །གཙང་སོགས་གྲགས་པ་བཞིན་དུ་རྫུན། །\nའཇིག་རྟེན་གཞུག་པའི་དོན་དུ་ནི། །མགོན་པོས་དངོས་བསྟན་དེ་ཉིད་དུ། །\nདེ་དག་སྐད་ཅིག་མ་ཉིད་མིན། །ཀུན་རྫོབ་ཏུ་ཡང་འགལ་ཞེ་ན། །\nརྣལ་འབྱོར་ཀུན་རྫོབ་ཉེས་མེད་དེ། །འཇིག་རྟེན་ལ་ལྟོས་དེ་ཉིད་མཐོང་། །\nགཞན་དུ་བུད་མེད་མི་གཙང་བར། །དེས་རྟོག་འཇིག་རྟེན་གྱིས་གནོད་འགྱུར། །\nསྒྱུ་འདྲའི་རྒྱལ་ལས་བསོད་ནམས་ནི། །ཇི་ལྟར་དངོས་ཡོད་ལ་ཇི་བཞིན། །\nགལ་ཏེ་སེམས་ཅན་སྒྱུ་འདྲ་ན། །ཤི་ནས་ཇི་ལྟར་སྐྱེ་ཞེ་ན། །\nཇི་སྲིད་རྐྱེན་རྣམས་འཚོགས་གྱུར་པ། །དེ་སྲིད་སྒྱུ་མའང་འབྱུང་བར་འགྱུར། །\nརྒྱུན་རིང་ཙམ་གྱིས་ཇི་ལྟར་ན། །སེམས་ཅན་བདེན་པར་ཡོད་པ་ཡིན། །\nསྒྱུ་མའི་སྐྱེས་བུ་བསད་སོགས་ལ། །སེམས་མེད་ཕྱིར་ན་སྡིག་མེད་དེ། །\nསྒྱུ་མའི་སེམས་དང་ལྡན་པ་ལ། །བསོད་ནམས་དང་ནི་སྡིག་པ་འབྱུང་། །\nསྔགས་སོགས་རྣམས་ལ་ནུས་མེད་ཕྱིར། །སྒྱུ་མའི་སེམས་ནི་འབྱུང་བ་མེད། །\nསྣ་ཚོགས་རྐྱེན་ལས་བྱུང་བ་ཡི། །སྒྱུ་མ་དེ་ཡང་སྣ་ཚོགས་ཉིད། །\nརྐྱེན་གཅིག་གིས་ནི་ཀུན་ནུས་པ། །གང་ན་ཡང་ནི་ཡོད་མ་ཡིན། །\nགལ་ཏེ་དོན་དམ་མྱ་ངན་འདས། །འཁོར་བ་ཀུན་རྫོབ་དེ་ལྟ་ན། །\nསངས་རྒྱས་ཀྱང་ནི་འཁོར་འགྱུར་བས། །བྱང་ཆུབ་སྤྱོད་པས་ཅི་ཞིག་བྱ། །\nརྐྱེན་རྣམས་རྒྱུན་ནི་མ་ཆད་ན། །སྒྱུ་མའང་ལྡོག་པར་མི་འགྱུར་གྱི། །\nརྐྱེན་རྣམས་རྒྱུན་ནི་ཆད་པས་ན། །ཀུན་རྫོབ་ཏུ་ཡང་མི་འབྱུང་ངོ་། །",
                    "children": []
                  },
                  {
                    "level": "subsubsubsection",
                    "number": "9.2.1.2.3",
                    "title": "སེམས་ཙམ་པ་རྣམས་ཀྱི་རྩོད་སྤོང༌། (Dispelling Disputes of the Chittamatrins)",
                    "verses_span": "30-51",
                    "verse_text_excerpt": "གང་ཚེ་འཁྲུལ་པའང་ཡོད་མིན་ན། །སྒྱུ་མ་གང་གིས་དམིགས་པར་འགྱུར། །\nགང་ཚེ་ཁྱོད་ལ་སྒྱུ་མ་ཉིད། །མེད་ནའང་དེ་ཚེ་ཅི་ཞིག་དམིགས། །\nགལ་ཏེ་དེ་ཉིད་དུ་གཞན་ཡོད། །རྣམ་པ་དེ་ནི་སེམས་ཉིད་ཡིན། །\nགང་ཚེ་སེམས་ཉིད་སྒྱུ་མ་ན། །དེ་ཚེ་གང་ཞིག་གང་གིས་མཐོང་། །\nའཇིག་རྟེན་གྱི་ནི་མགོན་པོས་ཀྱང་། །སེམས་ཀྱིས་སེམས་མི་མཐོང་ཞེས་གསུངས། །\nརལ་གྲི་སོ་ནི་རང་ལ་རང་། །ཇི་ལྟར་མི་གཅོད་དེ་བཞིན་ཡིད། །\nཇི་ལྟར་མར་མེ་རང་གི་དངོས། །ཡང་དག་གསལ་བར་བྱེད་བཞིན་ན། །\nམར་མེ་གསལ་བར་བྱ་མིན་ཏེ། །གང་ཕྱིར་མུན་གྱིས་བསྒྲིབས་པ་མེད། །\nཤེལ་བཞིན་སྔོན་པོ་སྔོ་ཉིད་ལ། །གཞན་ལ་ལྟོས་པ་ཡོད་མ་ཡིན། །\nདེ་བཞིན་འགའ་ཞིག་གཞན་ལ་ནི། །ལྟོས་དང་ལྟོས་མེད་པ་ཡང་མཐོང་། །\nསྔོ་ཉིད་མིན་ལ་སྔོན་པོར་དེ། །བདག་གིས་བདག་ཉིད་བྱས་པ་མེད། །\nམར་མེ་གསལ་བར་བྱེད་དོ་ཞེས། །ཤེས་པས་ཤེས་ཏེ་རྗོད་བྱེད་ན། །\nབློ་ནི་གསལ་བ་ཉིད་ཡིན་ཞེས། །གང་གིས་ཤེས་ནས་དེ་སྐད་བརྗོད། །\nགང་ཚེ་འགས་ཀྱང་མཐོང་མིན་ན། །གསལ་བའམ་ནི་མི་གསལ་བ། །\nམོ་གཤམ་བུ་མོའི་འགྱིང་བག་བཞིན། །དེ་ནི་བརྗོད་ཀྱང་དོན་མེད་དོ། །\nགལ་ཏེ་རང་རིག་ཡོད་མིན་ན། །རྣམ་ཤེས་དྲན་པར་ཇི་ལྟར་འགྱུར། །\nགཞན་མྱོང་བ་ན་འབྲེལ་པ་ལས། །དྲན་འགྱུར་བྱི་བའི་དུག་བཞིན་ནོ། །\nརྐྱེན་གཞན་དག་དང་ལྡན་པ་ནི། །མཐོང་ཕྱིར་རང་ཉིད་རབ་གསལ་ན། །\nགྲུབ་པའི་མིག་སྨན་སྦྱོར་བ་ལས། །བུམ་མཐོང་མིག་སྨན་ཉིད་འགྱུར་མིན། །\nཇི་ལྟར་མཐོང་ཐོས་ཤེས་པ་དག །འདིར་ནི་དགག་པར་བྱ་མིན་ཏེ། །\nའདིར་ནི་སྡུག་བསྔལ་རྒྱུར་གྱུར་པ། །བདེན་པར་རྟོག་པ་བཟློག་བྱ་ཡིན། །\nསེམས་ལས་སྒྱུ་མ་གཞན་མིན་ཞིང་། །གཞན་མིན་པར་ཡང་མི་རྟག་ན། །\nདངོས་ན་ཇི་ལྟར་དེ་གཞན་མིན། །གཞན་མིན་ཞེ་ན་དངོས་པོར་མེད། །\nཇི་ལྟར་སྒྱུ་མ་བདེན་མིན་ཡང་། །བལྟ་བྱ་དེ་བཞིན་ལྟ་བྱེད་ཡིད། །\nགལ་ཏེ་འཁོར་བ་དངོས་རྟེན་ཅན། །དེ་ནི་གཞན་དུ་མཁའ་འདྲར་འགྱུར། །\nདངོས་མེད་དངོས་ལ་བརྟེན་པས་ན། །བྱེད་དང་ལྡན་པར་ཇི་ལྟར་འགྱུར། །\nཁྱོད་ཀྱི་སེམས་ནི་གྲོགས་མེད་པར། །གཅིག་པུ་ཉིད་དུ་འགྱུར་བ་ཡིན། །\nགང་ཚེ་སེམས་ནི་གཟུང་བྲལ་བ། །དེ་ཚེ་ཐམས་ཅད་དེ་བཞིན་གཤེགས། །\nདེ་ལྟ་ན་ཡང་སེམས་ཙམ་དུ། །བརྟགས་ལ་ཡོན་ཏན་ཅི་ཞིག་ཡོད། །",
                    "children": []
                  }
                ]
              },
              {
                "level": "subsubsection",
                "number": "9.2.1.3",
                "title": "ཐེག་ཆེན་མཆོག་ཏུ་བསྒྲུབ་པ། (Establishing the Mahayana as Supreme)",
                "verses_span": "52-89",
                "verse_text_excerpt": "སྒྱུ་མ་ལྟ་བུར་ཤེས་ན་ཡང་། །ཇི་ལྟར་ཉོན་མོངས་ལྡོག་འགྱུར་ཏེ། །\nགང་ཚེ་སྒྱུ་མའི་བུད་མེད་ལ། །དེ་བྱེད་ཉིད་ཀྱང་ཆགས་སྐྱེ་འགྱུར། །\nདེ་བྱེད་པ་ནི་ཤེས་བྱ་ལ། །ཉོན་མོངས་བག་ཆགས་མ་སྤངས་པ། །\nདེས་ན་དེ་མཐོང་བ་ན་དེ། །སྟོང་ཉིད་བག་ཆགས་ཉམ་ཆུང་ཉིད། །\nསྟོང་ཉིད་བག་ཆགས་གོམས་པས་ནི། །དངོས་པོའི་བག་ཆགས་སྤོང་འགྱུར་ཞིང་། །\nཅི་ཡང་མེད་ཅེས་གོམས་པས་ནི། །དེ་ཡང་ཕྱི་ནས་སྤོང་བར་འགྱུར། །\nགང་ཚེ་གང་ཞིག་མེད་དོ་ཞེས། །བརྟག་བྱའི་དངོས་པོ་མི་དམིགས་པ། །\nདེ་ཚེ་དངོས་མེད་རྟེན་བྲལ་བ། །བློ་ཡི་མདུན་ན་ཇི་ལྟར་གནས། །\nགང་ཚེ་དངོས་དང་དངོས་མེད་དག །བློ་ཡི་མདུན་ན་མི་གནས་པ། །\nདེ་ཚེ་རྣམ་པ་གཞན་མེད་པས། །དམིགས་པ་མེད་པར་རབ་ཏུ་ཞི། །\n\nཡིད་བཞིན་ནོར་བུ་དཔག་བསམ་ཤིང་། །ཇི་ལྟར་རེ་བ་ཡོངས་སྐོང་བ། །\nདེ་བཞིན་གདུལ་བྱ་སྨོན་ལམ་གྱི། །དབང་གིས་རྒྱལ་བའི་སྐུར་སྣང་ངོ་། །\nདཔེར་ན་ནམ་མཁའ་ལྡིང་གི་ནི། །མཆོད་སྡོང་བསྒྲུབས་ནས་འདས་གྱུར་པ། །\nདེ་འདས་ཡུན་རིང་ལོན་ཡང་དེ། །དུག་ལ་སོགས་པ་ཞི་བྱེད་བཞིན། །\nབྱང་ཆུབ་སྤྱོད་པའི་རྗེས་མཐུན་པར། །རྒྱལ་བའི་མཆོད་སྡོང་བསྒྲུབས་པ་ཡང་། །\nབྱང་ཆུབ་སེམས་དཔའ་མྱ་ངན་ལས། །འདས་ཀྱང་དོན་རྣམས་ཐམས་ཅད་མཛད། །\nསེམས་མེད་པ་ལ་མཆོད་བྱས་པས། །ཇི་ལྟར་འབྲས་བུ་ལྡན་པར་འགྱུར། །\nགང་ཕྱིར་བཞུགས་པའམ་མྱ་ངན་འདས། །མཚུངས་པ་ཉིད་དུ་བཤད་ཕྱིར་རོ། །\nཀུན་རྫོབ་བམ་ནི་དེ་ཉིད་དུའང་། །རུང་སྟེ་དེར་འབྲས་ལུང་ལས་ཡིན། །\nདཔེར་ན་བདེན་པའི་སངས་རྒྱས་ལ། །ཇི་ལྟར་འབྲས་བུར་བཅས་པ་བཞིན། །\n\nབདེན་པ་མཐོང་བས་གྲོལ་འགྱུར་གྱི། །སྟོང་ཉིད་མཐོང་བས་ཅི་ཞིག་བྱ། །\nགང་ཕྱིར་ལུང་ལས་ལམ་འདི་ནི། །མེད་པར་བྱང་ཆུབ་མེད་པར་གསུངས། །\nགལ་ཏེ་ཐེག་ཆེན་མ་གྲུབ་ན། །ཁྱོད་ཀྱི་ལུང་ནི་ཇི་ལྟར་གྲུབ། །\nགང་ཕྱིར་གཉིས་ཀ་ལ་འདི་གྲུབ། །དང་པོ་ཁྱོད་ལ་འདི་མ་གྲུབ། །\nརྐྱེན་གང་གིས་ནི་དེར་ཡིད་ཆེས། །དེ་ནི་ཐེག་ཆེན་ལ་ཡང་མཚུངས། །\nགཞན་གཉིས་འདོད་པས་བདེན་ན་ནི། །རིག་བྱེད་སོགས་ཀྱང་བདེན་པར་འགྱུར། །\nཐེག་ཆེན་རྩོད་བཅས་ཕྱིར་ཞེ་ན། །ལུང་ལ་མུ་སྟེགས་པ་རྣམས་དང་། །\nལུང་གཞན་ལ་ཡང་རང་གཞན་དག །རྩོད་བཅས་ཡིན་ཕྱིར་དོར་བྱར་འགྱུར། །\nབསྟན་རྩ་དགེ་སློང་ཉིད་ཡིན་ན། །དགེ་སློང་ཉིད་ཀྱང་དཀའ་བར་གནས། །\nསེམས་ནི་དམིགས་དང་བཅས་རྣམས་ཀྱི། །མྱ་ངན་འདས་པའང་དཀའ་བར་གནས། །\nཉོན་མོངས་སྤངས་པས་གྲོལ་ན་དེའི། །དེ་མ་ཐག་ཏུ་དེར་འགྱུར་རོ། །\nཉོན་མོངས་མེད་ཀྱང་དེ་དག་ལ། །ལས་ཀྱི་ནུས་པ་མཐོང་བ་ཡིན། །\nརེ་ཞིག་ཉེར་ལེན་སྲེད་པ་ནི། །མེད་ཅེས་ངེས་པ་ཉིད་ཅེ་ན། །\nསྲེད་དེ་ཉོན་མོངས་ཅན་མིན་ཡང་། །ཀུན་རྨོངས་བཞིན་དུ་ཅི་སྟེ་མེད། །\nཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ་ཡིན། །ཚོར་བ་དེ་དག་ལ་ཡང་ཡོད། །\nདམིགས་པ་དང་ནི་བཅས་པའི་སེམས། །འགའ་ཞིག་ལ་ནི་གནས་པར་འགྱུར། །\nསྟོང་ཉིད་དང་ནི་བྲལ་བའི་སེམས། །འགགས་པ་སླར་ཡང་སྐྱེ་འགྱུར་ཏེ། །\nའདུ་ཤེས་མེད་པའི་སྙོམས་འཇུག་བཞིན། །དེས་ན་སྟོང་ཉིད་བསྒོམ་པར་བྱ། །\n\nངག་གང་མདོ་སྡེ་ལ་འཇུག་དེ། །གལ་ཏེ་སངས་རྒྱས་གསུངས་འདོད་ན། །\nཐེག་ཆེན་ཕལ་ཆེར་ཁྱེད་ཅག་གི །མདོ་དང་མཚུངས་འདོད་མིན་ནམ་ཅི། །\nགལ་ཏེ་མ་གཏོགས་གཅིག་གིས་ནི། །ཐམས་ཅད་སྐྱོན་དང་བཅས་འགྱུར་ན། །\nམདོ་མཚུངས་གཅིག་གིས་ཐམས་ཅད་ནི། །རྒྱལ་བས་གསུངས་པ་ཅིས་མ་ཡིན། །\nངག་གང་འོད་སྲུངས་ཆེན་པོ་ལ། །སོགས་པས་གཏིང་དཔོགས་མ་གྱུར་པ། །\nདེ་ནི་ཁྱོད་ཀྱིས་མ་རྟོགས་པས། །གཟུང་བྱ་མིན་པར་སུ་ཞིག་བྱེད། །\nརྨོངས་པས་སྡུག་བསྔལ་ཅན་དོན་དུ། །ཆགས་དང་འཇིགས་མཐའ་ལས་གྲོལ་བ། །\nའཁོར་བར་གནས་པ་གྲུབ་འགྱུར་བ། །འདི་ནི་སྟོང་ཉིད་འབྲས་བུ་ཡིན། །\nདེ་ལྟར་སྟོང་པ་ཉིད་ཕྱོགས་ལ། །སུན་འབྱིན་པ་ནི་འཐད་མ་ཡིན། །\nདེས་ན་ཐེ་ཚོམ་མི་ཟ་བར། །སྟོང་པ་ཉིད་ནི་བསྒོམ་པར་བྱ། །\nཉོན་མོངས་ཤེས་བྱའི་སྒྲིབ་པ་ཡི། །མུན་པའི་གཉེན་པོ་སྟོང་པ་ཉིད། །\nམྱུར་དུ་ཐམས་ཅད་མཁྱེན་འདོད་པས། །དེ་ནི་ཇི་ལྟར་སྒོམ་མི་བྱེད། །\nདངོས་གང་སྡུག་བསྔལ་སྐྱེད་བྱེད་པ། །དེ་ལས་སྐྲག་པ་སྐྱེ་འགྱུར་ན། །\nསྟོང་ཉིད་སྡུག་བསྔལ་ཞི་བྱེད་པ། །དེ་ལ་འཇིགས་པ་ཇི་ལྟར་སྐྱེ། །\nགལ་ཏེ་བདག་འགའ་ཡོད་ན་ནི། །ཅི་ཡང་རུང་ལས་འཇིགས་འགྱུར་ན། །\nབདག་ཉིད་འགའ་ཡང་ཡོད་མིན་པས། །འཇིགས་པར་འགྱུར་བ་སུ་ཞིག་ཡིན། །",
                "children": [
                  {
                    "level": "subsubsubsection",
                    "number": "9.2.1.3.1",
                    "title": "ལམ་སྟོང་ཉིད་ལ་རྩོད་པ་སྤོང་བ། (Dispelling Disputes Regarding Emptiness, the Path - Commentary Title: ལམ་སྟོང་ཉིད་ལ་རྩོད་པ་སྤོང་བ།)",
                    "verses_span": "52-59",
                    "verse_text_excerpt": "སྒྱུ་མ་ལྟ་བུར་ཤེས་ན་ཡང་། །ཇི་ལྟར་ཉོན་མོངས་ལྡོག་འགྱུར་ཏེ། །\nགང་ཚེ་སྒྱུ་མའི་བུད་མེད་ལ། །དེ་བྱེད་ཉིད་ཀྱང་ཆགས་སྐྱེ་འགྱུར། །\nདེ་བྱེད་པ་ནི་ཤེས་བྱ་ལ། །ཉོན་མོངས་བག་ཆགས་མ་སྤངས་པ། །\nདེས་ན་དེ་མཐོང་བ་ན་དེ། །སྟོང་ཉིད་བག་ཆགས་ཉམ་ཆུང་ཉིད། །\nསྟོང་ཉིད་བག་ཆགས་གོམས་པས་ནི། །དངོས་པོའི་བག་ཆགས་སྤོང་འགྱུར་ཞིང་། །\nཅི་ཡང་མེད་ཅེས་གོམས་པས་ནི། །དེ་ཡང་ཕྱི་ནས་སྤོང་བར་འགྱུར། །\nགང་ཚེ་གང་ཞིག་མེད་དོ་ཞེས། །བརྟག་བྱའི་དངོས་པོ་མི་དམིགས་པ། །\nདེ་ཚེ་དངོས་མེད་རྟེན་བྲལ་བ། །བློ་ཡི་མདུན་ན་ཇི་ལྟར་གནས། །\nགང་ཚེ་དངོས་དང་དངོས་མེད་དག །བློ་ཡི་མདུན་ན་མི་གནས་པ། །\nདེ་ཚེ་རྣམ་པ་གཞན་མེད་པས། །དམིགས་པ་མེད་པར་རབ་ཏུ་ཞི། །",
                    "children": []
                  },
                  {
                    "level": "subsubsubsection",
                    "number": "9.2.1.3.2",
                    "title": "འབྲས་བུ་གཞན་དོན་ལ་རྩོད་པ་སྤོང་བ། (Dispelling Disputes Regarding the Result, the Benefit of Others - Commentary Title: འབྲས་བུ་གཞན་དོན་ལ་རྩོད་པ་སྤོང་བ།)",
                    "verses_span": "60-67",
                    "verse_text_excerpt": "ཡིད་བཞིན་ནོར་བུ་དཔག་བསམ་ཤིང་། །ཇི་ལྟར་རེ་བ་ཡོངས་སྐོང་བ། །\nདེ་བཞིན་གདུལ་བྱ་སྨོན་ལམ་གྱི། །དབང་གིས་རྒྱལ་བའི་སྐུར་སྣང་ངོ་། །\nདཔེར་ན་ནམ་མཁའ་ལྡིང་གི་ནི། །མཆོད་སྡོང་བསྒྲུབས་ནས་འདས་གྱུར་པ། །\nདེ་འདས་ཡུན་རིང་ལོན་ཡང་དེ། །དུག་ལ་སོགས་པ་ཞི་བྱེད་བཞིན། །\nབྱང་ཆུབ་སྤྱོད་པའི་རྗེས་མཐུན་པར། །རྒྱལ་བའི་མཆོད་སྡོང་བསྒྲུབས་པ་ཡང་། །\nབྱང་ཆུབ་སེམས་དཔའ་མྱ་ངན་ལས། །འདས་ཀྱང་དོན་རྣམས་ཐམས་ཅད་མཛད། །\nསེམས་མེད་པ་ལ་མཆོད་བྱས་པས། །ཇི་ལྟར་འབྲས་བུ་ལྡན་པར་འགྱུར། །\nགང་ཕྱིར་བཞུགས་པའམ་མྱ་ངན་འདས། །མཚུངས་པ་ཉིད་དུ་བཤད་ཕྱིར་རོ། །\nཀུན་རྫོབ་བམ་ནི་དེ་ཉིད་དུའང་། །རུང་སྟེ་དེར་འབྲས་ལུང་ལས་ཡིན། །\nདཔེར་ན་བདེན་པའི་སངས་རྒྱས་ལ། །ཇི་ལྟར་འབྲས་བུར་བཅས་པ་བཞིན། །",
                    "children": []
                  },
                  {
                    "level": "subsubsubsection",
                    "number": "9.2.1.3.3",
                    "title": "ལུང་ཐེག་ཆེན་བཀར་བསྒྲུབ་པ། (Establishing the Mahayana Scriptures as Authoritative)",
                    "verses_span": "68-81",
                    "verse_text_excerpt": "བདེན་པ་མཐོང་བས་གྲོལ་འགྱུར་གྱི། །སྟོང་ཉིད་མཐོང་བས་ཅི་ཞིག་བྱ། །\nགང་ཕྱིར་ལུང་ལས་ལམ་འདི་ནི། །མེད་པར་བྱང་ཆུབ་མེད་པར་གསུངས། །\nགལ་ཏེ་ཐེག་ཆེན་མ་གྲུབ་ན། །ཁྱོད་ཀྱི་ལུང་ནི་ཇི་ལྟར་གྲུབ། །\nགང་ཕྱིར་གཉིས་ཀ་ལ་འདི་གྲུབ། །དང་པོ་ཁྱོད་ལ་འདི་མ་གྲུབ། །\nརྐྱེན་གང་གིས་ནི་དེར་ཡིད་ཆེས། །དེ་ནི་ཐེག་ཆེན་ལ་ཡང་མཚུངས། །\nགཞན་གཉིས་འདོད་པས་བདེན་ན་ནི། །རིག་བྱེད་སོགས་ཀྱང་བདེན་པར་འགྱུར། །\nཐེག་ཆེན་རྩོད་བཅས་ཕྱིར་ཞེ་ན། །ལུང་ལ་མུ་སྟེགས་པ་རྣམས་དང་། །\nལུང་གཞན་ལ་ཡང་རང་གཞན་དག །རྩོད་བཅས་ཡིན་ཕྱིར་དོར་བྱར་འགྱུར། །\nབསྟན་རྩ་དགེ་སློང་ཉིད་ཡིན་ན། །དགེ་སློང་ཉིད་ཀྱང་དཀའ་བར་གནས། །\nསེམས་ནི་དམིགས་དང་བཅས་རྣམས་ཀྱི། །མྱ་ངན་འདས་པའང་དཀའ་བར་གནས། །\nཉོན་མོངས་སྤངས་པས་གྲོལ་ན་དེའི། །དེ་མ་ཐག་ཏུ་དེར་འགྱུར་རོ། །\nཉོན་མོངས་མེད་ཀྱང་དེ་དག་ལ། །ལས་ཀྱི་ནུས་པ་མཐོང་བ་ཡིན། །\nརེ་ཞིག་ཉེར་ལེན་སྲེད་པ་ནི། །མེད་ཅེས་ངེས་པ་ཉིད་ཅེ་ན། །\nསྲེད་དེ་ཉོན་མོངས་ཅན་མིན་ཡང་། །ཀུན་རྨོངས་བཞིན་དུ་ཅི་སྟེ་མེད། །\nཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ་ཡིན། །ཚོར་བ་དེ་དག་ལ་ཡང་ཡོད། །\nདམིགས་པ་དང་ནི་བཅས་པའི་སེམས། །འགའ་ཞིག་ལ་ནི་གནས་པར་འགྱུར། །\nསྟོང་ཉིད་དང་ནི་བྲལ་བའི་སེམས། །འགགས་པ་སླར་ཡང་སྐྱེ་འགྱུར་ཏེ། །\nའདུ་ཤེས་མེད་པའི་སྙོམས་འཇུག་བཞིན། །དེས་ན་སྟོང་ཉིད་བསྒོམ་པར་བྱ། །",
                    "children": []
                  },
                  {
                    "level": "subsubsubsection",
                    "number": "9.2.1.3.4",
                    "title": "ལམ་སྟོང་ཉིད་གཉེན་པོར་སྒྲུབ་པ། (Establishing Emptiness, the Path, as the Antidote)",
                    "verses_span": "82-89",
                    "verse_text_excerpt": "ངག་གང་མདོ་སྡེ་ལ་འཇུག་དེ། །གལ་ཏེ་སངས་རྒྱས་གསུངས་འདོད་ན། །\nཐེག་ཆེན་ཕལ་ཆེར་ཁྱེད་ཅག་གི །མདོ་དང་མཚུངས་འདོད་མིན་ནམ་ཅི། །\nགལ་ཏེ་མ་གཏོགས་གཅིག་གིས་ནི། །ཐམས་ཅད་སྐྱོན་དང་བཅས་འགྱུར་ན། །\nམདོ་མཚུངས་གཅིག་གིས་ཐམས་ཅད་ནི། །རྒྱལ་བས་གསུངས་པ་ཅིས་མ་ཡིན། །\nངག་གང་འོད་སྲུངས་ཆེན་པོ་ལ། །སོགས་པས་གཏིང་དཔོགས་མ་གྱུར་པ། །\nདེ་ནི་ཁྱོད་ཀྱིས་མ་རྟོགས་པས། །གཟུང་བྱ་མིན་པར་སུ་ཞིག་བྱེད། །\nརྨོངས་པས་སྡུག་བསྔལ་ཅན་དོན་དུ། །ཆགས་དང་འཇིགས་མཐའ་ལས་གྲོལ་བ། །\nའཁོར་བར་གནས་པ་གྲུབ་འགྱུར་བ། །འདི་ནི་སྟོང་ཉིད་འབྲས་བུ་ཡིན། །\nདེ་ལྟར་སྟོང་པ་ཉིད་ཕྱོགས་ལ། །སུན་འབྱིན་པ་ནི་འཐད་མ་ཡིན། །\nདེས་ན་ཐེ་ཚོམ་མི་ཟ་བར། །སྟོང་པ་ཉིད་ནི་བསྒོམ་པར་བྱ། །\nཉོན་མོངས་ཤེས་བྱའི་སྒྲིབ་པ་ཡི། །མུན་པའི་གཉེན་པོ་སྟོང་པ་ཉིད། །\nམྱུར་དུ་ཐམས་ཅད་མཁྱེན་འདོད་པས། །དེ་ནི་ཇི་ལྟར་སྒོམ་མི་བྱེད། །\nདངོས་གང་སྡུག་བསྔལ་སྐྱེད་བྱེད་པ། །དེ་ལས་སྐྲག་པ་སྐྱེ་འགྱུར་ན། །\nསྟོང་ཉིད་སྡུག་བསྔལ་ཞི་བྱེད་པ། །དེ་ལ་འཇིགས་པ་ཇི་ལྟར་སྐྱེ། །\nགལ་ཏེ་བདག་འགའ་ཡོད་ན་ནི། །ཅི་ཡང་རུང་ལས་འཇིགས་འགྱུར་ན། །\nབདག་ཉིད་འགའ་ཡང་ཡོད་མིན་པས། །འཇིགས་པར་འགྱུར་བ་སུ་ཞིག་ཡིན། །",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "level": "subsection",
            "number": "9.2.2",
            "title": "བསྒོམ་པས་ཉམས་སུ་བླང་བ། (Practicing Through Meditation)",
            "verses_span": "90-155",
            "verse_text_excerpt": "སོ་དང་སྐྲ་སེན་བདག་མ་ཡིན། །བདག་ནི་རུས་པ་ཁྲག་མ་ཡིན། །\nསྣབས་མིན་བད་ཀན་མ་ཡིན་ཏེ། །ཆུ་སེར་དང་ནི་རྣག་ཀྱང་མིན། །\nབདག་ནི་ཞག་དང་རྔུལ་མིན་ཏེ། །གློ་མཆིན་དག་ཀྱང་བདག་མ་ཡིན། །\nནང་ཁྲོལ་གཞན་ཡང་བདག་མིན་ཏེ། །བདག་ནི་ཕྱི་ས་གཅིན་མ་ཡིན། །\nཤ་དང་པགས་པ་བདག་མིན་ཏེ། །དྲོད་དང་རླུང་ཡང་བདག་མ་ཡིན། །\nབུ་ག་བདག་མིན་རྣམ་ཀུན་དུ། །རྣམ་ཤེས་དྲུག་ཀྱང་བདག་མ་ཡིན། །\n\nགལ་ཏེ་སྒྲ་ཡི་ཤེས་རྟག་ན། །ཐམས་ཅད་ཚེ་ན་སྒྲ་འཛིན་འགྱུར། །\nཤེས་བྱ་མེད་ན་ཅི་ཞིག་རིག །གང་གིས་ཤེས་པ་ཞེས་རྗོད་བྱེད། །\nགལ་ཏེ་ཤེས་མེད་ཤེས་ཡིན་ན། །ཤིང་ཡང་ཤེས་པར་ཐལ་བར་འགྱུར། །\nདེས་ན་ཤེས་བྱ་ཉེར་གནས་པ། །མེད་པར་ཤེས་པ་མེད་ཅེས་ངེས། །\nདེ་ཉིད་ཀྱིས་ནི་གཟུགས་ཤེས་ན། །དེ་ཚེ་ཐོས་པའང་ཅི་སྟེ་མིན། །\nགལ་ཏེ་སྒྲ་མི་ཉེ་ཕྱིར་ན། །དེས་ན་དེ་ཡི་ཤེས་པའང་མེད། །\nསྒྲ་འཛིན་རང་བཞིན་གང་ཡིན་པ། །དེ་གཟུགས་འཛིན་པར་ཇི་ལྟར་འགྱུར། །\nགཅིག་ནི་ཕ་དང་བུ་ཉིད་དུ། །བརྟགས་ཡིན་ཡང་དག་ཉིད་མིན་ཏེ། །\nའདི་ལྟར་སྙིང་སྟོབས་རྡུལ་དང་ནི། །མུན་པ་བུ་མིན་ཕ་ཡང་མིན། །\nདེ་ནི་སྒྲ་འཛིན་དང་ལྡན་པའི། །རང་བཞིན་དུ་ནི་མཐོང་མ་ཡིན། །\nགར་མཁན་ལྟ་བུར་ཚུལ་གཞན་གྱིས། །དེ་ཉིད་མཐོང་ན་དེ་རྟག་མིན། །\nགལ་ཏེ་ཚུལ་གཞན་དེ་ཉིད་ན། །གཅིག་ཉིད་དེ་ནི་སྔོན་མེད་གཅིག །\nགལ་ཏེ་ཚུལ་གཞན་བདེན་མིན་ན། །དེ་ཡི་རང་གི་རང་བཞིན་སྨྲོས། །\nཤེས་ཉིད་ཅེ་ན་དེ་ལྟ་ན། །སྐྱེས་ཀུན་གཅིག་ཏུ་ཐལ་བར་འགྱུར། །\nསེམས་པ་སེམས་མེད་དེ་དག་ཀྱང་། །གཅིག་འགྱུར་གང་ཕྱིར་ཡོད་ཉིད་མཚུངས། །\nགང་ཚེ་བྱེ་བྲག་ཕྱིན་ཅི་ལོག །དེ་ཚེ་འདྲ་བའི་རྟེན་གང་ཡིན། །\n\nསེམས་མེད་པ་ཡང་བདག་མིན་ཏེ། །སེམས་མེད་ཉིད་ཕྱིར་བུམ་སོགས་བཞིན། །\nའོན་ཏེ་སེམས་དང་ལྡན་པའི་ཕྱིར། །ཤེས་ན་མི་ཤེས་འཇིག་པར་ཐལ། །\nཇི་སྟེ་བདག་ལ་འགྱུར་མེད་ན། །སེམས་པས་དེ་ལ་ཅི་ཞིག་བྱས། །\nདེ་ལྟར་ཤེས་མེད་བྱ་བྲལ་བ། །ནམ་མཁའ་བདག་ཏུ་བྱས་པར་འགྱུར། །\n\nགལ་ཏེ་བདག་ནི་ཡོད་མིན་ན། །ལས་འབྲས་འབྲེལ་པ་རིགས་མིན་ཏེ། །\nལས་བྱས་ནས་ནི་ཞིག་པས་ན། །སུ་ཡི་ལས་སུ་འགྱུར་ཞེ་ན། །\nབྱ་བ་འབྲས་གཞི་ཐ་དད་དང་། །དེར་བདག་བྱེད་པ་མེད་པར་ཡང་། །\nཡུ་བུ་གཉི་ག་ལ་གྲུབ་པས། །འདིར་བརྩད་དོན་མེད་མ་ཡིན་ནམ། །\nརྒྱུ་ལྡན་འབྲས་བུ་དང་བཅས་ཞེས། །མཐོང་བ་འདི་ནི་སྲིད་མ་ཡིན། །\nརྒྱུད་གཅིག་ལ་ནི་བརྟེན་ནས་སུ། །བྱེད་པོ་སྤྱོད་པོ་ཞེས་བྱར་བསྟན། །\nའདས་དང་མ་འོངས་པ་ཡི་སེམས། །བདག་མིན་དེ་ནི་མེད་པའི་ཕྱིར། །\nའོན་ཏེ་སྐྱེས་སེམས་བདག་ཡིན་ན། །དེ་ཞིག་ན་ཡང་བདག་མེད་དོ། །\n\nདཔེར་ན་ཆུ་ཤིང་སྡོང་པོ་དག །ཆ་ཤས་ཕྱེ་ན་འགའ་མེད་པ། །\nདེ་བཞིན་རྣམ་པར་དཔྱད་པ་ཡིས། །བཙལ་ན་བདག་ཀྱང་ཡང་དག་མིན། །\n\nགལ་ཏེ་སེམས་ཅན་ཡོད་མིན་ན། །སུ་ལ་སྙིང་རྗེ་བྱ་ཞེ་ན། །\nའབྲས་བུའི་དོན་དུ་ཁས་བླངས་པའི། །རྨོངས་པས་བརྟགས་པ་གང་ཡིན་པའོ། །\nསེམས་ཅན་མེད་འབྲས་སུ་ཡི་ཡིན། །བདེན་ཏེ་འོན་ཀྱང་རྨོངས་ལས་འདོད། །\nསྡུག་བསྔལ་ཉེ་བར་ཞི་དོན་དུ། །འབྲས་བུའི་རྨོངས་པ་བཟློག་མི་བྱ། །\nསྡུག་བསྔལ་རྒྱུ་ཡི་ང་རྒྱལ་ནི། །བདག་ཏུ་རྨོངས་པས་འཕེལ་བར་འགྱུར། །\nདེ་ལས་ཀྱང་བཟློག་མེད་ཅེ་ན། །བདག་མེད་བསྒོམ་པ་མཆོག་ཡིན་ནོ། །\n\nལུས་ནི་རྐང་པ་བྱིན་པ་མིན། །བརླ་དང་རྐེད་པའང་ལུས་མ་ཡིན། །\nལྟོ་དང་རྒྱབ་ཀྱང་ལུས་མིན་ཏེ། །བྲང་དང་དཔུང་པའང་ལུས་མ་ཡིན། །\nརྩིབ་ལོགས་ལག་པའང་ལུས་མིན་ཏེ། །མཆན་ཁུང་ཕྲག་པའང་ལུས་མ་ཡིན། །\nནང་ཁྲོལ་རྣམས་ཀྱང་དེ་མིན་ལ། །མགོ་དང་མགྲིན་པའང་ལུས་མིན་ན། །\nའདི་ལ་ལུས་ནི་གང་ཞིག་ཡིན། །གལ་ཏེ་ལུས་འདི་ཐམས་ཅད་ལ། །\nཕྱོགས་རེ་ཡིས་ནི་གནས་གྱུར་ན། །ཆ་རྣམས་ཆ་ལ་གནས་གྱུར་མོད། །\nདེ་རང་ཉིད་ནི་གང་ལ་གནས། །གལ་ཏེ་བདག་ཉིད་ཀུན་གྱི་ལུས། །\nལག་སོགས་རྣམས་ལ་གནས་ན་ནི། །ལག་སོགས་དེ་དག་ཇི་སྙེད་པ། །\nདེ་སྙེད་ཀྱི་ནི་ལུས་སུ་འགྱུར། །ཕྱི་དང་ནང་ན་ལུས་མེད་ན། །\nཇི་ལྟར་ལག་སོགས་ལ་ལུས་ཡོད། །ལག་སོགས་རྣམས་ལས་གཞན་མེད་ན། །\nདེ་ནི་ཇི་ལྟར་ཡོད་པ་ཡིན། །དེས་ན་ལུས་མེད་ལག་སོགས་ལ། །\nརྨོངས་པ་ཡིས་ནི་ལུས་བློར་འགྱུར། །དབྱིབས་སུ་བཀོད་པའི་ཁྱད་པར་གྱིས། །\nཐོ་ཡོར་ལ་ནི་མི་བློ་བཞིན། །ཇི་སྲིད་རྐྱེན་ཚོགས་དེ་སྲིད་དུ། །\nལུས་ནི་སྐྱེས་བུ་ལྟར་སྣང་བ། །དེ་བཞིན་ཇི་སྲིད་ལག་སོགས་ལ། །\nདེ་ཡོད་དེ་སྲིད་དེར་ལུས་སྣང་། །\n\nདེ་བཞིན་སོར་མོའི་ཚོགས་ཡིན་ཕྱིར། །ལག་པའང་གང་ཞིག་ཡིན་པར་འགྱུར། །\nདེ་ཡང་ཚིགས་ཀྱི་ཚོགས་ཡིན་ཕྱིར། །ཚིགས་ཀྱང་རང་གི་ཆ་ཕྱེ་བས། །\nཆ་ཡང་རྡུལ་དུ་ཕྱེ་བས་ཏེ། །རྡུལ་དེའང་ཕྱོགས་ཆའི་དབྱེ་བ་ཡིས། །\nཕྱོགས་དབྱེའང་ཆ་ཤས་དང་བྲལ་ཕྱིར། །མཁའ་བཞིན་དེས་ན་རྡུལ་ཡང་མེད། །\n\nདེ་ལྟར་རྨི་ལམ་ལྟ་བུ་ཡི། །གཟུགས་ལ་དཔྱོད་ལྡན་སུ་ཞིག་ཆགས། །\nགང་ཚེ་དེ་ལྟར་ལུས་མེད་པ། །དེ་ཚེ་སྐྱེས་གང་བུད་མེད་གང་། །\n\nསྡུག་བསྔལ་དེ་ཉིད་དུ་ཡོད་ན། །ཅི་སྟེ་རབ་དགའ་ལ་མི་གནོད། །\nབདེ་ན་མྱ་ངན་གདུང་སོགས་ལ། །ཞིམ་སོགས་ཅི་སྟེ་དགའ་མི་བྱེད། །\nསྟོབས་དང་ལྡན་པས་ཟིལ་མནན་ཕྱིར། །གལ་ཏེ་དེ་མྱོང་མ་ཡིན་ན། །\nགང་ཞིག་ཉམས་མྱོང་བདག་ཉིད་མིན། །དེ་ནི་ཚོར་བ་ཇི་ལྟར་ཡིན། །\nསྡུག་བསྔལ་ཕྲ་མོ་ཉིད་དུ་ཡོད། །འདི་ཡི་རགས་པ་བསལ་མིན་ནམ། །\nདེ་ནི་དེ་ལས་གཞན་དགའ་ཙམ། །ཞེ་ན་ཕྲ་ཉིད་དེ་ཡང་དེའི། །\nགལ་ཏེ་འགལ་རྐྱེན་སྐྱེས་པས་ན། །སྡུག་བསྔལ་སྐྱེས་པ་མིན་ན་ནི། །\nཚོར་བར་རྟོག་པ་མངོན་ཞེན་ཉིད། །ཡིན་ཞེས་བྱ་བར་གྲུབ་མིན་ནམ། །\nདེ་ཉིད་ཕྱིར་ན་འདི་ཡི་ནི། །གཉེན་པོ་རྣམ་དཔྱོད་འདི་བསྒོམ་སྟེ། །\nརྣམ་བརྟགས་ཞིང་ལས་བྱུང་བ་ཡི། །བསམ་གཏན་རྣལ་འབྱོར་པ་ཡི་ཟས། །\n\nགལ་ཏེ་དབང་དོན་བར་བཅས་ན། །དེ་དག་གང་དུ་ཕྲད་པར་འགྱུར། །\nབར་མེད་ན་ཡང་གཅིག་ཉིད་དེ། །གང་ཞིག་གང་དང་ཕྲད་པར་འགྱུར། །\nརྡུལ་ཕྲན་རྡུལ་ཕྲན་ལ་འཇུག་མེད། །དེ་ནི་སྐབས་མེད་མཉམ་པ་ཡིན། །\nམ་ཞུགས་པ་ལ་འདྲེས་མེད་ཅིང་། །མ་འདྲེས་པ་ལ་ཕྲད་པ་མེད། །\nཆ་མེད་པ་ལའང་ཕྲད་པ་ཞེས། །བྱ་བ་ཇི་ལྟར་འཐད་པར་འགྱུར། །\nཕྲད་པ་དང་ནི་ཆ་མེད་པར། །གལ་ཏེ་མཐོང་ན་བསྟན་པར་གྱིས། །\nརྣམ་ཤེས་ལུས་མེད་པ་ལ་ནི། །ཕྲད་པ་འཐད་པ་མ་ཡིན་ཉིད། །\nཚོགས་པའང་དངོས་པོ་མེད་ཕྱིར་ཏེ། །སྔར་ནི་ཇི་ལྟར་རྣམ་དཔྱད་བཞིན། །\n\nདེ་ལྟར་རེག་པ་ཡོད་མིན་ན། །ཚོར་བ་གང་ལས་འབྱུང་བར་འགྱུར། །\nངལ་འདི་ཅི་ཡི་དོན་དུ་ཡིན། །གང་གིས་གང་ལ་གནོད་པར་འགྱུར། །\n\nགང་ཚེ་ཚོར་པོ་འགའ་མེད་ཅིང་། །ཚོར་བའང་ཡོད་པ་མ་ཡིན་པ། །\nདེ་ཚེ་གནས་སྐབས་འདི་མཐོང་ནས། །སྲེད་པ་ཅི་ཕྱིར་ལྡོག་མི་འགྱུར། །\nམཐོང་བ་འམ་ནི་རེག་པ་ཡང་། །རྨི་ལམ་སྒྱུ་འདྲའི་བདག་ཉིད་ཀྱིས། །\nསེམས་དང་ལྷན་ཅིག་སྐྱེས་པའི་ཕྱིར། །ཚོར་བ་དེ་ཡིས་མཐོང་མ་ཡིན། །\nསྔར་དང་ཕྱི་མར་སྐྱེས་པས་ཀྱང་། །དྲན་པར་འགྱུར་གྱི་མྱོང་མ་ཡིན། །\nརང་གིས་བདག་ཉིད་མྱོང་མིན་ལ། །གཞན་དག་གིས་ཀྱང་མྱོང་མ་ཡིན། །\n༔ཚོར་པོ་འགའ་ཡང་ཡོད་མིན་ཏེ། །དེས་ན་ཚོར་བ་དེ་ཉིད་མིན། །\nདེ་ལྟར་བདག་མེད་ཚོགས་འདི་ལ། །འདི་ཡིས་ཅི་སྟེ་གནོད་པར་བྱ། །\n\nཡིད་ནི་དབང་རྣམས་ལ་མི་གནས། །གཟུགས་སོགས་ལ་མིན་བར་ནའང་མིན། །\nནང་ཡང་སེམས་མིན་ཕྱི་མིན་ཞིང་། །གཞན་དུ་ཡང་ནི་རྙེད་མ་ཡིན། །\nགང་ཞིག་ལུས་མིན་གཞན་དུ་མིན། །འདྲེས་མིན་ལོགས་སུའང་འགར་མེད་པ། །\nདེ་ནི་ཅུང་ཟད་མིན་དེའི་ཕྱིར། །སེམས་ཅན་རང་བཞིན་མྱ་ངན་འདས། །\n\nཤེས་བྱ་ལས་སྔར་ཤེས་ཡོད་ན། །དེ་ནི་ཅི་ལ་དམིགས་ནས་སྐྱེ། །\nཤེས་དང་ཤེས་བྱ་ལྷན་ཅིག་ན། །དེ་ནི་ཅི་ལ་དམིགས་ནས་སྐྱེ། །\nའོན་ཏེ་ཤེས་བྱའི་ཕྱིས་ཡོད་ན། །དེ་ཚེ་ཤེས་པ་གང་ལས་སྐྱེ། །\n\nདེ་ལྟར་ཆོས་རྣམས་ཐམས་ཅད་ཀྱི། །སྐྱེ་བ་རྟོགས་པར་འགྱུར་མ་ཡིན། །\n\nགལ་ཏེ་དེ་ལྟར་ཀུན་རྫོབ་མེད། །དེ་ལ་བདེན་གཉིས་ག་ལ་ཡོད། །\nདེ་ཡང་ཀུན་རྫོབ་གཞན་གྱིས་ན། །སེམས་ཅན་མྱ་ངན་ག་ལ་འདའ། །\nའདི་ནི་གཞན་སེམས་རྣམ་རྟོག་སྟེ། །དེ་ནི་རང་གི་ཀུན་རྫོབ་མིན། །\nཕྱིས་དེ་ངེས་ན་དེ་ཡོད་དེ། །མིན་ན་ཀུན་རྫོབ་མེད་པ་ཉིད། །\n\nརྟོག་དང་བརྟག་པར་བྱ་བ་དག །གཉིས་པོ་ཕན་ཚུན་བརྟེན་པ་ཡིན། །\nཇི་ལྟར་གྲགས་པ་ལ་བརྟེན་ནས། །རྣམ་པར་དཔྱད་པ་ཐམས་ཅད་བརྗོད། །\n\nགང་ཚེ་རྣམ་པར་དཔྱད་པ་ཡི། །རྣམ་དཔྱོད་ཀྱིས་ནི་དཔྱོད་བྱེད་ན། །\nདེ་ཚེ་རྣམ་དཔྱོད་དེ་ཡང་ནི། །རྣམ་དཔྱོད་ཕྱིར་ན་ཐུག་པ་མེད། །\nདཔྱད་བྱ་རྣམ་པར་དཔྱད་བྱས་ན། །རྣམ་དཔྱོད་ལ་ནི་རྟེན་ཡོད་མིན། །\nརྟེན་མེད་ཕྱིར་ན་མི་སྐྱེ་སྟེ། །དེ་ཡང་མྱ་ངན་འདས་པར་བརྗོད། །",
            "children": [
              {
                "level": "subsubsection",
                "number": "9.2.2.1",
                "title": "གང་ཟག་གི་བདག་མེད་བསྒོམ་ཚུལ། (How to Meditate on the Selflessness of Persons)",
                "verses_span": "90-115",
                "verse_text_excerpt": "སོ་དང་སྐྲ་སེན་བདག་མ་ཡིན། །བདག་ནི་རུས་པ་ཁྲག་མ་ཡིན། །\nསྣབས་མིན་བད་ཀན་མ་ཡིན་ཏེ། །ཆུ་སེར་དང་ནི་རྣག་ཀྱང་མིན། །\nབདག་ནི་ཞག་དང་རྔུལ་མིན་ཏེ། །གློ་མཆིན་དག་ཀྱང་བདག་མ་ཡིན། །\nནང་ཁྲོལ་གཞན་ཡང་བདག་མིན་ཏེ། །བདག་ནི་ཕྱི་ས་གཅིན་མ་ཡིན། །\nཤ་དང་པགས་པ་བདག་མིན་ཏེ། །དྲོད་དང་རླུང་ཡང་བདག་མ་ཡིན། །\nབུ་ག་བདག་མིན་རྣམ་ཀུན་དུ། །རྣམ་ཤེས་དྲུག་ཀྱང་བདག་མ་ཡིན། །\n\nགལ་ཏེ་སྒྲ་ཡི་ཤེས་རྟག་ན། །ཐམས་ཅད་ཚེ་ན་སྒྲ་འཛིན་འགྱུར། །\nཤེས་བྱ་མེད་ན་ཅི་ཞིག་རིག །གང་གིས་ཤེས་པ་ཞེས་རྗོད་བྱེད། །\nགལ་ཏེ་ཤེས་མེད་ཤེས་ཡིན་ན། །ཤིང་ཡང་ཤེས་པར་ཐལ་བར་འགྱུར། །\nདེས་ན་ཤེས་བྱ་ཉེར་གནས་པ། །མེད་པར་ཤེས་པ་མེད་ཅེས་ངེས། །\nདེ་ཉིད་ཀྱིས་ནི་གཟུགས་ཤེས་ན། །དེ་ཚེ་ཐོས་པའང་ཅི་སྟེ་མིན། །\nགལ་ཏེ་སྒྲ་མི་ཉེ་ཕྱིར་ན། །དེས་ན་དེ་ཡི་ཤེས་པའང་མེད། །\nསྒྲ་འཛིན་རང་བཞིན་གང་ཡིན་པ། །དེ་གཟུགས་འཛིན་པར་ཇི་ལྟར་འགྱུར། །\nགཅིག་ནི་ཕ་དང་བུ་ཉིད་དུ། །བརྟགས་ཡིན་ཡང་དག་ཉིད་མིན་ཏེ། །\nའདི་ལྟར་སྙིང་སྟོབས་རྡུལ་དང་ནི། །མུན་པ་བུ་མིན་ཕ་ཡང་མིན། །\nདེ་ནི་སྒྲ་འཛིན་དང་ལྡན་པའི། །རང་བཞིན་དུ་ནི་མཐོང་མ་ཡིན། །\nགར་མཁན་ལྟ་བུར་ཚུལ་གཞན་གྱིས། །དེ་ཉིད་མཐོང་ན་དེ་རྟག་མིན། །\nགལ་ཏེ་ཚུལ་གཞན་དེ་ཉིད་ན། །གཅིག་ཉིད་དེ་ནི་སྔོན་མེད་གཅིག །\nགལ་ཏེ་ཚུལ་གཞན་བདེན་མིན་ན། །དེ་ཡི་རང་གི་རང་བཞིན་སྨྲོས། །\nཤེས་ཉིད་ཅེ་ན་དེ་ལྟ་ན། །སྐྱེས་ཀུན་གཅིག་ཏུ་ཐལ་བར་འགྱུར། །\nསེམས་པ་སེམས་མེད་དེ་དག་ཀྱང་། །གཅིག་འགྱུར་གང་ཕྱིར་ཡོད་ཉིད་མཚུངས། །\nགང་ཚེ་བྱེ་བྲག་ཕྱིན་ཅི་ལོག །དེ་ཚེ་འདྲ་བའི་རྟེན་གང་ཡིན། །\n\nསེམས་མེད་པ་ཡང་བདག་མིན་ཏེ། །སེམས་མེད་ཉིད་ཕྱིར་བུམ་སོགས་བཞིན། །\nའོན་ཏེ་སེམས་དང་ལྡན་པའི་ཕྱིར། །ཤེས་ན་མི་ཤེས་འཇིག་པར་ཐལ། །\nཇི་སྟེ་བདག་ལ་འགྱུར་མེད་ན། །སེམས་པས་དེ་ལ་ཅི་ཞིག་བྱས། །\nདེ་ལྟར་ཤེས་མེད་བྱ་བྲལ་བ། །ནམ་མཁའ་བདག་ཏུ་བྱས་པར་འགྱུར། །\n\nགལ་ཏེ་བདག་ནི་ཡོད་མིན་ན། །ལས་འབྲས་འབྲེལ་པ་རིགས་མིན་ཏེ། །\nལས་བྱས་ནས་ནི་ཞིག་པས་ན། །སུ་ཡི་ལས་སུ་འགྱུར་ཞེ་ན། །\nབྱ་བ་འབྲས་གཞི་ཐ་དད་དང་། །དེར་བདག་བྱེད་པ་མེད་པར་ཡང་། །\nཡུ་བུ་གཉི་ག་ལ་གྲུབ་པས། །འདིར་བརྩད་དོན་མེད་མ་ཡིན་ནམ། །\nརྒྱུ་ལྡན་འབྲས་བུ་དང་བཅས་ཞེས། །མཐོང་བ་འདི་ནི་སྲིད་མ་ཡིན། །\nརྒྱུད་གཅིག་ལ་ནི་བརྟེན་ནས་སུ། །བྱེད་པོ་སྤྱོད་པོ་ཞེས་བྱར་བསྟན། །\nའདས་དང་མ་འོངས་པ་ཡི་སེམས། །བདག་མིན་དེ་ནི་མེད་པའི་ཕྱིར། །\nའོན་ཏེ་སྐྱེས་སེམས་བདག་ཡིན་ན། །དེ་ཞིག་ན་ཡང་བདག་མེད་དོ། །\n\nདཔེར་ན་ཆུ་ཤིང་སྡོང་པོ་དག །ཆ་ཤས་ཕྱེ་ན་འགའ་མེད་པ། །\nདེ་བཞིན་རྣམ་པར་དཔྱད་པ་ཡིས། །བཙལ་ན་བདག་ཀྱང་ཡང་དག་མིན། །\n\nགལ་ཏེ་སེམས་ཅན་ཡོད་མིན་ན། །སུ་ལ་སྙིང་རྗེ་བྱ་ཞེ་ན། །\nའབྲས་བུའི་དོན་དུ་ཁས་བླངས་པའི། །རྨོངས་པས་བརྟགས་པ་གང་ཡིན་པའོ། །\nསེམས་ཅན་མེད་འབྲས་སུ་ཡི་ཡིན། །བདེན་ཏེ་འོན་ཀྱང་རྨོངས་ལས་འདོད། །\nསྡུག་བསྔལ་ཉེ་བར་ཞི་དོན་དུ། །འབྲས་བུའི་རྨོངས་པ་བཟློག་མི་བྱ། །\nསྡུག་བསྔལ་རྒྱུ་ཡི་ང་རྒྱལ་ནི། །བདག་ཏུ་རྨོངས་པས་འཕེལ་བར་འགྱུར། །\nདེ་ལས་ཀྱང་བཟློག་མེད་ཅེ་ན། །བདག་མེད་བསྒོམ་པ་མཆོག་ཡིན་ནོ། །",
                "children": [
                  {
                    "level": "subsubsubsection",
                    "number": "9.2.2.1.1",
                    "title": "ལྷན་སྐྱེས་ཀྱི་བདག་སྟོང་པར་བསྒོམ་ཚུལ། (How to Meditate on the Emptiness of the Innate Self)",
                    "verses_span": "90-93",
                    "verse_text_excerpt": "སོ་དང་སྐྲ་སེན་བདག་མ་ཡིན། །བདག་ནི་རུས་པ་ཁྲག་མ་ཡིན། །\nསྣབས་མིན་བད་ཀན་མ་ཡིན་ཏེ། །ཆུ་སེར་དང་ནི་རྣག་ཀྱང་མིན། །\nབདག་ནི་ཞག་དང་རྔུལ་མིན་ཏེ། །གློ་མཆིན་དག་ཀྱང་བདག་མ་ཡིན། །\nནང་ཁྲོལ་གཞན་ཡང་བདག་མིན་ཏེ། །བདག་ནི་ཕྱི་ས་གཅིན་མ་ཡིན། །\nཤ་དང་པགས་པ་བདག་མིན་ཏེ། །དྲོད་དང་རླུང་ཡང་བདག་མ་ཡིན། །\nབུ་ག་བདག་མིན་རྣམ་ཀུན་དུ། །རྣམ་ཤེས་དྲུག་ཀྱང་བདག་མ་ཡིན། །",
                    "children": []
                  },
                  {
                    "level": "subsubsubsection",
                    "number": "9.2.2.1.2",
                    "title": "ཀུན་བརྟགས་ཀྱི་བདག་སྟོང་པར་བསྒོམ་ཚུལ། (How to Meditate on the Emptiness of the Imputed Self)",
                    "verses_span": "94-115",
                    "verse_text_excerpt": "གལ་ཏེ་སྒྲ་ཡི་ཤེས་རྟག་ན། །ཐམས་ཅད་ཚེ་ན་སྒྲ་འཛིན་འགྱུར། །\nཤེས་བྱ་མེད་ན་ཅི་ཞིག་རིག །གང་གིས་ཤེས་པ་ཞེས་རྗོད་བྱེད། །\nགལ་ཏེ་ཤེས་མེད་ཤེས་ཡིན་ན། །ཤིང་ཡང་ཤེས་པར་ཐལ་བར་འགྱུར། །\nདེས་ན་ཤེས་བྱ་ཉེར་གནས་པ། །མེད་པར་ཤེས་པ་མེད་ཅེས་ངེས། །\nདེ་ཉིད་ཀྱིས་ནི་གཟུགས་ཤེས་ན། །དེ་ཚེ་ཐོས་པའང་ཅི་སྟེ་མིན། །\nགལ་ཏེ་སྒྲ་མི་ཉེ་ཕྱིར་ན། །དེས་ན་དེ་ཡི་ཤེས་པའང་མེད། །\nསྒྲ་འཛིན་རང་བཞིན་གང་ཡིན་པ། །དེ་གཟུགས་འཛིན་པར་ཇི་ལྟར་འགྱུར། །\nགཅིག་ནི་ཕ་དང་བུ་ཉིད་དུ། །བརྟགས་ཡིན་ཡང་དག་ཉིད་མིན་ཏེ། །\nའདི་ལྟར་སྙིང་སྟོབས་རྡུལ་དང་ནི། །མུན་པ་བུ་མིན་ཕ་ཡང་མིན། །\nདེ་ནི་སྒྲ་འཛིན་དང་ལྡན་པའི། །རང་བཞིན་དུ་ནི་མཐོང་མ་ཡིན། །\nགར་མཁན་ལྟ་བུར་ཚུལ་གཞན་གྱིས། །དེ་ཉིད་མཐོང་ན་དེ་རྟག་མིན། །\nགལ་ཏེ་ཚུལ་གཞན་དེ་ཉིད་ན། །གཅིག་ཉིད་དེ་ནི་སྔོན་མེད་གཅིག །\nགལ་ཏེ་ཚུལ་གཞན་བདེན་མིན་ན། །དེ་ཡི་རང་གི་རང་བཞིན་སྨྲོས། །\nཤེས་ཉིད་ཅེ་ན་དེ་ལྟ་ན། །སྐྱེས་ཀུན་གཅིག་ཏུ་ཐལ་བར་འགྱུར། །\nསེམས་པ་སེམས་མེད་དེ་དག་ཀྱང་། །གཅིག་འགྱུར་གང་ཕྱིར་ཡོད་ཉིད་མཚུངས། །\nགང་ཚེ་བྱེ་བྲག་ཕྱིན་ཅི་ལོག །དེ་ཚེ་འདྲ་བའི་རྟེན་གང་ཡིན། །\n\nསེམས་མེད་པ་ཡང་བདག་མིན་ཏེ། །སེམས་མེད་ཉིད་ཕྱིར་བུམ་སོགས་བཞིན། །\nའོན་ཏེ་སེམས་དང་ལྡན་པའི་ཕྱིར། །ཤེས་ན་མི་ཤེས་འཇིག་པར་ཐལ། །\nཇི་སྟེ་བདག་ལ་འགྱུར་མེད་ན། །སེམས་པས་དེ་ལ་ཅི་ཞིག་བྱས། །\nདེ་ལྟར་ཤེས་མེད་བྱ་བྲལ་བ། །ནམ་མཁའ་བདག་ཏུ་བྱས་པར་འགྱུར། །\n\nགལ་ཏེ་བདག་ནི་ཡོད་མིན་ན། །ལས་འབྲས་འབྲེལ་པ་རིགས་མིན་ཏེ། །\nལས་བྱས་ནས་ནི་ཞིག་པས་ན། །སུ་ཡི་ལས་སུ་འགྱུར་ཞེ་ན། །\nབྱ་བ་འབྲས་གཞི་ཐ་དད་དང་། །དེར་བདག་བྱེད་པ་མེད་པར་ཡང་། །\nཡུ་བུ་གཉི་ག་ལ་གྲུབ་པས། །འདིར་བརྩད་དོན་མེད་མ་ཡིན་ནམ། །\nརྒྱུ་ལྡན་འབྲས་བུ་དང་བཅས་ཞེས། །མཐོང་བ་འདི་ནི་སྲིད་མ་ཡིན། །\nརྒྱུད་གཅིག་ལ་ནི་བརྟེན་ནས་སུ། །བྱེད་པོ་སྤྱོད་པོ་ཞེས་བྱར་བསྟན། །\nའདས་དང་མ་འོངས་པ་ཡི་སེམས། །བདག་མིན་དེ་ནི་མེད་པའི་ཕྱིར། །\nའོན་ཏེ་སྐྱེས་སེམས་བདག་ཡིན་ན། །དེ་ཞིག་ན་ཡང་བདག་མེད་དོ། །\n\nདཔེར་ན་ཆུ་ཤིང་སྡོང་པོ་དག །ཆ་ཤས་ཕྱེ་ན་འགའ་མེད་པ། །\nདེ་བཞིན་རྣམ་པར་དཔྱད་པ་ཡིས། །བཙལ་ན་བདག་ཀྱང་ཡང་དག་མིན། །\n\nགལ་ཏེ་སེམས་ཅན་ཡོད་མིན་ན། །སུ་ལ་སྙིང་རྗེ་བྱ་ཞེ་ན། །\nའབྲས་བུའི་དོན་དུ་ཁས་བླངས་པའི། །རྨོངས་པས་བརྟགས་པ་གང་ཡིན་པའོ། །\nསེམས་ཅན་མེད་འབྲས་སུ་ཡི་ཡིན། །བདེན་ཏེ་འོན་ཀྱང་རྨོངས་ལས་འདོད། །\nསྡུག་བསྔལ་ཉེ་བར་ཞི་དོན་དུ། །འབྲས་བུའི་རྨོངས་པ་བཟློག་མི་བྱ། །\nསྡུག་བསྔལ་རྒྱུ་ཡི་ང་རྒྱལ་ནི། །བདག་ཏུ་རྨོངས་པས་འཕེལ་བར་འགྱུར། །\nདེ་ལས་ཀྱང་བཟློག་མེད་ཅེ་ན། །བདག་མེད་བསྒོམ་པ་མཆོག་ཡིན་ནོ། །",
                    "children": [
                      {
                        "level": "paragraph",
                        "number": "9.2.2.1.2.1",
                        "title": "བདག་ཤེས་པར་འདོད་པ་དགག་པ། (Refuting the Assertion that the Self is Consciousness)",
                        "verses_span": "94-103",
                        "verse_text_excerpt": "གལ་ཏེ་སྒྲ་ཡི་ཤེས་རྟག་ན། །ཐམས་ཅད་ཚེ་ན་སྒྲ་འཛིན་འགྱུར། །\nཤེས་བྱ་མེད་ན་ཅི་ཞིག་རིག །གང་གིས་ཤེས་པ་ཞེས་རྗོད་བྱེད། །\nགལ་ཏེ་ཤེས་མེད་ཤེས་ཡིན་ན། །ཤིང་ཡང་ཤེས་པར་ཐལ་བར་འགྱུར། །\nདེས་ན་ཤེས་བྱ་ཉེར་གནས་པ། །མེད་པར་ཤེས་པ་མེད་ཅེས་ངེས། །\nདེ་ཉིད་ཀྱིས་ནི་གཟུགས་ཤེས་ན། །དེ་ཚེ་ཐོས་པའང་ཅི་སྟེ་མིན། །\nགལ་ཏེ་སྒྲ་མི་ཉེ་ཕྱིར་ན། །དེས་ན་དེ་ཡི་ཤེས་པའང་མེད། །\nསྒྲ་འཛིན་རང་བཞིན་གང་ཡིན་པ། །དེ་གཟུགས་འཛིན་པར་ཇི་ལྟར་འགྱུར། །\nགཅིག་ནི་ཕ་དང་བུ་ཉིད་དུ། །བརྟགས་ཡིན་ཡང་དག་ཉིད་མིན་ཏེ། །\nའདི་ལྟར་སྙིང་སྟོབས་རྡུལ་དང་ནི། །མུན་པ་བུ་མིན་ཕ་ཡང་མིན། །\nདེ་ནི་སྒྲ་འཛིན་དང་ལྡན་པའི། །རང་བཞིན་དུ་ནི་མཐོང་མ་ཡིན། །\nགར་མཁན་ལྟ་བུར་ཚུལ་གཞན་གྱིས། །དེ་ཉིད་མཐོང་ན་དེ་རྟག་མིན། །\nགལ་ཏེ་ཚུལ་གཞན་དེ་ཉིད་ན། །གཅིག་ཉིད་དེ་ནི་སྔོན་མེད་གཅིག །\nགལ་ཏེ་ཚུལ་གཞན་བདེན་མིན་ན། །དེ་ཡི་རང་གི་རང་བཞིན་སྨྲོས། །\nཤེས་ཉིད་ཅེ་ན་དེ་ལྟ་ན། །སྐྱེས་ཀུན་གཅིག་ཏུ་ཐལ་བར་འགྱུར། །\nསེམས་པ་སེམས་མེད་དེ་དག་ཀྱང་། །གཅིག་འགྱུར་གང་ཕྱིར་ཡོད་ཉིད་མཚུངས། །\nགང་ཚེ་བྱེ་བྲག་ཕྱིན་ཅི་ལོག །དེ་ཚེ་འདྲ་བའི་རྟེན་གང་ཡིན། །",
                        "children": []
                      },
                      {
                        "level": "paragraph",
                        "number": "9.2.2.1.2.2",
                        "title": "བདག་བེམ་པོར་འདོད་པ་དགག་པ། (Refuting the Assertion that the Self is Inanimate)",
                        "verses_span": "104-106",
                        "verse_text_excerpt": "སེམས་མེད་པ་ཡང་བདག་མིན་ཏེ། །སེམས་མེད་ཉིད་ཕྱིར་བུམ་སོགས་བཞིན། །\nའོན་ཏེ་སེམས་དང་ལྡན་པའི་ཕྱིར། །ཤེས་ན་མི་ཤེས་འཇིག་པར་ཐལ། །\nཇི་སྟེ་བདག་ལ་འགྱུར་མེད་ན། །སེམས་པས་དེ་ལ་ཅི་ཞིག་བྱས། །\nདེ་ལྟར་ཤེས་མེད་བྱ་བྲལ་བ། །ནམ་མཁའ་བདག་ཏུ་བྱས་པར་འགྱུར། །",
                        "children": []
                      },
                      {
                        "level": "paragraph",
                        "number": "9.2.2.1.2.3",
                        "title": "བདག་མེད་པའི་དོན་ལ་རྩོད་པ་སྤོང་བ། (Dispelling Disputes Regarding the Meaning of Selflessness)",
                        "verses_span": "107-115",
                        "verse_text_excerpt": "གལ་ཏེ་བདག་ནི་ཡོད་མིན་ན། །ལས་འབྲས་འབྲེལ་པ་རིགས་མིན་ཏེ། །\nལས་བྱས་ནས་ནི་ཞིག་པས་ན། །སུ་ཡི་ལས་སུ་འགྱུར་ཞེ་ན། །\nབྱ་བ་འབྲས་གཞི་ཐ་དད་དང་། །དེར་བདག་བྱེད་པ་མེད་པར་ཡང་། །\nཡུ་བུ་གཉི་ག་ལ་གྲུབ་པས། །འདིར་བརྩད་དོན་མེད་མ་ཡིན་ནམ། །\nརྒྱུ་ལྡན་འབྲས་བུ་དང་བཅས་ཞེས། །མཐོང་བ་འདི་ནི་སྲིད་མ་ཡིན། །\nརྒྱུད་གཅིག་ལ་ནི་བརྟེན་ནས་སུ། །བྱེད་པོ་སྤྱོད་པོ་ཞེས་བྱར་བསྟན། །\nའདས་དང་མ་འོངས་པ་ཡི་སེམས། །བདག་མིན་དེ་ནི་མེད་པའི་ཕྱིར། །\nའོན་ཏེ་སྐྱེས་སེམས་བདག་ཡིན་ན། །དེ་ཞིག་ན་ཡང་བདག་མེད་དོ། །\n\nདཔེར་ན་ཆུ་ཤིང་སྡོང་པོ་དག །ཆ་ཤས་ཕྱེ་ན་འགའ་མེད་པ། །\nདེ་བཞིན་རྣམ་པར་དཔྱད་པ་ཡིས། །བཙལ་ན་བདག་ཀྱང་ཡང་དག་མིན། །\n\nགལ་ཏེ་སེམས་ཅན་ཡོད་མིན་ན། །སུ་ལ་སྙིང་རྗེ་བྱ་ཞེ་ན། །\nའབྲས་བུའི་དོན་དུ་ཁས་བླངས་པའི། །རྨོངས་པས་བརྟགས་པ་གང་ཡིན་པའོ། །\nསེམས་ཅན་མེད་འབྲས་སུ་ཡི་ཡིན། །བདེན་ཏེ་འོན་ཀྱང་རྨོངས་ལས་འདོད། །\nསྡུག་བསྔལ་ཉེ་བར་ཞི་དོན་དུ། །འབྲས་བུའི་རྨོངས་པ་བཟློག་མི་བྱ། །\nསྡུག་བསྔལ་རྒྱུ་ཡི་ང་རྒྱལ་ནི། །བདག་ཏུ་རྨོངས་པས་འཕེལ་བར་འགྱུར། །\nདེ་ལས་ཀྱང་བཟློག་མེད་ཅེ་ན། །བདག་མེད་བསྒོམ་པ་མཆོག་ཡིན་ནོ། །",
                        "children": [
                          {
                            "level": "subparagraph",
                            "number": "9.2.2.1.2.3.1",
                            "title": "བདག་མེད་ན་ལས་འབྲས་མི་འཐད་པའི་རྩོད་སྤོང༌། (Dispelling the dispute that karma and its effects are untenable if there is no self)",
                            "verses_span": "107-111",
                            "verse_text_excerpt": "གལ་ཏེ་བདག་ནི་ཡོད་མིན་ན། །ལས་འབྲས་འབྲེལ་པ་རིགས་མིན་ཏེ། །\nལས་བྱས་ནས་ནི་ཞིག་པས་ན། །སུ་ཡི་ལས་སུ་འགྱུར་ཞེ་ན། །\nབྱ་བ་འབྲས་གཞི་ཐ་དད་དང་། །དེར་བདག་བྱེད་པ་མེད་པར་ཡང་། །\nཡུ་བུ་གཉི་ག་ལ་གྲུབ་པས། །འདིར་བརྩད་དོན་མེད་མ་ཡིན་ནམ། །\nརྒྱུ་ལྡན་འབྲས་བུ་དང་བཅས་ཞེས། །མཐོང་བ་འདི་ནི་སྲིད་མ་ཡིན། །\nརྒྱུད་གཅིག་ལ་ནི་བརྟེན་ནས་སུ། །བྱེད་པོ་སྤྱོད་པོ་ཞེས་བྱར་བསྟན། །\nའདས་དང་མ་འོངས་པ་ཡི་སེམས། །བདག་མིན་དེ་ནི་མེད་པའི་ཕྱིར། །\nའོན་ཏེ་སྐྱེས་སེམས་བདག་ཡིན་ན། །དེ་ཞིག་ན་ཡང་བདག་མེད་དོ། །",
                            "children": []
                          },
                          {
                            "level": "subparagraph",
                            "number": "9.2.2.1.2.3.2",
                            "title": "བདག་མེད་ན་སྙིང་རྗེ་མི་འཐད་པའི་རྩོད་སྤོང༌། (Dispelling the dispute that compassion is untenable if there is no self)",
                            "verses_span": "112-112",
                            "verse_text_excerpt": "དཔེར་ན་ཆུ་ཤིང་སྡོང་པོ་དག །ཆ་ཤས་ཕྱེ་ན་འགའ་མེད་པ། །\nདེ་བཞིན་རྣམ་པར་དཔྱད་པ་ཡིས། །བཙལ་ན་བདག་ཀྱང་ཡང་དག་མིན། །",
                            "children": []
                          },
                          {
                            "level": "subparagraph",
                            "number": "9.2.2.1.2.3.3",
                            "title": "བཏགས་པའི་བདག་མི་འགོགས་པར་བསྟན་པ། (Showing that the Imputed Self is Not Negated)",
                            "verses_span": "113-115",
                            "verse_text_excerpt": "གལ་ཏེ་སེམས་ཅན་ཡོད་མིན་ན། །སུ་ལ་སྙིང་རྗེ་བྱ་ཞེ་ན། །\nའབྲས་བུའི་དོན་དུ་ཁས་བླངས་པའི། །རྨོངས་པས་བརྟགས་པ་གང་ཡིན་པའོ། །\nསེམས་ཅན་མེད་འབྲས་སུ་ཡི་ཡིན། །བདེན་ཏེ་འོན་ཀྱང་རྨོངས་ལས་འདོད། །\nསྡུག་བསྔལ་ཉེ་བར་ཞི་དོན་དུ། །འབྲས་བུའི་རྨོངས་པ་བཟློག་མི་བྱ། །\nསྡུག་བསྔལ་རྒྱུ་ཡི་ང་རྒྱལ་ནི། །བདག་ཏུ་རྨོངས་པས་འཕེལ་བར་འགྱུར། །\nདེ་ལས་ཀྱང་བཟློག་མེད་ཅེ་ན། །བདག་མེད་བསྒོམ་པ་མཆོག་ཡིན་ནོ། །",
                            "children": []
                          }
                        ]
                      }
                    ]
                  }
                ]
              },
              {
                "level": "subsubsection",
                "number": "9.2.2.2",
                "title": "ཆོས་ཀྱི་བདག་མེད་བསྒོམ་ཚུལ། (How to Meditate on the Selflessness of Phenomena - Four Mindfulness Applications)",
                "verses_span": "116-155",
                "verse_text_excerpt": "ལུས་ནི་རྐང་པ་བྱིན་པ་མིན། །བརླ་དང་རྐེད་པའང་ལུས་མ་ཡིན། །\nལྟོ་དང་རྒྱབ་ཀྱང་ལུས་མིན་ཏེ། །བྲང་དང་དཔུང་པའང་ལུས་མ་ཡིན། །\nརྩིབ་ལོགས་ལག་པའང་ལུས་མིན་ཏེ། །མཆན་ཁུང་ཕྲག་པའང་ལུས་མ་ཡིན། །\nནང་ཁྲོལ་རྣམས་ཀྱང་དེ་མིན་ལ། །མགོ་དང་མགྲིན་པའང་ལུས་མིན་ན། །\nའདི་ལ་ལུས་ནི་གང་ཞིག་ཡིན། །གལ་ཏེ་ལུས་འདི་ཐམས་ཅད་ལ། །\nཕྱོགས་རེ་ཡིས་ནི་གནས་གྱུར་ན། །ཆ་རྣམས་ཆ་ལ་གནས་གྱུར་མོད། །\nདེ་རང་ཉིད་ནི་གང་ལ་གནས། །གལ་ཏེ་བདག་ཉིད་ཀུན་གྱི་ལུས། །\nལག་སོགས་རྣམས་ལ་གནས་ན་ནི། །ལག་སོགས་དེ་དག་ཇི་སྙེད་པ། །\nདེ་སྙེད་ཀྱི་ནི་ལུས་སུ་འགྱུར། །ཕྱི་དང་ནང་ན་ལུས་མེད་ན། །\nཇི་ལྟར་ལག་སོགས་ལ་ལུས་ཡོད། །ལག་སོགས་རྣམས་ལས་གཞན་མེད་ན། །\nདེ་ནི་ཇི་ལྟར་ཡོད་པ་ཡིན། །དེས་ན་ལུས་མེད་ལག་སོགས་ལ། །\nརྨོངས་པ་ཡིས་ནི་ལུས་བློར་འགྱུར། །དབྱིབས་སུ་བཀོད་པའི་ཁྱད་པར་གྱིས། །\nཐོ་ཡོར་ལ་ནི་མི་བློ་བཞིན། །ཇི་སྲིད་རྐྱེན་ཚོགས་དེ་སྲིད་དུ། །\nལུས་ནི་སྐྱེས་བུ་ལྟར་སྣང་བ། །དེ་བཞིན་ཇི་སྲིད་ལག་སོགས་ལ། །\nདེ་ཡོད་དེ་སྲིད་དེར་ལུས་སྣང་། །\n\nདེ་བཞིན་སོར་མོའི་ཚོགས་ཡིན་ཕྱིར། །ལག་པའང་གང་ཞིག་ཡིན་པར་འགྱུར། །\nདེ་ཡང་ཚིགས་ཀྱི་ཚོགས་ཡིན་ཕྱིར། །ཚིགས་ཀྱང་རང་གི་ཆ་ཕྱེ་བས། །\nཆ་ཡང་རྡུལ་དུ་ཕྱེ་བས་ཏེ། །རྡུལ་དེའང་ཕྱོགས་ཆའི་དབྱེ་བ་ཡིས། །\nཕྱོགས་དབྱེའང་ཆ་ཤས་དང་བྲལ་ཕྱིར། །མཁའ་བཞིན་དེས་ན་རྡུལ་ཡང་མེད། །\n\nདེ་ལྟར་རྨི་ལམ་ལྟ་བུ་ཡི། །གཟུགས་ལ་དཔྱོད་ལྡན་སུ་ཞིག་ཆགས། །\nགང་ཚེ་དེ་ལྟར་ལུས་མེད་པ། །དེ་ཚེ་སྐྱེས་གང་བུད་མེད་གང་། །\n\nསྡུག་བསྔལ་དེ་ཉིད་དུ་ཡོད་ན། །ཅི་སྟེ་རབ་དགའ་ལ་མི་གནོད། །\nབདེ་ན་མྱ་ངན་གདུང་སོགས་ལ། །ཞིམ་སོགས་ཅི་སྟེ་དགའ་མི་བྱེད། །\nསྟོབས་དང་ལྡན་པས་ཟིལ་མནན་ཕྱིར། །གལ་ཏེ་དེ་མྱོང་མ་ཡིན་ན། །\nགང་ཞིག་ཉམས་མྱོང་བདག་ཉིད་མིན། །དེ་ནི་ཚོར་བ་ཇི་ལྟར་ཡིན། །\nསྡུག་བསྔལ་ཕྲ་མོ་ཉིད་དུ་ཡོད། །འདི་ཡི་རགས་པ་བསལ་མིན་ནམ། །\nདེ་ནི་དེ་ལས་གཞན་དགའ་ཙམ། །ཞེ་ན་ཕྲ་ཉིད་དེ་ཡང་དེའི། །\nགལ་ཏེ་འགལ་རྐྱེན་སྐྱེས་པས་ན། །སྡུག་བསྔལ་སྐྱེས་པ་མིན་ན་ནི། །\nཚོར་བར་རྟོག་པ་མངོན་ཞེན་ཉིད། །ཡིན་ཞེས་བྱ་བར་གྲུབ་མིན་ནམ། །\nདེ་ཉིད་ཕྱིར་ན་འདི་ཡི་ནི། །གཉེན་པོ་རྣམ་དཔྱོད་འདི་བསྒོམ་སྟེ། །\nརྣམ་བརྟགས་ཞིང་ལས་བྱུང་བ་ཡི། །བསམ་གཏན་རྣལ་འབྱོར་པ་ཡི་ཟས། །\n\nགལ་ཏེ་དབང་དོན་བར་བཅས་ན། །དེ་དག་གང་དུ་ཕྲད་པར་འགྱུར། །\nབར་མེད་ན་ཡང་གཅིག་ཉིད་དེ། །གང་ཞིག་གང་དང་ཕྲད་པར་འགྱུར། །\nརྡུལ་ཕྲན་རྡུལ་ཕྲན་ལ་འཇུག་མེད། །དེ་ནི་སྐབས་མེད་མཉམ་པ་ཡིན། །\nམ་ཞུགས་པ་ལ་འདྲེས་མེད་ཅིང་། །མ་འདྲེས་པ་ལ་ཕྲད་པ་མེད། །\nཆ་མེད་པ་ལའང་ཕྲད་པ་ཞེས། །བྱ་བ་ཇི་ལྟར་འཐད་པར་འགྱུར། །\nཕྲད་པ་དང་ནི་ཆ་མེད་པར། །གལ་ཏེ་མཐོང་ན་བསྟན་པར་གྱིས། །\nརྣམ་ཤེས་ལུས་མེད་པ་ལ་ནི། །ཕྲད་པ་འཐད་པ་མ་ཡིན་ཉིད། །\nཚོགས་པའང་དངོས་པོ་མེད་ཕྱིར་ཏེ། །སྔར་ནི་ཇི་ལྟར་རྣམ་དཔྱད་བཞིན། །\n\nདེ་ལྟར་རེག་པ་ཡོད་མིན་ན། །ཚོར་བ་གང་ལས་འབྱུང་བར་འགྱུར། །\nངལ་འདི་ཅི་ཡི་དོན་དུ་ཡིན། །གང་གིས་གང་ལ་གནོད་པར་འགྱུར། །\n\nགང་ཚེ་ཚོར་པོ་འགའ་མེད་ཅིང་། །ཚོར་བའང་ཡོད་པ་མ་ཡིན་པ། །\nདེ་ཚེ་གནས་སྐབས་འདི་མཐོང་ནས། །སྲེད་པ་ཅི་ཕྱིར་ལྡོག་མི་འགྱུར། །\nམཐོང་བ་འམ་ནི་རེག་པ་ཡང་། །རྨི་ལམ་སྒྱུ་འདྲའི་བདག་ཉིད་ཀྱིས། །\nསེམས་དང་ལྷན་ཅིག་སྐྱེས་པའི་ཕྱིར། །ཚོར་བ་དེ་ཡིས་མཐོང་མ་ཡིན། །\nསྔར་དང་ཕྱི་མར་སྐྱེས་པས་ཀྱང་། །དྲན་པར་འགྱུར་གྱི་མྱོང་མ་ཡིན། །\nརང་གིས་བདག་ཉིད་མྱོང་མིན་ལ། །གཞན་དག་གིས་ཀྱང་མྱོང་མ་ཡིན། །\n༔ཚོར་པོ་འགའ་ཡང་ཡོད་མིན་ཏེ། །དེས་ན་ཚོར་བ་དེ་ཉིད་མིན། །\nདེ་ལྟར་བདག་མེད་ཚོགས་འདི་ལ། །འདི་ཡིས་ཅི་སྟེ་གནོད་པར་བྱ། །\n\nཡིད་ནི་དབང་རྣམས་ལ་མི་གནས། །གཟུགས་སོགས་ལ་མིན་བར་ནའང་མིན། །\nནང་ཡང་སེམས་མིན་ཕྱི་མིན་ཞིང་། །གཞན་དུ་ཡང་ནི་རྙེད་མ་ཡིན། །\nགང་ཞིག་ལུས་མིན་གཞན་དུ་མིན། །འདྲེས་མིན་ལོགས་སུའང་འགར་མེད་པ། །\nདེ་ནི་ཅུང་ཟད་མིན་དེའི་ཕྱིར། །སེམས་ཅན་རང་བཞིན་མྱ་ངན་འདས། །\n\nཤེས་བྱ་ལས་སྔར་ཤེས་ཡོད་ན། །དེ་ནི་ཅི་ལ་དམིགས་ནས་སྐྱེ། །\nཤེས་དང་ཤེས་བྱ་ལྷན་ཅིག་ན། །དེ་ནི་ཅི་ལ་དམིགས་ནས་སྐྱེ། །\nའོན་ཏེ་ཤེས་བྱའི་ཕྱིས་ཡོད་ན། །དེ་ཚེ་ཤེས་པ་གང་ལས་སྐྱེ། །\n\nདེ་ལྟར་ཆོས་རྣམས་ཐམས་ཅད་ཀྱི། །སྐྱེ་བ་རྟོགས་པར་འགྱུར་མ་ཡིན། །\n\nགལ་ཏེ་དེ་ལྟར་ཀུན་རྫོབ་མེད། །དེ་ལ་བདེན་གཉིས་ག་ལ་ཡོད། །\nདེ་ཡང་ཀུན་རྫོབ་གཞན་གྱིས་ན། །སེམས་ཅན་མྱ་ངན་ག་ལ་འདའ། །\nའདི་ནི་གཞན་སེམས་རྣམ་རྟོག་སྟེ། །དེ་ནི་རང་གི་ཀུན་རྫོབ་མིན། །\nཕྱིས་དེ་ངེས་ན་དེ་ཡོད་དེ། །མིན་ན་ཀུན་རྫོབ་མེད་པ་ཉིད། །\n\nརྟོག་དང་བརྟག་པར་བྱ་བ་དག །གཉིས་པོ་ཕན་ཚུན་བརྟེན་པ་ཡིན། །\nཇི་ལྟར་གྲགས་པ་ལ་བརྟེན་ནས། །རྣམ་པར་དཔྱད་པ་ཐམས་ཅད་བརྗོད། །\n\nགང་ཚེ་རྣམ་པར་དཔྱད་པ་ཡི། །རྣམ་དཔྱོད་ཀྱིས་ནི་དཔྱོད་བྱེད་ན། །\nདེ་ཚེ་རྣམ་དཔྱོད་དེ་ཡང་ནི། །རྣམ་དཔྱོད་ཕྱིར་ན་ཐུག་པ་མེད། །\nདཔྱད་བྱ་རྣམ་པར་དཔྱད་བྱས་ན། །རྣམ་དཔྱོད་ལ་ནི་རྟེན་ཡོད་མིན། །\nརྟེན་མེད་ཕྱིར་ན་མི་སྐྱེ་སྟེ། །དེ་ཡང་མྱ་ངན་འདས་པར་བརྗོད། །",
                "children": [
                  {
                    "level": "subsubsubsection",
                    "number": "9.2.2.2.1",
                    "title": "ལུས་དྲན་པ་ཉེར་བཞག་བསྒོམ་ཚུལ། (Mindfulness of Body)",
                    "verses_span": "116-127",
                    "verse_text_excerpt": "ལུས་ནི་རྐང་པ་བྱིན་པ་མིན། །བརླ་དང་རྐེད་པའང་ལུས་མ་ཡིན། །\nལྟོ་དང་རྒྱབ་ཀྱང་ལུས་མིན་ཏེ། །བྲང་དང་དཔུང་པའང་ལུས་མ་ཡིན། །\nརྩིབ་ལོགས་ལག་པའང་ལུས་མིན་ཏེ། །མཆན་ཁུང་ཕྲག་པའང་ལུས་མ་ཡིན། །\nནང་ཁྲོལ་རྣམས་ཀྱང་དེ་མིན་ལ། །མགོ་དང་མགྲིན་པའང་ལུས་མིན་ན། །\nའདི་ལ་ལུས་ནི་གང་ཞིག་ཡིན། །གལ་ཏེ་ལུས་འདི་ཐམས་ཅད་ལ། །\nཕྱོགས་རེ་ཡིས་ནི་གནས་གྱུར་ན། །ཆ་རྣམས་ཆ་ལ་གནས་གྱུར་མོད། །\nདེ་རང་ཉིད་ནི་གང་ལ་གནས། །གལ་ཏེ་བདག་ཉིད་ཀུན་གྱི་ལུས། །\nལག་སོགས་རྣམས་ལ་གནས་ན་ནི། །ལག་སོགས་དེ་དག་ཇི་སྙེད་པ། །\nདེ་སྙེད་ཀྱི་ནི་ལུས་སུ་འགྱུར། །ཕྱི་དང་ནང་ན་ལུས་མེད་ན། །\nཇི་ལྟར་ལག་སོགས་ལ་ལུས་ཡོད། །ལག་སོགས་རྣམས་ལས་གཞན་མེད་ན། །\nདེ་ནི་ཇི་ལྟར་ཡོད་པ་ཡིན། །དེས་ན་ལུས་མེད་ལག་སོགས་ལ། །\nརྨོངས་པ་ཡིས་ནི་ལུས་བློར་འགྱུར། །དབྱིབས་སུ་བཀོད་པའི་ཁྱད་པར་གྱིས། །\nཐོ་ཡོར་ལ་ནི་མི་བློ་བཞིན། །ཇི་སྲིད་རྐྱེན་ཚོགས་དེ་སྲིད་དུ། །\nལུས་ནི་སྐྱེས་བུ་ལྟར་སྣང་བ། །དེ་བཞིན་ཇི་སྲིད་ལག་སོགས་ལ། །\nདེ་ཡོད་དེ་སྲིད་དེར་ལུས་སྣང་། །\n\nདེ་བཞིན་སོར་མོའི་ཚོགས་ཡིན་ཕྱིར། །ལག་པའང་གང་ཞིག་ཡིན་པར་འགྱུར། །\nདེ་ཡང་ཚིགས་ཀྱི་ཚོགས་ཡིན་ཕྱིར། །ཚིགས་ཀྱང་རང་གི་ཆ་ཕྱེ་བས། །\nཆ་ཡང་རྡུལ་དུ་ཕྱེ་བས་ཏེ། །རྡུལ་དེའང་ཕྱོགས་ཆའི་དབྱེ་བ་ཡིས། །\nཕྱོགས་དབྱེའང་ཆ་ཤས་དང་བྲལ་ཕྱིར། །མཁའ་བཞིན་དེས་ན་རྡུལ་ཡང་མེད། །\n\nདེ་ལྟར་རྨི་ལམ་ལྟ་བུ་ཡི། །གཟུགས་ལ་དཔྱོད་ལྡན་སུ་ཞིག་ཆགས། །\nགང་ཚེ་དེ་ལྟར་ལུས་མེད་པ། །དེ་ཚེ་སྐྱེས་གང་བུད་མེད་གང་། །",
                    "children": [
                      {
                        "level": "paragraph",
                        "number": "9.2.2.2.1.1",
                        "title": "ལུས་སྤྱིར་བརྟགས་པ། (General Analysis of the Body)",
                        "verses_span": "116-123",
                        "verse_text_excerpt": "ལུས་ནི་རྐང་པ་བྱིན་པ་མིན། །བརླ་དང་རྐེད་པའང་ལུས་མ་ཡིན། །\nལྟོ་དང་རྒྱབ་ཀྱང་ལུས་མིན་ཏེ། །བྲང་དང་དཔུང་པའང་ལུས་མ་ཡིན། །\nརྩིབ་ལོགས་ལག་པའང་ལུས་མིན་ཏེ། །མཆན་ཁུང་ཕྲག་པའང་ལུས་མ་ཡིན། །\nནང་ཁྲོལ་རྣམས་ཀྱང་དེ་མིན་ལ། །མགོ་དང་མགྲིན་པའང་ལུས་མིན་ན། །\nའདི་ལ་ལུས་ནི་གང་ཞིག་ཡིན། །གལ་ཏེ་ལུས་འདི་ཐམས་ཅད་ལ། །\nཕྱོགས་རེ་ཡིས་ནི་གནས་གྱུར་ན། །ཆ་རྣམས་ཆ་ལ་གནས་གྱུར་མོད། །\nདེ་རང་ཉིད་ནི་གང་ལ་གནས། །གལ་ཏེ་བདག་ཉིད་ཀུན་གྱི་ལུས། །\nལག་སོགས་རྣམས་ལ་གནས་ན་ནི། །ལག་སོགས་དེ་དག་ཇི་སྙེད་པ། །\nདེ་སྙེད་ཀྱི་ནི་ལུས་སུ་འགྱུར། །ཕྱི་དང་ནང་ན་ལུས་མེད་ན། །\nཇི་ལྟར་ལག་སོགས་ལ་ལུས་ཡོད། །ལག་སོགས་རྣམས་ལས་གཞན་མེད་ན། །\nདེ་ནི་ཇི་ལྟར་ཡོད་པ་ཡིན། །དེས་ན་ལུས་མེད་ལག་སོགས་ལ། །\nརྨོངས་པ་ཡིས་ནི་ལུས་བློར་འགྱུར། །དབྱིབས་སུ་བཀོད་པའི་ཁྱད་པར་གྱིས། །\nཐོ་ཡོར་ལ་ནི་མི་བློ་བཞིན། །ཇི་སྲིད་རྐྱེན་ཚོགས་དེ་སྲིད་དུ། །\nལུས་ནི་སྐྱེས་བུ་ལྟར་སྣང་བ། །དེ་བཞིན་ཇི་སྲིད་ལག་སོགས་ལ། །\nདེ་ཡོད་དེ་སྲིད་དེར་ལུས་སྣང་། །",
                        "children": []
                      },
                      {
                        "level": "paragraph",
                        "number": "9.2.2.2.1.2",
                        "title": "ཡན་ལག་བྱེ་བྲག་ཏུ་བརྟགས་པ། (Specific Analysis of the Limbs)",
                        "verses_span": "124-126",
                        "verse_text_excerpt": "དེ་བཞིན་སོར་མོའི་ཚོགས་ཡིན་ཕྱིར། །ལག་པའང་གང་ཞིག་ཡིན་པར་འགྱུར། །\nདེ་ཡང་ཚིགས་ཀྱི་ཚོགས་ཡིན་ཕྱིར། །ཚིགས་ཀྱང་རང་གི་ཆ་ཕྱེ་བས། །\nཆ་ཡང་རྡུལ་དུ་ཕྱེ་བས་ཏེ། །རྡུལ་དེའང་ཕྱོགས་ཆའི་དབྱེ་བ་ཡིས། །\nཕྱོགས་དབྱེའང་ཆ་ཤས་དང་བྲལ་ཕྱིར། །མཁའ་བཞིན་དེས་ན་རྡུལ་ཡང་མེད། །",
                        "children": []
                      },
                      {
                        "level": "paragraph",
                        "number": "9.2.2.2.1.3",
                        "title": "དེས་ན་ལུས་ལ་ཆགས་པ་སྤོང་དགོས་པར་བསྟན་པ། (Showing the Need to Abandon Attachment to the Body)",
                        "verses_span": "127-127",
                        "verse_text_excerpt": "དེ་ལྟར་རྨི་ལམ་ལྟ་བུ་ཡི། །གཟུགས་ལ་དཔྱོད་ལྡན་སུ་ཞིག་ཆགས། །\nགང་ཚེ་དེ་ལྟར་ལུས་མེད་པ། །དེ་ཚེ་སྐྱེས་གང་བུད་མེད་གང་། །",
                        "children": []
                      }
                    ]
                  },
                  {
                    "level": "subsubsubsection",
                    "number": "9.2.2.2.2",
                    "title": "ཚོར་བ་དྲན་པ་ཉེར་བཞག་བསྒོམ་ཚུལ། (Mindfulness of Feelings)",
                    "verses_span": "128-143",
                    "verse_text_excerpt": "སྡུག་བསྔལ་དེ་ཉིད་དུ་ཡོད་ན། །ཅི་སྟེ་རབ་དགའ་ལ་མི་གནོད། །\nབདེ་ན་མྱ་ངན་གདུང་སོགས་ལ། །ཞིམ་སོགས་ཅི་སྟེ་དགའ་མི་བྱེད། །\nསྟོབས་དང་ལྡན་པས་ཟིལ་མནན་ཕྱིར། །གལ་ཏེ་དེ་མྱོང་མ་ཡིན་ན། །\nགང་ཞིག་ཉམས་མྱོང་བདག་ཉིད་མིན། །དེ་ནི་ཚོར་བ་ཇི་ལྟར་ཡིན། །\nསྡུག་བསྔལ་ཕྲ་མོ་ཉིད་དུ་ཡོད། །འདི་ཡི་རགས་པ་བསལ་མིན་ནམ། །\nདེ་ནི་དེ་ལས་གཞན་དགའ་ཙམ། །ཞེ་ན་ཕྲ་ཉིད་དེ་ཡང་དེའི། །\nགལ་ཏེ་འགལ་རྐྱེན་སྐྱེས་པས་ན། །སྡུག་བསྔལ་སྐྱེས་པ་མིན་ན་ནི། །\nཚོར་བར་རྟོག་པ་མངོན་ཞེན་ཉིད། །ཡིན་ཞེས་བྱ་བར་གྲུབ་མིན་ནམ། །\nདེ་ཉིད་ཕྱིར་ན་འདི་ཡི་ནི། །གཉེན་པོ་རྣམ་དཔྱོད་འདི་བསྒོམ་སྟེ། །\nརྣམ་བརྟགས་ཞིང་ལས་བྱུང་བ་ཡི། །བསམ་གཏན་རྣལ་འབྱོར་པ་ཡི་ཟས། །\n\nགལ་ཏེ་དབང་དོན་བར་བཅས་ན། །དེ་དག་གང་དུ་ཕྲད་པར་འགྱུར། །\nབར་མེད་ན་ཡང་གཅིག་ཉིད་དེ། །གང་ཞིག་གང་དང་ཕྲད་པར་འགྱུར། །\nརྡུལ་ཕྲན་རྡུལ་ཕྲན་ལ་འཇུག་མེད། །དེ་ནི་སྐབས་མེད་མཉམ་པ་ཡིན། །\nམ་ཞུགས་པ་ལ་འདྲེས་མེད་ཅིང་། །མ་འདྲེས་པ་ལ་ཕྲད་པ་མེད། །\nཆ་མེད་པ་ལའང་ཕྲད་པ་ཞེས། །བྱ་བ་ཇི་ལྟར་འཐད་པར་འགྱུར། །\nཕྲད་པ་དང་ནི་ཆ་མེད་པར། །གལ་ཏེ་མཐོང་ན་བསྟན་པར་གྱིས། །\nརྣམ་ཤེས་ལུས་མེད་པ་ལ་ནི། །ཕྲད་པ་འཐད་པ་མ་ཡིན་ཉིད། །\nཚོགས་པའང་དངོས་པོ་མེད་ཕྱིར་ཏེ། །སྔར་ནི་ཇི་ལྟར་རྣམ་དཔྱད་བཞིན། །\n\nདེ་ལྟར་རེག་པ་ཡོད་མིན་ན། །ཚོར་བ་གང་ལས་འབྱུང་བར་འགྱུར། །\nངལ་འདི་ཅི་ཡི་དོན་དུ་ཡིན། །གང་གིས་གང་ལ་གནོད་པར་འགྱུར། །\n\nགང་ཚེ་ཚོར་པོ་འགའ་མེད་ཅིང་། །ཚོར་བའང་ཡོད་པ་མ་ཡིན་པ། །\nདེ་ཚེ་གནས་སྐབས་འདི་མཐོང་ནས། །སྲེད་པ་ཅི་ཕྱིར་ལྡོག་མི་འགྱུར། །\nམཐོང་བ་འམ་ནི་རེག་པ་ཡང་། །རྨི་ལམ་སྒྱུ་འདྲའི་བདག་ཉིད་ཀྱིས། །\nསེམས་དང་ལྷན་ཅིག་སྐྱེས་པའི་ཕྱིར། །ཚོར་བ་དེ་ཡིས་མཐོང་མ་ཡིན། །\nསྔར་དང་ཕྱི་མར་སྐྱེས་པས་ཀྱང་། །དྲན་པར་འགྱུར་གྱི་མྱོང་མ་ཡིན། །\nརང་གིས་བདག་ཉིད་མྱོང་མིན་ལ། །གཞན་དག་གིས་ཀྱང་མྱོང་མ་ཡིན། །\n༔ཚོར་པོ་འགའ་ཡང་ཡོད་མིན་ཏེ། །དེས་ན་ཚོར་བ་དེ་ཉིད་མིན། །\nདེ་ལྟར་བདག་མེད་ཚོགས་འདི་ལ། །འདི་ཡིས་ཅི་སྟེ་གནོད་པར་བྱ། །",
                    "children": [
                      {
                        "level": "paragraph",
                        "number": "9.2.2.2.2.1",
                        "title": "ཚོར་བའི་ངོ་བོ་ལ་བརྟགས་པ། (Analysis of the Nature of Feeling)",
                        "verses_span": "128-133",
                        "verse_text_excerpt": "སྡུག་བསྔལ་དེ་ཉིད་དུ་ཡོད་ན། །ཅི་སྟེ་རབ་དགའ་ལ་མི་གནོད། །\nབདེ་ན་མྱ་ངན་གདུང་སོགས་ལ། །ཞིམ་སོགས་ཅི་སྟེ་དགའ་མི་བྱེད། །\nསྟོབས་དང་ལྡན་པས་ཟིལ་མནན་ཕྱིར། །གལ་ཏེ་དེ་མྱོང་མ་ཡིན་ན། །\nགང་ཞིག་ཉམས་མྱོང་བདག་ཉིད་མིན། །དེ་ནི་ཚོར་བ་ཇི་ལྟར་ཡིན། །\nསྡུག་བསྔལ་ཕྲ་མོ་ཉིད་དུ་ཡོད། །འདི་ཡི་རགས་པ་བསལ་མིན་ནམ། །\nདེ་ནི་དེ་ལས་གཞན་དགའ་ཙམ། །ཞེ་ན་ཕྲ་ཉིད་དེ་ཡང་དེའི། །\nགལ་ཏེ་འགལ་རྐྱེན་སྐྱེས་པས་ན། །སྡུག་བསྔལ་སྐྱེས་པ་མིན་ན་ནི། །\nཚོར་བར་རྟོག་པ་མངོན་ཞེན་ཉིད། །ཡིན་ཞེས་བྱ་བར་གྲུབ་མིན་ནམ། །\nདེ་ཉིད་ཕྱིར་ན་འདི་ཡི་ནི། །གཉེན་པོ་རྣམ་དཔྱོད་འདི་བསྒོམ་སྟེ། །\nརྣམ་བརྟགས་ཞིང་ལས་བྱུང་བ་ཡི། །བསམ་གཏན་རྣལ་འབྱོར་པ་ཡི་ཟས། །",
                        "children": []
                      },
                      {
                        "level": "paragraph",
                        "number": "9.2.2.2.2.2",
                        "title": "ཚོར་བའི་རྒྱུ་ལ་བརྟགས་པ། (Analysis of the Cause of Feeling)",
                        "verses_span": "134-138",
                        "verse_text_excerpt": "གལ་ཏེ་དབང་དོན་བར་བཅས་ན། །དེ་དག་གང་དུ་ཕྲད་པར་འགྱུར། །\nབར་མེད་ན་ཡང་གཅིག་ཉིད་དེ། །གང་ཞིག་གང་དང་ཕྲད་པར་འགྱུར། །\nརྡུལ་ཕྲན་རྡུལ་ཕྲན་ལ་འཇུག་མེད། །དེ་ནི་སྐབས་མེད་མཉམ་པ་ཡིན། །\nམ་ཞུགས་པ་ལ་འདྲེས་མེད་ཅིང་། །མ་འདྲེས་པ་ལ་ཕྲད་པ་མེད། །\nཆ་མེད་པ་ལའང་ཕྲད་པ་ཞེས། །བྱ་བ་ཇི་ལྟར་འཐད་པར་འགྱུར། །\nཕྲད་པ་དང་ནི་ཆ་མེད་པར། །གལ་ཏེ་མཐོང་ན་བསྟན་པར་གྱིས། །\nརྣམ་ཤེས་ལུས་མེད་པ་ལ་ནི། །ཕྲད་པ་འཐད་པ་མ་ཡིན་ཉིད། །\nཚོགས་པའང་དངོས་པོ་མེད་ཕྱིར་ཏེ། །སྔར་ནི་ཇི་ལྟར་རྣམ་དཔྱད་བཞིན། །",
                        "children": []
                      },
                      {
                        "level": "paragraph",
                        "number": "9.2.2.2.2.3",
                        "title": "ཚོར་བའི་འབྲས་བུ་ལ་བརྟགས་པ། (Analysis of the Result of Feeling)",
                        "verses_span": "139-139",
                        "verse_text_excerpt": "དེ་ལྟར་རེག་པ་ཡོད་མིན་ན། །ཚོར་བ་གང་ལས་འབྱུང་བར་འགྱུར། །\nངལ་འདི་ཅི་ཡི་དོན་དུ་ཡིན། །གང་གིས་གང་ལ་གནོད་པར་འགྱུར། །",
                        "children": []
                      },
                      {
                        "level": "paragraph",
                        "number": "9.2.2.2.2.4",
                        "title": "ཚོར་བ་པོ་ལ་བརྟག་པ། (Analysis of the Experiencer of Feeling)",
                        "verses_span": "140-143",
                        "verse_text_excerpt": "གང་ཚེ་ཚོར་པོ་འགའ་མེད་ཅིང་། །ཚོར་བའང་ཡོད་པ་མ་ཡིན་པ། །\nདེ་ཚེ་གནས་སྐབས་འདི་མཐོང་ནས། །སྲེད་པ་ཅི་ཕྱིར་ལྡོག་མི་འགྱུར། །\nམཐོང་བ་འམ་ནི་རེག་པ་ཡང་། །རྨི་ལམ་སྒྱུ་འདྲའི་བདག་ཉིད་ཀྱིས། །\nསེམས་དང་ལྷན་ཅིག་སྐྱེས་པའི་ཕྱིར། །ཚོར་བ་དེ་ཡིས་མཐོང་མ་ཡིན། །\nསྔར་དང་ཕྱི་མར་སྐྱེས་པས་ཀྱང་། །དྲན་པར་འགྱུར་གྱི་མྱོང་མ་ཡིན། །\nརང་གིས་བདག་ཉིད་མྱོང་མིན་ལ། །གཞན་དག་གིས་ཀྱང་མྱོང་མ་ཡིན། །\n༔ཚོར་པོ་འགའ་ཡང་ཡོད་མིན་ཏེ། །དེས་ན་ཚོར་བ་དེ་ཉིད་མིན། །\nདེ་ལྟར་བདག་མེད་ཚོགས་འདི་ལ། །འདི་ཡིས་ཅི་སྟེ་གནོད་པར་བྱ། །",
                        "children": []
                      }
                    ]
                  },
                  {
                    "level": "subsubsubsection",
                    "number": "9.2.2.2.3",
                    "title": "སེམས་དྲན་པ་ཉེར་བཞག་བསྒོམ་ཚུལ། (Mindfulness of Mind)",
                    "verses_span": "144-147",
                    "verse_text_excerpt": "ཡིད་ནི་དབང་རྣམས་ལ་མི་གནས། །གཟུགས་སོགས་ལ་མིན་བར་ནའང་མིན། །\nནང་ཡང་སེམས་མིན་ཕྱི་མིན་ཞིང་། །གཞན་དུ་ཡང་ནི་རྙེད་མ་ཡིན། །\nགང་ཞིག་ལུས་མིན་གཞན་དུ་མིན། །འདྲེས་མིན་ལོགས་སུའང་འགར་མེད་པ། །\nདེ་ནི་ཅུང་ཟད་མིན་དེའི་ཕྱིར། །སེམས་ཅན་རང་བཞིན་མྱ་ངན་འདས། །\n\nཤེས་བྱ་ལས་སྔར་ཤེས་ཡོད་ན། །དེ་ནི་ཅི་ལ་དམིགས་ནས་སྐྱེ། །\nཤེས་དང་ཤེས་བྱ་ལྷན་ཅིག་ན། །དེ་ནི་ཅི་ལ་དམིགས་ནས་སྐྱེ། །\nའོན་ཏེ་ཤེས་བྱའི་ཕྱིས་ཡོད་ན། །དེ་ཚེ་ཤེས་པ་གང་ལས་སྐྱེ། །",
                    "children": [
                      {
                        "level": "paragraph",
                        "number": "9.2.2.2.3.1",
                        "title": "སེམས་རང་བཞིན་མེད་པར་བསྟན་པ། (Showing the Mind Lacks Inherent Existence)",
                        "verses_span": "144-145",
                        "verse_text_excerpt": "ཡིད་ནི་དབང་རྣམས་ལ་མི་གནས། །གཟུགས་སོགས་ལ་མིན་བར་ནའང་མིན། །\nནང་ཡང་སེམས་མིན་ཕྱི་མིན་ཞིང་། །གཞན་དུ་ཡང་ནི་རྙེད་མ་ཡིན། །\nགང་ཞིག་ལུས་མིན་གཞན་དུ་མིན། །འདྲེས་མིན་ལོགས་སུའང་འགར་མེད་པ། །\nདེ་ནི་ཅུང་ཟད་མིན་དེའི་ཕྱིར། །སེམས་ཅན་རང་བཞིན་མྱ་ངན་འདས། །",
                        "children": []
                      },
                      {
                        "level": "paragraph",
                        "number": "9.2.2.2.3.2",
                        "title": "སེམས་སྐྱེ་བ་མེད་པར་བསྟན་པ། (Showing the Mind is Without Arising)",
                        "verses_span": "146-147",
                        "verse_text_excerpt": "ཤེས་བྱ་ལས་སྔར་ཤེས་ཡོད་ན། །དེ་ནི་ཅི་ལ་དམིགས་ནས་སྐྱེ། །\nཤེས་དང་ཤེས་བྱ་ལྷན་ཅིག་ན། །དེ་ནི་ཅི་ལ་དམིགས་ནས་སྐྱེ། །\nའོན་ཏེ་ཤེས་བྱའི་ཕྱིས་ཡོད་ན། །དེ་ཚེ་ཤེས་པ་གང་ལས་སྐྱེ། །",
                        "children": []
                      }
                    ]
                  },
                  {
                    "level": "subsubsubsection",
                    "number": "9.2.2.2.4",
                    "title": "ཆོས་དྲན་པ་ཉེར་བཞག་བསྒོམ་ཚུལ། (Mindfulness of Phenomena)",
                    "verses_span": "148-155",
                    "verse_text_excerpt": "དེ་ལྟར་ཆོས་རྣམས་ཐམས་ཅད་ཀྱི། །སྐྱེ་བ་རྟོགས་པར་འགྱུར་མ་ཡིན། །\n\nགལ་ཏེ་དེ་ལྟར་ཀུན་རྫོབ་མེད། །དེ་ལ་བདེན་གཉིས་ག་ལ་ཡོད། །\nདེ་ཡང་ཀུན་རྫོབ་གཞན་གྱིས་ན། །སེམས་ཅན་མྱ་ངན་ག་ལ་འདའ། །\nའདི་ནི་གཞན་སེམས་རྣམ་རྟོག་སྟེ། །དེ་ནི་རང་གི་ཀུན་རྫོབ་མིན། །\nཕྱིས་དེ་ངེས་ན་དེ་ཡོད་དེ། །མིན་ན་ཀུན་རྫོབ་མེད་པ་ཉིད། །\n\nརྟོག་དང་བརྟག་པར་བྱ་བ་དག །གཉིས་པོ་ཕན་ཚུན་བརྟེན་པ་ཡིན། །\nཇི་ལྟར་གྲགས་པ་ལ་བརྟེན་ནས། །རྣམ་པར་དཔྱད་པ་ཐམས་ཅད་བརྗོད། །\n\nགང་ཚེ་རྣམ་པར་དཔྱད་པ་ཡི། །རྣམ་དཔྱོད་ཀྱིས་ནི་དཔྱོད་བྱེད་ན། །\nདེ་ཚེ་རྣམ་དཔྱོད་དེ་ཡང་ནི། །རྣམ་དཔྱོད་ཕྱིར་ན་ཐུག་པ་མེད། །\nདཔྱད་བྱ་རྣམ་པར་དཔྱད་བྱས་ན། །རྣམ་དཔྱོད་ལ་ནི་རྟེན་ཡོད་མིན། །\nརྟེན་མེད་ཕྱིར་ན་མི་སྐྱེ་སྟེ། །དེ་ཡང་མྱ་ངན་འདས་པར་བརྗོད། །",
                    "children": [
                      {
                        "level": "paragraph",
                        "number": "9.2.2.2.4.1",
                        "title": "དངོས། (The Actual [Meditation on Phenomena])",
                        "verses_span": "148-148",
                        "verse_text_excerpt": "དེ་ལྟར་ཆོས་རྣམས་ཐམས་ཅད་ཀྱི། །སྐྱེ་བ་རྟོགས་པར་འགྱུར་མ་ཡིན། །",
                        "children": []
                      },
                      {
                        "level": "paragraph",
                        "number": "9.2.2.2.4.2",
                        "title": "དེ་ལ་རྩོད་པ་སྤོང་བ། (Dispelling Disputes Regarding That)",
                        "verses_span": "149-155",
                        "verse_text_excerpt": "གལ་ཏེ་དེ་ལྟར་ཀུན་རྫོབ་མེད། །དེ་ལ་བདེན་གཉིས་ག་ལ་ཡོད། །\nདེ་ཡང་ཀུན་རྫོབ་གཞན་གྱིས་ན། །སེམས་ཅན་མྱ་ངན་ག་ལ་འདའ། །\nའདི་ནི་གཞན་སེམས་རྣམ་རྟོག་སྟེ། །དེ་ནི་རང་གི་ཀུན་རྫོབ་མིན། །\nཕྱིས་དེ་ངེས་ན་དེ་ཡོད་དེ། །མིན་ན་ཀུན་རྫོབ་མེད་པ་ཉིད། །\n\nརྟོག་དང་བརྟག་པར་བྱ་བ་དག །གཉིས་པོ་ཕན་ཚུན་བརྟེན་པ་ཡིན། །\nཇི་ལྟར་གྲགས་པ་ལ་བརྟེན་ནས། །རྣམ་པར་དཔྱད་པ་ཐམས་ཅད་བརྗོད། །\n\nགང་ཚེ་རྣམ་པར་དཔྱད་པ་ཡི། །རྣམ་དཔྱོད་ཀྱིས་ནི་དཔྱོད་བྱེད་ན། །\nདེ་ཚེ་རྣམ་དཔྱོད་དེ་ཡང་ནི། །རྣམ་དཔྱོད་ཕྱིར་ན་ཐུག་པ་མེད། །\nདཔྱད་བྱ་རྣམ་པར་དཔྱད་བྱས་ན། །རྣམ་དཔྱོད་ལ་ནི་རྟེན་ཡོད་མིན། །\nརྟེན་མེད་ཕྱིར་ན་མི་སྐྱེ་སྟེ། །དེ་ཡང་མྱ་ངན་འདས་པར་བརྗོད། །",
                        "children": [
                          {
                            "level": "subparagraph",
                            "number": "9.2.2.2.4.2.1",
                            "title": "བདེན་གཉིས་མི་འཐད་པའི་རྩོད་སྤོང༌། (Dispelling the Dispute that the Two Truths are Untenable)",
                            "verses_span": "149-152",
                            "verse_text_excerpt": "གལ་ཏེ་དེ་ལྟར་ཀུན་རྫོབ་མེད། །དེ་ལ་བདེན་གཉིས་ག་ལ་ཡོད། །\nདེ་ཡང་ཀུན་རྫོབ་གཞན་གྱིས་ན། །སེམས་ཅན་མྱ་ངན་ག་ལ་འདའ། །\nའདི་ནི་གཞན་སེམས་རྣམ་རྟོག་སྟེ། །དེ་ནི་རང་གི་ཀུན་རྫོབ་མིན། །\nཕྱིས་དེ་ངེས་ན་དེ་ཡོད་དེ། །མིན་ན་ཀུན་རྫོབ་མེད་པ་ཉིད། །",
                            "children": []
                          },
                          {
                            "level": "subparagraph",
                            "number": "9.2.2.2.4.2.2",
                            "title": "གཏན་ཚིགས་མེད་པའི་རྩོད་སྤོང༌། (Dispelling the Dispute that there is no Valid Reasoning)",
                            "verses_span": "153-153",
                            "verse_text_excerpt": "རྟོག་དང་བརྟག་པར་བྱ་བ་དག །གཉིས་པོ་ཕན་ཚུན་བརྟེན་པ་ཡིན། །\nཇི་ལྟར་གྲགས་པ་ལ་བརྟེན་ནས། །རྣམ་པར་དཔྱད་པ་ཐམས་ཅད་བརྗོད། །",
                            "children": []
                          },
                          {
                            "level": "subparagraph",
                            "number": "9.2.2.2.4.2.3",
                            "title": "རྣམ་དཔྱོད་ཐུག་མེད་དུ་འགྱུར་བའི་རྩོད་སྤོང༌། (Dispelling the Dispute that Analysis Becomes Infinite)",
                            "verses_span": "154-155",
                            "verse_text_excerpt": "གང་ཚེ་རྣམ་པར་དཔྱད་པ་ཡི། །རྣམ་དཔྱོད་ཀྱིས་ནི་དཔྱོད་བྱེད་ན། །\nདེ་ཚེ་རྣམ་དཔྱོད་དེ་ཡང་ནི། །རྣམ་དཔྱོད་ཕྱིར་ན་ཐུག་པ་མེད། །\nདཔྱད་བྱ་རྣམ་པར་དཔྱད་བྱས་ན། །རྣམ་དཔྱོད་ལ་ནི་རྟེན་ཡོད་མིན། །\nརྟེན་མེད་ཕྱིར་ན་མི་སྐྱེ་སྟེ། །དེ་ཡང་མྱ་ངན་འདས་པར་བརྗོད། །",
                            "children": []
                          }
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "level": "subsection",
            "number": "9.2.3",
            "title": "སྟོང་ཉིད་རྟོགས་པའི་བྱེད་ལས། (The Function of Realizing Emptiness)",
            "verses_span": "156-168",
            "verse_text_excerpt": "དེ་ལྟར་སྟོང་པའི་དངོས་རྣམས་ལ། །ཐོབ་པ་ཅི་ཡོད་ཤོར་ཅི་ཡོད། །\nགང་གིས་རིམ་གྲོ་བྱས་པའམ། །ཡོངས་སུ་བརྙས་པའང་ཅི་ཞིག་ཡོད། །\nབདེ་བའང་སྡུག་བསྔལ་གང་ལས་ཡིན། །མི་དགར་ཅི་ཡོད་དགར་ཅི་ཡོད། །\nདེ་ཉིད་དུ་ནི་བཙལ་བྱས་ན། །གང་ཞིག་སྲེད་ཅིང་གང་ལ་སྲེད། །\nདཔྱད་ན་གསོན་པོའི་འཇིག་རྟེན་འདི། །གང་ཞིག་འདིར་ནི་འཆི་འགྱུར་ཏེ། །\nའབྱུང་འགྱུར་གང་ཡིན་བྱུང་གྱུར་གང་། །གཉེན་དང་བཤེས་ཀྱང་གང་ཞིག་ཡིན། །\nཐམས་ཅད་ནམ་མཁའ་འདྲ་བར་ནི། །བདག་འདྲས་ཡོངས་སུ་གཟུང་བར་གྱིས། །\nབདག་ཉིད་བདེ་བར་འདོད་རྣམས་ནི། །འཐབ་དང་སྤྲོ་བའི་རྒྱུ་དག་གིས། །\nརབ་ཏུ་འཁྲུག་དང་དགའ་བར་བྱེད། །མྱ་ངན་འབད་རྩོལ་རྩོད་པ་དང་། །\nཕན་ཚུན་གཅོད་དང་འབིགས་པ་དང་། །སྡིག་དག་གིས་ནི་ཚེགས་ཆེན་འཚོ། །\n\nབདེ་འགྲོར་ཡང་དང་ཡང་འོངས་ཏེ། །བདེ་བ་མང་པོ་སྤྱད་སྤྱད་ནས། །\nཤི་ནས་ངན་སོང་སྡུག་བསྔལ་ནི། །ཡུན་རིང་མི་བཟད་རྣམས་སུ་ལྟུང་། །\nསྲིད་པ་ན་ནི་གཡང་ས་མང་། །དེར་ནི་དེ་ཉིད་མིན་འདི་འདྲ། །\nདེར་ཡང་ཕན་ཚུན་འགལ་བས་ན། །སྲིད་ན་དེ་ཉིད་འདི་འདྲ་མེད། །\nདེ་ཡང་དཔེ་མེད་མི་བཟད་པའི། །སྡུག་བསྔལ་རྒྱ་མཚོ་མཐའ་ལས་འདས། །\nདེར་ནི་དེ་ལྟར་སྟོབས་ཆུང་ཞིང་། །དེར་ནི་ཚེ་ཡང་ཐུང་བ་ཉིད། །\nདེར་ཡང་གསོན་དང་ནད་མེད་ཀྱི། །བྱེད་དང་བཀྲེས་ནའི་ངལ་བ་དང་། །\nགཉིད་དང་འཚེ་དང་དེ་བཞིན་དུ། །བྱིས་དང་འགྲོགས་པ་དོན་མེད་ཀྱིས། །\nཚེ་ནི་དོན་མེད་མྱུར་འདའ་ཡི། །རྣམ་དཔྱོད་ཤིན་ཏུ་རྙེད་པར་དཀའ། །\nདེར་ཡང་རྣམ་གཡེང་གོམས་པ་ནི། །བཟློག་པའི་ཐབས་ནི་ག་ལ་ཡོད། །\nདེར་ཡང་ངན་སོང་ཆེན་པོར་ནི། །ལྟུང་ཕྱིར་བདུད་ནི་བརྩོན་པར་བྱེད། །\nདེར་ནི་ལོག་པའི་ལམ་མང་ཞིང་། །ཐེ་ཚོམ་ལས་ཀྱང་བརྒལ་དཀའ་སྟེ། །\nསླར་ཡང་དལ་བ་རྙེད་དཀའ་ཞིང་། །སངས་རྒྱས་འབྱུང་རྙེད་ཤིན་ཏུ་དཀའ། །\nཉོན་མོངས་ཆུ་བོ་སྤང་དཀའ་སྟེ། །ཨེ་མ་སྡུག་བསྔལ་བརྒྱུད་པར་འགྱུར། །\nདེ་ལྟར་ཤིན་ཏུ་སྡུག་བསྔལ་ཡང་། །རང་སྡུག་མི་མཐོང་གང་ཡིན་པ། །\nསྡུག་བསྔལ་ཆུ་བོར་གནས་འདི་དག །ཀྱི་ཧུད་མྱ་ངན་བྱ་བར་འོས། །\nདཔེར་ན་འགའ་ཞིག་ཡང་ཡང་ཁྲུས། །བྱས་ཏེ་ཡང་ཡང་མེར་འཇུག་པ། །\nདེ་ལྟར་ཤིན་ཏུ་སྡུག་བསྔལ་བར། །གནས་ཀྱང་བདག་ཉིད་བདེར་རློམ་བཞིན། །\nདེ་ལྟར་རྒ་དང་འཆི་མེད་པ། །བཞིན་དུ་སྤྱོད་པས་གནས་རྣམས་ལ། །\nདང་པོ་ཉིད་དུ་བསད་བྱས་ནས། །ངན་སོང་ལྟུང་བ་མི་བཟད་འོང་། །\nདེ་ལྟར་སྡུག་བསྔལ་མེས་གདུངས་ལ། །བསོད་ནམས་སྤྲིན་ལས་ལེགས་འཁྲུངས་པའི། །\nརང་གི་བདེ་བའི་ཚོགས་ཆར་གྱིས། །ཞི་བྱེད་པར་བདག་ནམ་ཞིག་འགྱུར། །\nནམ་ཞིག་དམིགས་པ་མེད་ཚུལ་དུ། །གུས་པས་བསོད་ནམས་ཚོགས་བསགས་ཏེ། །\nདམིགས་པས་ཕུང་བར་འགྱུར་རྣམས་ལ། །སྟོང་པ་ཉིད་ནི་སྟོན་པར་འགྱུར། །",
            "children": [
              {
                "level": "subsubsection",
                "number": "9.2.3.1",
                "title": "རང་དོན་དུ་ཆོས་བརྒྱད་མགོ་སྙོམས་པ། (Self-benefit: Equanimity Towards the Eight Worldly Dharmas)",
                "verses_span": "156-160",
                "verse_text_excerpt": "དེ་ལྟར་སྟོང་པའི་དངོས་རྣམས་ལ། །ཐོབ་པ་ཅི་ཡོད་ཤོར་ཅི་ཡོད། །\nགང་གིས་རིམ་གྲོ་བྱས་པའམ། །ཡོངས་སུ་བརྙས་པའང་ཅི་ཞིག་ཡོད། །\nབདེ་བའང་སྡུག་བསྔལ་གང་ལས་ཡིན། །མི་དགར་ཅི་ཡོད་དགར་ཅི་ཡོད། །\nདེ་ཉིད་དུ་ནི་བཙལ་བྱས་ན། །གང་ཞིག་སྲེད་ཅིང་གང་ལ་སྲེད། །\nདཔྱད་ན་གསོན་པོའི་འཇིག་རྟེན་འདི། །གང་ཞིག་འདིར་ནི་འཆི་འགྱུར་ཏེ། །\nའབྱུང་འགྱུར་གང་ཡིན་བྱུང་གྱུར་གང་། །གཉེན་དང་བཤེས་ཀྱང་གང་ཞིག་ཡིན། །\nཐམས་ཅད་ནམ་མཁའ་འདྲ་བར་ནི། །བདག་འདྲས་ཡོངས་སུ་གཟུང་བར་གྱིས། །\nབདག་ཉིད་བདེ་བར་འདོད་རྣམས་ནི། །འཐབ་དང་སྤྲོ་བའི་རྒྱུ་དག་གིས། །\nརབ་ཏུ་འཁྲུག་དང་དགའ་བར་བྱེད། །མྱ་ངན་འབད་རྩོལ་རྩོད་པ་དང་། །\nཕན་ཚུན་གཅོད་དང་འབིགས་པ་དང་། །སྡིག་དག་གིས་ནི་ཚེགས་ཆེན་འཚོ། །",
                "children": []
              },
              {
                "level": "subsubsection",
                "number": "9.2.3.2",
                "title": "གཞན་དོན་དུ་བརྩེ་བའི་སྙིང་རྗེ་ཆེན་པོ་རྩོལ་མེད་དུ་འབྱུང་བའོ། (Other-benefit: Great Compassion Arising Effortlessly)",
                "verses_span": "161-168",
                "verse_text_excerpt": "བདེ་འགྲོར་ཡང་དང་ཡང་འོངས་ཏེ། །བདེ་བ་མང་པོ་སྤྱད་སྤྱད་ནས། །\nཤི་ནས་ངན་སོང་སྡུག་བསྔལ་ནི། །ཡུན་རིང་མི་བཟད་རྣམས་སུ་ལྟུང་། །\nསྲིད་པ་ན་ནི་གཡང་ས་མང་། །དེར་ནི་དེ་ཉིད་མིན་འདི་འདྲ། །\nདེར་ཡང་ཕན་ཚུན་འགལ་བས་ན། །སྲིད་ན་དེ་ཉིད་འདི་འདྲ་མེད། །\nདེ་ཡང་དཔེ་མེད་མི་བཟད་པའི། །སྡུག་བསྔལ་རྒྱ་མཚོ་མཐའ་ལས་འདས། །\nདེར་ནི་དེ་ལྟར་སྟོབས་ཆུང་ཞིང་། །དེར་ནི་ཚེ་ཡང་ཐུང་བ་ཉིད། །\nདེར་ཡང་གསོན་དང་ནད་མེད་ཀྱི། །བྱེད་དང་བཀྲེས་ནའི་ངལ་བ་དང་། །\nགཉིད་དང་འཚེ་དང་དེ་བཞིན་དུ། །བྱིས་དང་འགྲོགས་པ་དོན་མེད་ཀྱིས། །\nཚེ་ནི་དོན་མེད་མྱུར་འདའ་ཡི། །རྣམ་དཔྱོད་ཤིན་ཏུ་རྙེད་པར་དཀའ། །\nདེར་ཡང་རྣམ་གཡེང་གོམས་པ་ནི། །བཟློག་པའི་ཐབས་ནི་ག་ལ་ཡོད། །\nདེར་ཡང་ངན་སོང་ཆེན་པོར་ནི། །ལྟུང་ཕྱིར་བདུད་ནི་བརྩོན་པར་བྱེད། །\nདེར་ནི་ལོག་པའི་ལམ་མང་ཞིང་། །ཐེ་ཚོམ་ལས་ཀྱང་བརྒལ་དཀའ་སྟེ། །\nསླར་ཡང་དལ་བ་རྙེད་དཀའ་ཞིང་། །སངས་རྒྱས་འབྱུང་རྙེད་ཤིན་ཏུ་དཀའ། །\nཉོན་མོངས་ཆུ་བོ་སྤང་དཀའ་སྟེ། །ཨེ་མ་སྡུག་བསྔལ་བརྒྱུད་པར་འགྱུར། །\nདེ་ལྟར་ཤིན་ཏུ་སྡུག་བསྔལ་ཡང་། །རང་སྡུག་མི་མཐོང་གང་ཡིན་པ། །\nསྡུག་བསྔལ་ཆུ་བོར་གནས་འདི་དག །ཀྱི་ཧུད་མྱ་ངན་བྱ་བར་འོས། །\nདཔེར་ན་འགའ་ཞིག་ཡང་ཡང་ཁྲུས། །བྱས་ཏེ་ཡང་ཡང་མེར་འཇུག་པ། །\nདེ་ལྟར་ཤིན་ཏུ་སྡུག་བསྔལ་བར། །གནས་ཀྱང་བདག་ཉིད་བདེར་རློམ་བཞིན། །\nདེ་ལྟར་རྒ་དང་འཆི་མེད་པ། །བཞིན་དུ་སྤྱོད་པས་གནས་རྣམས་ལ། །\nདང་པོ་ཉིད་དུ་བསད་བྱས་ནས། །ངན་སོང་ལྟུང་བ་མི་བཟད་འོང་། །\nདེ་ལྟར་སྡུག་བསྔལ་མེས་གདུངས་ལ། །བསོད་ནམས་སྤྲིན་ལས་ལེགས་འཁྲུངས་པའི། །\nརང་གི་བདེ་བའི་ཚོགས་ཆར་གྱིས། །ཞི་བྱེད་པར་བདག་ནམ་ཞིག་འགྱུར། །\nནམ་ཞིག་དམིགས་པ་མེད་ཚུལ་དུ། །གུས་པས་བསོད་ནམས་ཚོགས་བསགས་ཏེ། །\nདམིགས་པས་ཕུང་བར་འགྱུར་རྣམས་ལ། །སྟོང་པ་ཉིད་ནི་སྟོན་པར་འགྱུར། །",
                "children": []
              }
            ]
          }
        ]
      }
    ]
  }
]