[
  {
    "level": "7",
    "title": "བརྩོན་འགྲུས་ཀྱི་ལེའུ།",
    "lines_span": "1-308",
    "children": [
      {
        "level": "7.1",
        "title": "བརྩོན་འགྲུས་རྩོམ་དགོས་པའི་རྒྱུ་མཚན་མདོར་བསྟན་པ།",
        "lines_span": "1-4",
        "line_text_excerpt": "དེ་ལྟར་བཟོད་པས་བརྩོན་འགྲུས་བརྩམ། །\nའདི་ལྟར་བརྩོན་ལ་བྱང་ཆུབ་གནས། །\nརླུང་མེད་གཡོ་བ་མེད་པ་བཞིན། །\nབསོད་ནམས་བརྩོན་འགྲུས་མེད་མི་འབྱུང་། །",
        "children": []
      },
      {
        "level": "7.2",
        "title": "ཇི་ལྟར་བརྩོན་ཚུལ་རྒྱས་པར་བཤད་པ།",
        "lines_span": "5-306",
        "children": [
          {
            "level": "7.2.1",
            "title": "བརྩོན་འགྲུས་ཀྱི་ངོ་བོ་ངོས་བཟུང་བ།",
            "lines_span": "5-5",
            "line_text_excerpt": "བརྩོན་གང་དགེ་ལ་སྤྲོ་བའོ། །",
            "children": []
          },
          {
            "level": "7.2.2",
            "title": "མི་མཐུན་པའི་ཕྱོགས་སྤོང་བ།",
            "lines_span": "6-120",
            "children": [
              {
                "level": "7.2.2.1",
                "title": "ལེ་ལོ་རྒྱུ་འབྲས་དང་བཅས་པ་ངོས་བཟུང་བ།",
                "lines_span": "6-12",
                "children": [
                  {
                    "level": "7.2.2.1.1",
                    "title": "མི་མཐུན་པའི་ཕྱོགས་ཀྱི་ངོས་བཟུང་།",
                    "lines_span": "6-8",
                    "line_text_excerpt": "དེ་ཡི་མི་མཐུན་ཕྱོགས་བཤད་བྱ། །\nལེ་ལོ་ངན་ལ་ཞེན་པ་དང་། །\nསྒྱིད་ལུག་བདག་ཉིད་བརྙས་པའོ། །",
                    "children": []
                  },
                  {
                    "level": "7.2.2.1.2",
                    "title": "ལེ་ལོའི་རྒྱུ།",
                    "lines_span": "9-12",
                    "line_text_excerpt": "སྙོམ་ལས་བདེ་བའི་རོ་མྱང་དང་། །\nགཉིད་ལ་བརྟེན་པའི་སྲེད་པ་ཡིས། །\nའཁོར་བའི་སྡུག་བསྔལ་མི་སྐྱོ་ལས། །\nལེ་ལོ་ཉེ་བར་སྐྱེ་བར་འགྱུར། །",
                    "children": []
                  }
                ]
              },
              {
                "level": "7.2.2.2",
                "title": "དེ་ཇི་ལྟར་སྤོང་ཐབས་ཀྱི་གཉེན་པོ་བཤད་པ།",
                "lines_span": "13-120",
                "children": [
                  {
                    "level": "7.2.2.2.1",
                    "title": "སྙོམ་ལས་འཛིན་པའི་ལེ་ལོའི་གཉེན་པོ་བསྒོམ་ཚུལ།",
                    "lines_span": "13-56",
                    "line_text_excerpt": "ཉོན་མོངས་རྒྱ་པས་བཤོར་ནས་ནི། །\nསྐྱེ་བའི་རྒྱར་ནི་ཆུད་གྱུར་ནས། །\nའཆི་བདག་ཁར་ནི་སོང་གྱུར་པ། །\nཅི་སྟེ་ད་དུང་མི་ཤེས་སམ། །\nརང་སྡེ་རིམ་གྱིས་གསོད་པ་ཡང་། །\nཁྱོད་ཀྱིས་མཐོང་བར་མ་གྱུར་ཏམ། །\nའོན་ཀྱང་གཉིད་ལ་བརྟེན་པ་གང་། །\nགདོལ་པ་དང་ནི་མ་ཧེ་བཞིན། །\nལམ་ནི་ཀུན་ནས་བཀག་ནས་སུ། །\nའཆི་བདག་གིས་ནི་བལྟས་བཞིན་དུ། །\nཇི་ལྟར་ཁྱོད་ནི་ཟ་དགའ་ཞིང་། །\nའདི་ལྟར་གཉིད་ལོག་ཇི་ལྟར་དགའ། །\nམྱུར་བ་ཉིད་དུ་འཆི་འགྱུར་བས། །\nཇི་སྲིད་དུ་ནི་ཚོགས་བསག་བྱ། །\nདེ་ཚེ་ལེ་ལོ་སྤངས་ཀྱང་ནི། །\nདུས་མ་ཡིན་པར་ཅི་ཞིག་བྱ། །\nའདི་ནི་མ་བྱས་བརྩམས་པ་དང་། །\nའདི་ཕྱེད་བྱས་པར་གནས་པ་ལ། །\nགློ་བུར་འཆི་བདག་འོངས་ནས་ནི། །\nཀྱི་ཧུད་བཅོམ་ཞེས་སེམས་པར་འགྱུར། །\nམྱ་ངན་ཤུགས་ཀྱིས་སྐྲངས་པ་ཡི། །\nམིག་དམར་གདོང་ལ་མཆི་མ་འཛག །\nཉེ་དུ་རེ་ཐག་ཆད་པ་དང་། །\nགཤིན་རྗེའི་ཕོ་ཉའི་བཞིན་ལ་བལྟ། །\nརང་སྡིག་དྲན་པས་གདུང་བ་དང་། །\nདམྱལ་བའི་སྒྲ་ནི་ཐོས་པ་ཡིས། །\nསྐྲག་པས་མི་གཙང་ལུས་གོས་ཤིང་། །\nམྱོས་པར་འགྱུར་ཚེ་ཅི་ཞིག་བྱ། །\nཁྱོད་ནི་ཉ་གསོན་འགྲེ་བ་ལྟའི། །\nཚེ་འདིར་འཇིགས་དང་ལྡན་གྱུར་ན། །\nསྡིག་བྱས་དམྱལ་བ་མི་བཟད་པའི། །\nསྡུག་བསྔལ་རྣམས་ནི་སྨོས་ཅི་དགོས། །\nཆུ་ཚན་གྱིས་ནི་རེག་པ་ན། །\nགཞོན་ཤ་ཅན་ལ་རབ་ཚ་བའི། །\nདམྱལ་བ་ཡི་ནི་ལས་བྱས་ནས། །\nཅི་ཕྱིར་འདི་ལྟར་བདེ་བར་གནས། །\nབརྩོན་མེད་འབྲས་བུ་འདོད་པ་དང་། །\nབཟེ་རེ་ཅན་ལ་གནོད་མང་ཞིང་། །\nའཆི་བས་བཟུང་བཞིན་ལྷ་འདྲ་བ། །\nཀྱི་ཧུད་སྡུག་བསྔལ་དག་གིས་བཅོམ། །\nམི་ཡི་གྲུ་ལ་བརྟེན་ནས་སུ། །\nསྡུག་བསྔལ་ཆུ་བོ་ཆེ་ལས་སྒྲོལ། །\nགྲུ་འདི་ཕྱི་ནས་རྙེད་དཀའ་བས། །\nརྨོངས་པ་དུས་སུ་གཉིད་མ་ལོག །",
                    "children": []
                  },
                  {
                    "level": "7.2.2.2.2",
                    "title": "བྱ་བ་ངན་ཞེན་གྱི་ལེ་ལོའི་གཉེན་པོ་བསྒོམ་ཚུལ།",
                    "lines_span": "57-64",
                    "line_text_excerpt": "དགའ་བའི་རྒྱུ་ནི་མཐའ་ཡས་པའི། །\nདམ་ཆོས་དགའ་བའི་མཆོག་སྤངས་ནས། །\nསྡུག་བསྔལ་རྒྱུ་ཡིས་གཡེང་བ་དང་། །\nརྒོད་སོགས་ལ་ཁྱོད་ཅི་ཕྱིར་དགའ། །\nསྒྱིད་ལུག་མེད་དང་དཔུང་ཚོགས་དང་། །\nལྷུར་བླང་བདག་ཉིད་དབང་བྱ་དང་། །\nབདག་དང་གཞན་དུ་མཉམ་པ་དང་། །\nབདག་དང་གཞན་དུ་བརྗེ་བར་གྱིས། །",
                    "children": []
                  },
                  {
                    "level": "7.2.2.2.3",
                    "title": "སྒྱིད་ལུགས་བདག་ཉིད་བརྙས་པའི་ལེ་ལོའི་གཉེན་པོ་བསྒོམ་ཚུལ།",
                    "lines_span": "65-120",
                    "children": [
                      {
                        "level": "7.2.2.2.3.1",
                        "title": "བདག་ཉིད་ལ་མི་བརྙས་པར་སྙིང་སྟོབས་བསྐྱེད་པ།",
                        "lines_span": "65-76",
                        "line_text_excerpt": "བདག་གིས་བྱང་ཆུབ་ག་ལ་ཞེས། །\nསྒྱིད་ལུག་པར་ནི་མི་བྱ་སྟེ། །\nའདི་ལྟར་དེ་བཞིན་གཤེགས་པ་ནི། །\nབདེན་པ་གསུང་བས་བདེན་འདི་གསུངས། །\nསྦྲང་བུ་ཤ་སྦྲང་བུང་བ་དང་། །\nདེ་བཞིན་སྲིན་བུར་གང་གྱུར་པ། །\nདེས་ཀྱང་བརྩོན་པའི་སྟོབས་བསྐྱེད་ན། །\nབྱང་ཆུབ་ཐོབ་དཀའ་བླ་མེད་འཐོབ། །\nབདག་ལྟ་རིགས་ཀྱིས་མིར་སྐྱེས་ལ། །\nཕན་དང་གནོད་པའི་ངོ་ཤེས་པས། །\nབྱང་ཆུབ་སྤྱོད་པ་མ་བཏང་ན། །\nབདག་གིས་བྱང་ཆུབ་ཅིས་མི་འཐོབ། །",
                        "children": []
                      },
                      {
                        "level": "7.2.2.2.3.2",
                        "title": "དཀའ་སྤྱད་ཆུང་ངུས་དོན་ཆེན་སྒྲུབ་པས་འཇིགས་པ་སྤང་བ།",
                        "lines_span": "77-96",
                        "line_text_excerpt": "འོན་ཏེ་རྐང་ལག་ལ་སོགས་པ། །\nབཏང་དགོས་བདག་ནི་འཇིགས་ཤེ་ན། །\nལྕི་དང་ཡང་བ་མ་དཔྱད་པར། །\nརྨོངས་པས་བདག་ནི་འཇིགས་པར་ཟད། །\nབསྐལ་པ་བྱེ་བ་གྲངས་མེད་དུ། །\nལན་གྲངས་དུ་མར་བཅད་པ་དང་། །\nདབུག་དང་བསྲེག་དང་གཤེགས་འགྱུར་གྱི། །\nབྱང་ཆུབ་ཐོབ་པར་མི་འགྱུར་རོ། །\nབདག་གིས་བྱང་ཆུབ་སྒྲུབ་པ་ཡི། །\nསྡུག་བསྔལ་འདི་ནི་ཚོད་ཡོད་དེ། །\nཟུག་རྔུ་ཁོང་བརླག་གནོད་བསལ་ཕྱིར། །\nལུས་རྨ་བཏོད་པའི་སྡུག་བསྔལ་བཞིན། །\nསྨན་པ་ཀུན་ཀྱང་གསོ་དཔྱད་ཀྱིས། །\nམི་བདེ་བ་ཡི་ནད་མེད་བྱེད། །\nདེ་བས་སྡུག་བསྔལ་མང་པོ་དག །\nགཞོམ་ཕྱིར་མི་བདེ་ཆུང་བཟོད་བྱ། །\nགསོ་དཔྱད་ཕལ་པ་འདི་འདྲ་བ། །\nསྨན་པ་མཆོག་གིས་མ་མཛད་དེ། །\nཆོ་ག་ཤིན་ཏུ་འཇམ་པོ་ཡིས། །\nནད་ཆེན་དཔག་མེད་གསོ་བར་མཛད། །",
                        "children": []
                      },
                      {
                        "level": "7.2.2.2.3.3",
                        "title": "གོམས་པས་གཏོང་བ་ལ་དཀའ་བ་མེད་ཚུལ།",
                        "lines_span": "97-104",
                        "line_text_excerpt": "ཚོད་མ་ལ་སོགས་སྦྱིན་པ་ལའང་། །\nའདྲེན་པས་ཐོག་མར་སྦྱོར་བར་མཛད། །\nདེ་ལ་གོམས་ནས་ཕྱི་ནས་ནི། །\nརིམ་གྱིས་རང་གི་ཤ་ཡང་གཏོང་། །\nགང་ཚེ་རང་གི་ལུས་ལ་ནི། །\nཚོད་སོགས་ལྟ་བུའི་བློ་སྐྱེས་པ། །\nདེ་ཚེ་ཤ་ལ་སོགས་གཏོང་བ། །\nདེ་ལ་དཀའ་བ་ཅི་ཞིག་ཡོད། །",
                        "children": []
                      },
                      {
                        "level": "7.2.2.2.3.4",
                        "title": "འཁོར་བར་གནས་ཀྱང་སྐྱོ་བ་མི་དགོས་པའི་ཚུལ།",
                        "lines_span": "105-120",
                        "line_text_excerpt": "སྡིག་པ་སྤང་ཕྱིར་སྡུག་བསྔལ་མེད། །\nམཁས་པའི་ཕྱིར་ན་མི་དགའ་མེད། །\nའདི་ལྟར་ལོག་པར་རྟོག་པ་དང་། །\nསྡིག་པས་སེམས་དང་ལུས་ལ་གནོད། །\nབསོད་ནམས་ཀྱིས་ནི་ལུས་བདེ་ལ། །\nམཁས་པ་ཡིས་ནི་སེམས་བདེ་ན། །\nགཞན་དོན་འཁོར་བར་གནས་ཀྱང་ནི། །\nསྙིང་རྗེ་ཅན་དག་ཅི་སྟེ་སྐྱོ། །\nའདི་ནི་བྱང་ཆུབ་སེམས་སྟོབས་ཀྱིས། །\nསྔོན་གྱི་སྡིག་པ་ཟད་བྱེད་ཅིང་། །\nབསོད་ནམས་རྒྱ་མཚོ་སྡུད་བྱེད་ཕྱིར། །\nཉན་ཐོས་རྣམས་པས་མཆོག་ཏུ་བཤད། །\nདེ་བས་སྐྱོ་ངལ་ཀུན་སེལ་བའི། །\nབྱང་ཆུབ་སེམས་ཀྱི་རྟ་ཞོན་ནས། །\nབདེ་ནས་བདེ་བར་འགྲོ་བ་ལ། །\nསེམས་ཤེས་སུ་ཞིག་སྒྱིད་ལུག་འགྱུར། །",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "level": "7.2.3",
            "title": "མཐུན་ཕྱོགས་བསྒྲུབ་པ།",
            "lines_span": "121-306",
            "children": [
              {
                "level": "7.2.3.1",
                "title": "མདོར་བསྟན་པ།",
                "lines_span": "121-128",
                "children": [
                  {
                    "level": "7.2.3.1.1",
                    "title": "དཔུང་བཞིའི་ངོ་བོ།",
                    "lines_span": "121-124",
                    "line_text_excerpt": "སེམས་ཅན་དོན་གྲུབ་བྱ་ཕྱིར་དཔུང་། །\nམོས་བརྟན་དགའ་དང་དོར་བ་ཡིན། །\nམོས་པ་སྡུག་བསྔལ་འཇིགས་པ་དང་། །\nདེ་ཡི་ཕན་ཡོན་བསམ་པས་བསྐྱེད། །",
                    "children": []
                  },
                  {
                    "level": "7.2.3.1.2",
                    "title": "མཐུན་ཕྱོགས་སྒྲུབ་པའི་མདོར་བསྟན།",
                    "lines_span": "125-128",
                    "line_text_excerpt": "དེ་ལྟར་མི་མཐུན་ཕྱོགས་སྤངས་ཏེ། །\nམོས་དང་ང་རྒྱལ་དགའ་དང་དོར། །\nལྷུར་ལེན་དབང་བསྒྱུར་སྟོབས་ཀྱིས་ནི། །\nབརྩོན་འགྲུས་སྤེལ་ཕྱིར་འབད་པར་བྱ། །",
                    "children": []
                  }
                ]
              },
              {
                "level": "7.2.3.2",
                "title": "རྒྱས་པར་བཤད་པ།",
                "lines_span": "129-306",
                "children": [
                  {
                    "level": "7.2.3.2.1",
                    "title": "དཔུང་བཞི་བསགས་པ།",
                    "lines_span": "129-270",
                    "children": [
                      {
                        "level": "7.2.3.2.1.1",
                        "title": "མོས་པའི་དཔུང་།",
                        "lines_span": "129-182",
                        "line_text_excerpt": "བདག་དང་གཞན་གྱི་ཉེས་པ་ནི། །\nདཔག་མེད་བདག་གིས་གཞོམ་བྱ་སྟེ། །\nགང་དུ་ཉེས་པ་རེ་རེ་ལའང་། །\nབསྐལ་པ་རྒྱ་མཚོ་ཟད་འགྱུར་བ། །\nཉེས་ཟད་རྩོམ་པ་དེ་ཡི་ནི། །\nཆ་ཡང་བདག་ལ་མ་མཐོང་ན། །\nསྡུག་བསྔལ་དཔག་ཏུ་མེད་པའི་གནས། །\nབདག་གོ་ཅི་ཕྱིར་སྙིང་མ་གས། །\nབདག་དང་གཞན་གྱི་ཡོན་ཏན་ནི། །\nམང་པོ་བདག་གིས་བསྒྲུབ་བྱ་སྟེ། །\nདེ་ལ་ཡོན་ཏན་རེ་རེ་ཡང་། །\nབསྐལ་པ་རྒྱ་མཚོས་གོམས་འགྱུར་ན། །\nབདག་ནི་ཡོན་ཏན་ཆ་ལ་ཡང་། །\nགོམས་པ་ནམ་ཡང་མ་སྐྱེས་ཏེ། །\nཇི་ཞིག་ལྟར་རྙེད་སྐྱེ་བ་ནི། །\nབདག་གིས་དོན་མེད་བྱས་པ་མཚར། །\nབདག་གིས་བཅོམ་ལྡན་མ་མཆོད་ཅིང་། །\nདགའ་སྟོན་ཆེན་པོའི་བདེ་མ་བྱིན། །\nབསྟན་ལ་བྱ་བ་མ་བྱས་དང་། །\nདབུལ་པོའི་བསམ་པ་རྫོགས་མ་བྱས། །\nའཇིགས་ལ་མི་འཇིགས་མ་བྱིན་དང་། །\nཉམ་ཐག་བདེ་མ་བྱིན་ན་བདག །\nམ་ཡི་མངལ་གྱི་ཟུག་རྔུ་དང་། །\nསྡུག་བསྔལ་འབའ་ཞིག་བསྐྱེད་པར་ཟད། །\nབདག་ནི་སྔོན་དང་ད་ལྟར་ཡང་། །\nཆོས་ལ་མོས་དང་བྲལ་བ་ཡིས། །\nཕོངས་པ་འདི་འདྲ་བྱུང་བར་གྱུར། །\nསུ་ཞིག་ཆོས་ལ་མོས་པ་གཏོང་། །\nདགེ་བའི་ཕྱོགས་ནི་ཐམས་ཅད་ཀྱི། །\nརྩ་བ་མོས་པར་ཐུབ་པས་གསུངས། །\nདེ་ཡི་རྩ་བ་རྟག་ཏུ་ནི། །\nརྣམ་སྨིན་འབྲས་བུ་བསྒོམས་པས་སོ། །\nསྡུག་བསྔལ་ཡིད་མི་བདེ་བ་དང་། །\nའཇིགས་པ་རྣམ་པ་སྣ་ཚོགས་དང་། །\nའདོད་པ་རྣམས་དང་བྲལ་བ་ནི། །\nསྡིག་པ་སྤྱོད་ལས་འབྱུང་བར་འགྱུར། །\nཡིད་ལ་བསམས་པའི་དགེ་བྱས་པས། །\nགང་དང་གང་དུ་འགྲོ་འགྱུར་བ། །\nདེ་དང་དེར་ནི་བསོད་ནམས་དེས། །\nའབྲས་བུའི་ཡོན་གྱིས་མངོན་མཆོད་འགྱུར། །\nསྡིག་པ་བྱེད་པ་བདེ་འདོད་ཀྱང་། །\nགང་དང་གང་དུ་འགྲོ་འགྱུར་བ། །\nདེ་དང་དེར་ནི་སྡིག་པ་དེས། །\nསྡུག་བསྔལ་མཚོན་གྱིས་རྣམ་པར་འཇོམས། །\nརྒྱ་ཆེ་དྲི་བཟང་བསེལ་བའི་པདྨའི་སྙིང་པོར་གནས། །\nརྒྱལ་བའི་གསུང་སྙན་ཟས་ཀྱིས་གཟི་བརྗིད་བསྐྱེད་བྱས་པ། །\nཐུབ་འོད་ཀྱིས་རྒྱས་པདྨ་ལས་བྱུང་ལུས་མཆོག་ཅན། །\nརྒྱལ་བའི་མདུན་གནས་བདེ་གཤེགས་སྲས་སུ་དགེ་བས་འགྱུར། །\nགཤིན་རྗེའི་སྐྱེས་བུས་པགས་པ་མ་ལུས་བཤུས་པས་ཤིན་ཏུ་ཉམ་ཐག་ཅིང་། །\nརབ་ཏུ་ཚ་བའི་མེ་ཡིས་བཞུས་པའི་ཟངས་ཞུན་ལུས་ལ་བླུགས་གྱུར་ལ། །\nའབར་བའི་རལ་གྲི་མདུང་ཐུང་གིས་བསྣུན་ཤ་ཡི་དུམ་བུ་བརྒྱར་ལྷགས་ཤིང་། །\nཤིན་ཏུ་འབར་བའི་ལྕགས་ཀྱི་ས་གཞིར་ལྷུང་བ་མི་དགེ་མང་པོས་འགྱུར། །\nདེ་བས་དགེ་ལ་མོས་བྱ་ཞིང་། །\nགུས་པ་ཉིད་དུ་བསྒོམ་པར་བྱ། །",
                        "children": []
                      },
                      {
                        "level": "7.2.3.2.1.2",
                        "title": "བརྟན་པའི་དཔུང་།",
                        "lines_span": "183-250",
                        "children": [
                          {
                            "level": "7.2.3.2.1.2.1",
                            "title": "སྤྱིར་བསྟན་པ།",
                            "lines_span": "183-194",
                            "line_text_excerpt": "རྡོ་རྗེ་རྒྱལ་མཚན་ཆོ་ག་ཡིས། །\nབརྩམས་ནས་ང་རྒྱལ་བསྒོམ་པར་བྱ། །\nདང་པོར་འབྱོར་པ་བརྟགས་ནས་ནི། །\nབརྩམ་མམ་ཡང་ན་མི་བརྩམ་བྱ། །\nམ་བརྩམས་པ་ནི་མཆོག་ཡིན་གྱི། །\nབརྩམས་ནས་ལྡོག་པར་མི་བྱའོ། །\nསྐྱེ་བ་གཞན་དུ་དེ་གོམས་ཤིང་། །\nསྡིག་དང་སྡུག་བསྔལ་འཕེལ་བར་འགྱུར། །\nགཞན་དང་འབྲས་བུའི་དུས་ཀྱང་ནི། །\nདམན་འགྱུར་དེ་ཡང་འགྲུབ་མི་འགྱུར། །\nལས་དང་ཉོན་མོངས་ནུས་པ་སྟེ། །\nགསུམ་པོ་དག་ལ་ང་རྒྱལ་བྱ། །",
                            "children": []
                          },
                          {
                            "level": "7.2.3.2.1.2.2",
                            "title": "བྱེ་བྲག་ཏུ་བཤད་པ།",
                            "lines_span": "195-250",
                            "children": [
                              {
                                "level": "7.2.3.2.1.2.2.1",
                                "title": "ལས་ཀྱི་ང་རྒྱལ་བསྒོམ་ཚུལ།",
                                "lines_span": "195-204",
                                "line_text_excerpt": "བདག་ཉིད་གཅིག་པུས་བྱའོ་ཞེས། །\nའདི་ནི་ལས་ཀྱི་ང་རྒྱལ་ཉིད། །\nཉོན་མོངས་དབང་མེད་འཇིག་རྟེན་འདིས། །\nརང་དོན་སྒྲུབ་པར་མི་ནུས་པས། །\nའགྲོ་བས་བདག་ལྟར་མི་ནུས་ཏེ། །\nདེ་བས་བདག་གིས་འདི་བྱའོ། །\nགཞན་དག་དམན་པའི་ལས་བྱེད་ན། །\nབདག་ཉིད་ཀྱང་ནི་ཇི་ལྟར་འདུག །\nང་རྒྱལ་གྱིས་ནི་མི་བྱེད་དེ། །\nབདག་ལ་ང་རྒྱལ་མེད་པ་མཆོག །",
                                "children": []
                              },
                              {
                                "level": "7.2.3.2.1.2.2.2",
                                "title": "ནུས་པའི་ང་རྒྱལ་བསྒོམ་ཚུལ།",
                                "lines_span": "205-220",
                                "line_text_excerpt": "ཤི་བའི་སྦྲུལ་དང་ཕྲད་གྱུར་ན། །\nཁྭ་ཡང་མཁའ་ལྡིང་ལྟ་བུར་སྤྱོད། །\nགལ་ཏེ་བདག་ཉིད་ཉམ་ཆུང་ན། །\nལྟུང་བ་ཆུང་ངུའང་གནོད་པར་བྱེད། །\nཞུམ་བཅས་རྩོལ་བ་དོར་བ་ལ། །\nཕོངས་ལས་ཐར་བ་ཡོད་དམ་ཅི། །\nང་རྒྱལ་རྩོལ་བ་བསྐྱེད་པས་ནི། །\nཆེན་པོ་ཡིས་ཀྱང་ཐུབ་པར་དཀའ། །\nདེ་བས་སེམས་ནི་བརྟན་པ་ཡིས། །\nལྟུང་བ་རྣམས་ནི་གཞོམ་བྱ་སྟེ། །\nབདག་ནི་ལྟུང་བས་ཕམ་བྱས་ན། །\nཁམས་གསུམ་རྒྱལ་འདོད་བཞད་གད་འགྱུར། །\nབདག་གིས་ཀུན་ལས་རྒྱལ་བྱ་སྟེ། །\nབདག་ལས་སུ་ཡང་རྒྱལ་མི་བྱ། །\nརྒྱལ་བ་སེང་གེའི་སྲས་བདག་གིས། །\nང་རྒྱལ་འདི་ལ་གནས་པར་བྱ། །",
                                "children": []
                              },
                              {
                                "level": "7.2.3.2.1.2.2.3",
                                "title": "ཉོན་མོངས་པའི་ང་རྒྱལ་དང་གཉེན་པོའི་ང་རྒྱལ་གྱི་ཁྱད་པར།",
                                "lines_span": "221-236",
                                "line_text_excerpt": "འགྲོ་གང་ང་རྒྱལ་གྱིས་བཅོམ་དེ། །\nཉོན་མོངས་ང་རྒྱལ་ཅན་མ་ཡིན། །\nང་རྒྱལ་ཅན་དགྲའི་དབང་མི་འགྲོ། །\nདེ་དག་ང་རྒྱལ་དགྲ་དབང་འགྱུར། །\nཉོན་མོངས་ང་རྒྱལ་གྱིས་ཁེངས་ནི། །\nངན་འགྲོར་ང་རྒྱལ་གྱིས་ཁྲིད་ཅིང་། །\nམི་ཡི་དགའ་སྟོན་བཅོམ་པ་དང་། །\nགཞན་གྱི་ཟན་ཟའི་བྲན་དང་ནི། །\nགླེན་པ་མི་སྡུག་ཉམ་ཆུང་དང་། །\nཐམས་ཅད་དུ་ནི་བརྙས་པར་འགྱུར། །\nང་རྒྱལ་གྱིས་ཁེངས་དཀའ་ཐུབ་ཅན། །\nདེ་ཡང་ང་རྒྱལ་ཅན་གཏོགས་ན། །\nདམན་པ་ཅི་འདྲ་ཡིན་པ་སྨྲོས། །\nགང་ཞིག་ང་རྒྱལ་དགྲ་ལས་རྒྱལ་ཕྱིར་ང་རྒྱལ་འཆང་། །\nདེ་ནི་ང་རྒྱལ་ཅན་དང་རྣམ་རྒྱལ་དཔའ་དེ་ཉིད། །\nགང་ཞིག་ང་རྒྱལ་དགྲ་བདོ་བ་ཡང་ངེས་བཅོམ་སྟེ། །\nའགྲོ་ལ་འདོད་བཞིན་རྒྱལ་བའི་འབྲས་བུ་རྫོགས་པར་བྱེད། །",
                                "children": []
                              },
                              {
                                "level": "7.2.3.2.1.2.2.4",
                                "title": "ཉོན་མོངས་པའི་དབང་དུ་མི་འགྲོ་བའི་ང་རྒྱལ།",
                                "lines_span": "237-250",
                                "line_text_excerpt": "ཉོན་མོངས་ཕྱོགས་ཀྱི་ཁྲོད་གནས་ན། །\nརྣམ་པ་སྟོང་དུ་སྲན་གཟུགས་ཏེ། །\nཝ་ལ་སོགས་པས་སེང་གེ་བཞིན། །\nཉོན་མོངས་ཚོགས་ཀྱིས་མི་ཚུགས་བྱ། །\nཉམ་ང་ཆེ་ཐང་བྱུང་གྱུར་ཀྱང་། །\nམི་ཡིས་མིག་ནི་བསྲུང་བ་ལྟར། །\nདེ་བཞིན་ཉམ་ང་བྱུང་གྱུར་ཀྱང་། །\nཉོན་མོངས་དབང་དུ་མི་འགྱུར་བྱ། །\nབདག་ནི་བསྲེགས་ཏེ་བསད་གྱུར་ཏམ། །\nབདག་གི་མགོ་བོ་བཅད་ཀྱང་བླ། །\nརྣམ་པ་ཀུན་དུ་ཉོན་མོངས་པའི། །\nདགྲ་ལ་འདུད་པར་མི་བྱའོ། །\nདེ་བཞིན་གནས་སྐབས་ཐམས་ཅད་དུ། །\nརིགས་པ་ལས་ནི་གཞན་མི་སྤྱད། །",
                                "children": []
                              }
                            ]
                          }
                        ]
                      },
                      {
                        "level": "7.2.3.2.1.3",
                        "title": "དགའ་བའི་དཔུང་།",
                        "lines_span": "251-266",
                        "line_text_excerpt": "རྩེད་མོའི་བདེ་འབྲས་འདོད་པ་ལྟར། །\nའདི་ཡིས་བྱ་བའི་ལས་གང་ཡིན། །\nལས་དེ་ལ་ནི་ཞེན་བྱ་སྟེ། །\nལས་དེས་མི་ངོམས་དགའ་བར་བྱ། །\nབདེ་བའི་དོན་དུ་ལས་བྱས་ཀྱང་། །\nབདེ་འགྱུར་མི་འགྱུར་གཏོལ་མེད་ཀྱི། །\nགང་གི་ལས་ཉིད་བདེ་འགྱུར་བ། །\nདེ་ལས་མི་བྱེད་ཇི་ལྟར་བདེ། །\nསྤུ་གྲིའི་སོར་ཆགས་སྦྲང་རྩི་ལྟའི། །\nའདོད་པ་རྣམས་ཀྱིས་མི་ངོམས་ན། །\nརྣམ་སྨིན་བདེ་ལ་ཞི་བ་ཡི། །\nབསོད་ནམས་ཀྱིས་ལྟ་ཅི་སྟེ་ངོམས། །\nདེ་ལྟས་ལས་ཚར་ཕྱིན་བྱའི་ཕྱིར། །\nཉི་མ་ཕྱེད་དུས་གདུངས་པ་ཡི། །\nགླང་ཆེན་མཚོ་ཕྲད་མཚོར་འཇུག་ལྟར། །\nལས་དེ་ལ་ཡང་འཇུག་པར་བྱ། །",
                        "children": []
                      },
                      {
                        "level": "7.2.3.2.1.4",
                        "title": "དོར་བའི་དཔུང་།",
                        "lines_span": "267-270",
                        "line_text_excerpt": "སྟོབས་ཉམས་པ་དང་རྗེས་འབྲེལ་ན། །\nསླར་བྱའི་དོན་དུ་དོར་བར་བྱ། །\nལེགས་པར་ཟིན་ན་ཕྱི་མ་དང་། །\nཕྱི་མ་འདོད་པས་དེ་སྤང་བྱ། །",
                        "children": []
                      }
                    ]
                  },
                  {
                    "level": "7.2.3.2.2",
                    "title": "སྟོབས་གཉིས་བསྐྱེད་ཚུལ།",
                    "lines_span": "271-306",
                    "children": [
                      {
                        "level": "7.2.3.2.2.1",
                        "title": "ལྷུར་ལེན་པའི་སྟོབས།",
                        "lines_span": "271-298",
                        "line_text_excerpt": "འཐབ་རྙིང་དགྲ་དང་ལྷན་ཅིག་ཏུ། །\nགཡུལ་ངོར་རལ་ཁ་ལྷགས་པ་བཞིན། །\nཉོན་མོངས་མཚོན་ལས་གཟུར་བྱ་ཞིང་། །\nཉོན་མོངས་དགྲ་རྣམས་གཞོམ་པར་བཏེག །\nགཡུལ་དུ་རལ་གྲི་ལྷུང་གྱུར་ན། །\nའཇིགས་པས་མྱུར་དུ་ལེན་པ་ལྟར། །\nདེ་བཞིན་དྲན་པའི་མཚོན་ཤོར་ན། །\nདམྱལ་བའི་འཇིགས་དྲན་མྱུར་དུ་བླང་། །\nཇི་ལྟར་ཁྲག་ལ་བརྟེན་བཅས་ནས། །\nདུག་ནི་ལུས་ལ་ཁྱབ་འགྱུར་བ། །\nདེ་བཞིན་གླགས་ནི་རྙེད་གྱur་ན། །\nཉེས་པས་སེམས་ལ་ཁྱབ་པར་འགྱུར། །\nཡུངས་མར་བཀང་བའི་སྣོད་བཀུར་ལ། །\nརལ་གྲི་ཐོགས་པས་དྲུང་བསྡད་དེ། །\nབོ་ན་གསོད་བསྡིགས་འཇིགས་པ་ལྟར། །\nབརྟུལ་ཞུགས་ཅན་གྱིས་དེ་བཞིན་སྒྲིམ། །\nདེ་བས་པང་དུ་སྦྲུལ་འོངས་ན། །\nཇི་ལྟར་རིངས་པར་ལྡང་བ་ལྟར། །\nདེ་བཞིན་གཉིད་དང་སྙོམ་འོངས་ན། །\nམྱུར་དུ་དེ་དག་བཟློག་པར་བྱ། །\nཉེས་པ་བྱུང་བ་རེ་རེ་ཞིང་། །\nབདག་ལ་སྨད་ནས་ཅི་ནས་ཀྱང་། །\nབདག་ལ་ཕྱིས་འདི་མི་འབྱུང་བ། །\nདེ་ལྟར་བྱ་ཞེས་ཡུན་རིང་བསམ། །\nཇི་ལྟར་གནས་སྐབས་འདི་དག་ལ། །\nདྲན་པ་གོམས་པ་ཉིད་འགྱུར་ཞེས། །\nརྒྱུ་འདི་ཡིས་ནི་ཕྲད་པའམ། །\nརིགས་པའི་ལས་ནི་འདོད་པར་བྱ། །",
                        "children": []
                      },
                      {
                        "level": "7.2.3.2.2.2",
                        "title": "དབང་བསྒྱུར་བའི་སྟོབས།",
                        "lines_span": "299-306",
                        "line_text_excerpt": "ཅི་ནས་ལས་བྱེད་སྔོན་རོལ་ནས། །\nཐམས་ཅད་ལ་ནི་མཐུ་ཡོད་པ། །\nདེ་ལྟར་བག་ཡོད་གཏམ་དྲན་ཏེ། །\nབདག་ཉིད་ལྡང་བ་ཡང་བར་བྱ། །\nཇི་ལྟར་རླུང་ནི་འགྲོ་བ་དང་། །\nའོང་བས་ཤིང་བལ་དབང་བསྒྱུར་བ། །\nདེ་བཞིན་སྤྲོ་བས་དབང་བསྒྱུར་ཏེ། །\nདེ་ལྟར་ན་ནི་འགྲུབ་པར་འགྱུར། །",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "level": "7.3",
        "title": "ལེའུའི་མཚན།",
        "lines_span": "307-308",
        "line_text_excerpt": "བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་ལས། \nབརྩོན་འགྲུས་བསྟན་པ་ཞེས་བྱ་བ་སྟེ་ལེའུ་བདུན་པའོ།། །།",
        "children": []
      }
    ]
  }
]