[
  {
    "level": "chapter-6",
    "title": "བཟོད་པ་བསྟན་པའི་ལེའུ།",
    "lines_span": "1-550",
    "children": [
      {
        "level": "section-6.1",
        "title": "ཁོང་ཁྲོ་སྤོང་བ།",
        "lines_span": "1-40",
        "children": [
          {
            "level": "subsection-6.1.1",
            "title": "ཁོང་ཁྲོའི་ཉེས་དམིགས་བསམ་པ།",
            "lines_span": "1-24",
            "line_text_excerpt": "བསྐལ་པ་སྟོང་དུ་བསགས་པ་ཡི། །\nསྦྱིན་དང་བདེ་གཤེགས་མཆོད་ལ་སོགས། །\nལེགས་སྤྱང་གང་ཡིན་དེ་ཀུན་ཡང་། །\nཁོང་ཁྲོ་གཅིག་གིས་འཇོམས་པར་བྱེད། །\nཞེ་སྡང་ལྟ་བུའི་སྡིག་པ་མེད། །\nབཟོད་པ་ལྟ་བུའི་དཀའ་ཐུབ་མེད། །\nདེ་བས་བཟོད་ལ་ནན་ཏན་དུ། །\nསྣ་ཚོགས་ཚུལ་དུ་བསྒོམ་པར་བྱ། །\nཞེ་སྡང་ཟུག་རྔུའི་སེམས་འཆང་ན། །\nཡིད་ནི་ཞི་བ་ཉམས་མི་མྱོང་། །\nདགའ་དང་བདེ་བའང་མི་འཐོབ་ལ། །\nགཉིད་མི་འོང་ཞིང་བརྟན་མེད་འགྱུར། །\nགང་དག་ནོར་དང་བཀུར་སྟི་ཡིས། །\nདྲིན་བྱིན་དེ་ལ་བརྟེན་གྱུར་པ། །\nདེ་དག་ཀྱང་ནི་སྡང་ལྡན་པའི། །\nརྗེ་དཔོན་དེ་ལ་གསོད་པར་རྒོལ། །\nདེ་ཡིས་མཛའ་བཤེས་སྐྱོ་བར་འགྱུར། །\nསྦྱིན་པས་བསྡུས་ཀྱང་བསྟེན་མི་བྱེད། །\nམདོར་ན་ཁྲོ་བ་བདེར་གནས་པ། །\nདེ་ནི་འགའ་ཡང་ཡོད་མ་ཡིན། །\nཁྲོ་བའི་དགྲ་ཡིས་དེ་ལ་སོགས། །\nསྡུག་བསྔལ་དག་ནི་བྱེད་པར་འགྱུར། །\nགང་ཞིག་བསྒྲིམས་ཏེ་ཁྲོ་འཇོམས་པ། །\nདེ་ནི་འདི་དང་གཞན་དུ་བདེ། །",
            "children": []
          },
          {
            "level": "subsection-6.1.2",
            "title": "ཡིད་མི་བདེ་བ་བཟློག་པའི་ཐབས།",
            "lines_span": "25-40",
            "line_text_excerpt": "མི་འདོད་བྱས་དང་འདོད་པ་ཡི། །\nགེགས་བྱས་པ་ལ་བྱུང་གྱུར་པ། །\nཡིད་མི་བདེ་བའི་ཟས་རྙེད་ནས། །\nཞེ་སྡང་བརྟས་ཏེ་བདག་འཇོམས་སོ། །\nདེ་ལྟས་བདག་གིས་དགྲ་བོ་དེའི། །\nཟས་ནི་རྣམ་པར་གཞོམ་པར་བྱ། །\nའདི་ལྟར་བདག་ལ་གནོད་པ་ལས། །\nདགྲ་འདི་ལ་ནི་ལས་གཞན་མེད། །\nཅི་ལ་བབ་ཀྱང་བདག་གིས་ནི། །\nདགའ་བའི་ཡིད་ནི་དཀྲུགས་མི་བྱ། །\nམི་དགའ་བྱས་ཀྱང་འདོད་མི་འགྲུབ། །\nདགེ་བ་དག་ནི་ཉམས་པར་འགྱུར། །\nགལ་ཏེ་བཅོས་སུ་ཡོད་ན་ནི། །\nདེ་ལ་མི་དགར་ཅི་ཞིག་ཡོད། །\nགལ་ཏེ་བཅོས་སུ་མེད་ན་ནི། །\nདེ་ལ་མི་དགའ་བྱས་ཅི་ཕན། །",
            "children": []
          }
        ]
      },
      {
        "level": "section-6.2",
        "title": "བཟོད་པ་བསྒོམ་པ།",
        "lines_span": "41-444",
        "children": [
          {
            "level": "subsection-6.2.1",
            "title": "བཟོད་ཡུལ་ངོས་བཟུང་བ།",
            "lines_span": "41-44",
            "line_text_excerpt": "བདག་གམ་བདག་གི་བཤེས་རྣམས་ལ། །\nསྡུག་བསྔལ་བརྙས་དང་ཚིག་རྩུབ་དང་། །\nམི་སྙན་ཞེས་བྱ་མི་འདོད་དེ། །\nདགྲ་ལ་དེ་ལས་བཟློག་པས་སོ། །",
            "children": []
          },
          {
            "level": "subsection-6.2.2",
            "title": "བཟོད་པ་བསྒོམ་པ།",
            "lines_span": "45-444",
            "children": [
              {
                "level": "subsubsection-6.2.2.1",
                "title": "མི་འདོད་པ་བྱས་པ་ལ་བཟོད་པ་བསྒོམ་པ།",
                "lines_span": "45-344",
                "children": [
                  {
                    "level": "paragraph-6.2.2.1.1",
                    "title": "བདག་ལ་སྡུག་བསྔལ་བྱེད་པ་ལ་བཟོད་པ་བསྒོམ་པ།",
                    "lines_span": "45-204",
                    "children": [
                      {
                        "level": "subparagraph-6.2.2.1.1.1",
                        "title": "སྡུག་བསྔལ་དང་ལེན་གྱི་བཟོད་པ།",
                        "lines_span": "45-84",
                        "line_text_excerpt": "བདེ་བའི་རྒྱུ་ནི་རེས་འགའ་འབྱུང་། །\nསྡུག་བསྔལ་རྒྱུ་ནི་ཤིན་ཏུ་མང་། །\nསྡུག་བསྔལ་མེད་པར་ངེས་འབྱུང་མེད། །\nདེ་བས་སེམས་ཁྱོད་བརྟན་པར་མནོས། །\nདཀའ་ཟློག་དད་དང་ཀརྞ་པ། །\nབསྲེག་དང་བཅད་སོགས་ཚོར་བ་ནི། །\nདོན་མེད་བཟོད་བྱེད་ཐར་པ་ཡི། །\nདོན་དུ་བདག་གོ་ཅི་ཕྱིར་སྔར། །\nགོམས་ན་སླ་བར་མི་འགྱུར་བའི། །\nདངོས་དེ་གང་ཡང་ཡོད་མ་ཡིན། །\nདེ་བས་གནོད་པ་ཆུང་གོམས་པས། །\nགནོད་པ་ཆེན་པོ་བཟོད་པར་བྱོས། །\nསྦྲུལ་དང་ཤ་སྦྲང་དག་དང་ནི། །\nབཀྲེས་སྐོམ་ལ་སོགས་ཚོར་བ་དང་། །\nགཡན་པ་ལ་སོགས་བཅས་པ་ཡི། །\nདོན་མེད་སྡུག་བསྔལ་ཅིས་མ་མཐོང་། །\nཚ་གྲང་ཆར་དང་རླུང་སོགས་དང་། །\nནད་དང་འཆིང་དང་རྡེག་སོགས་ལ། །\nབདག་གིས་བཟེ་རེ་མི་བྱ་སྟེ། །\nདེ་ལྟར་བྱས་ན་གནོད་པ་འཕེལ། །\nལ་ལ་བདག་གི་ཁྲག་མཐོང་ན། །\nདཔའ་བརྟན་ལྷག་པར་སྐྱེ་འགྱུར་ཡོད། །\nལ་ལ་གཞན་གྱི་ཁྲག་མཐོང་ན། །\nབོག་ཅིང་བརྒྱལ་བར་འགྱུར་བ་ཡོད། །\nདེ་ནི་སེམས་ཀྱི་ངང་བརྟན་དང་། །\nསྔར་མའི་ཚུལ་ལས་གྱུར་པ་ཡིན། །\nདེ་བས་གནོད་པ་ཁྱད་བསད་ཅིང་། །\nསྡུག་བསྔལ་རྣམས་ཀྱིས་མི་ཚུགས་བྱོས། །\nམཁས་པས་སྡུག་བསྔལ་བྱུང་ཡང་ནི། །\nསེམས་ཀྱི་རབ་དང་རྙོག་མི་བྱ། །\nཉོན་མོངས་རྣམས་དང་གཡུལ་འགྱེད་ལ། །\nགཡུལ་འགྱེད་ཚེ་ན་གནོད་པ་མང་། །\nསྡུག་བསྔལ་ཐམས་ཅད་ཁྱད་བསད་ནས། །\nཞེ་སྡང་ལ་སོགས་དགྲ་འཇོམས་པ། །\nདེ་དག་རྒྱལ་བྱེད་དཔའ་བོ་སྟེ། །\nལྷག་མ་རོ་ལ་གསོད་པའོ། །\nགཞན་ཡང་སྡུག་བསྔལ་ཡོན་ཏན་ནི། །\nསྐྱོ་བས་དྲེགས་པ་སེལ་བར་བྱེད། །\nའཁོར་བ་པ་ལ་སྙིང་རྗེ་སྐྱེ། །\nསྡིག་ལ་འཛེམ་དང་དགེ་ལ་དགའ། །",
                        "children": []
                      },
                      {
                        "level": "subparagraph-6.2.2.1.1.2",
                        "title": "ཆོས་ལ་ངེས་སེམས་ཀྱི་བཟོད་པ།",
                        "lines_span": "85-132",
                        "line_text_excerpt": "མཁྲིས་པ་ལ་སོགས་སྡུག་བསྔལ་གྱི། །\nའབྱུང་གནས་ཆེ་ལ་མི་ཁྲོ་བར། །\nསེམས་ཡོད་རྣམས་ལ་ཅི་སྟེ་ཁྲོ། །\nདེ་དག་ཀུན་ཀྱང་རྐྱེན་གྱིས་བསྐུལ། །\nདཔེར་ན་མི་འདོད་བཞིན་དུ་ཡང་། །\nནད་འདི་འབྱུང་བར་འགྱུར་བ་ལྟར། །\nདེ་བཞིན་མི་འདོད་བཞིན་དུ་ཡང་། །\nནན་གྱིས་ཉོན་མོངས་འབྱུང་བར་འགྱུར། །\nཁྲོ་བར་བྱ་ཞེས་མ་བསམས་ཀྱང་། །\nསྐྱེ་བོ་རྣམས་ནི་གྱི་ནར་ཁྲོ། །\nབསྐྱེད་པར་བྱ་ཞེས་མ་བསམས་ཀྱང་། །\nཁྲོ་བ་དེ་བཞིན་སྐྱེ་བར་འགྱུར། །\nཉེས་པ་ཇི་སྙེད་ཐམས་ཅད་དང་། །\nསྡིག་པ་རྣམ་པ་སྣ་ཚོགས་པ། །\nདེ་ཀུན་རྐྱེན་གྱི་སྟོབས་ལས་བྱུང་། །\nརང་དབང་ཡོད་པ་མ་ཡིན་ནོ། །\nརྐྱེན་རྣམས་ཚོགས་པ་དེ་དག་ཀྱང་། །\nབསྐྱེད་པར་བྱ་ཞེས་སེམས་པ་མེད། །\nདེས་བསྐྱེད་དེ་ཡང་བདག་བསྐྱེད་ཅེས། །\nསེམས་པ་ཡོད་པ་མ་ཡིན་ནོ། །\nགཙོ་བོ་ཞེས་བྱར་གང་འདོད་དང་། །\nབདག་ཅེས་བརྟགས་པ་གང་ཡིན་པ། །\nདེ་ཉིད་བདག་ནི་འབྱུང་བྱ་ཞེས། །\nཆེད་དུ་བསམས་ཤིང་འབྱུང་བ་མེད། །\nམ་སྐྱེས་པར་ནི་དེ་མེད་ན། །\nདེ་ཚེ་སྐྱེ་བར་འདོད་པ་གང་། །\nཡུལ་ལ་རྟག་ཏུ་གཡེང་འགྱུར་བ། །\nའགག་པར་འགྱུར་བའང་མ་ཡིན་ནོ། །\nཅི་སྟེ་བདག་དེ་རྟག་ན་ནི། །\nམཁའ་བཞིན་བྱེད་པ་མེད་པར་མངོན། །\nརྐྱེན་རྣམས་གཞན་དང་ཕྲད་ན་ཡང་། །\nའགྱུར་བ་མེད་ལ་ཅི་བྱར་ཡོད། །\nབྱེད་པའི་ཚེ་ཡང་སྔོན་བཞིན་ན། །\nབྱེད་པས་དེ་ལ་ཅི་ཞིག་བྱས། །\nདེ་ཡི་བྱེད་པ་འདི་ཡིན་ཞེས། །\nའབྲེལ་པར་འགྱུར་བ་གང་ཞིག་ཡོད། །\nདེ་ལྟར་ཐམས་ཅད་གཞན་གྱི་དབང་། །\nདེ་ཡི་དབང་གིས་དེ་དབང་མེད། །\nདེ་ལྟར་ཤེས་ན་སྦྲུལ་ལྟ་བུའི། །\nདངོས་པོ་ཀུན་ལ་ཁྲོ་མི་འགྱུར། །\nགང་གིས་གང་ཞིག་བཟློག་བྱ་སྟེ། །\nབཟློག་པའང་རིགས་པ་མིན་ཞེ་ན། །\nདེ་ལ་བརྟེན་ནས་སྡུག་བསྔལ་རྣམས། །\nརྒྱུན་ཆད་འགྱུར་འདོད་མི་རིགས་མེད། །\nདེ་བས་དགྲའམ་མཛའ་ཡང་རུང་། །\nམི་རིགས་བྱེད་པ་མཐོང་གྱུར་ན། །\nའདི་འདྲའི་རྐྱེན་ལས་གྱུར་ཏོ་ཞེས། །\nདེ་ལྟར་སོམས་ཏེ་བདེ་བར་མནོས། །",
                        "children": []
                      },
                      {
                        "level": "subparagraph-6.2.2.1.1.3",
                        "title": "གནོད་བྱེད་ལ་ཇི་མི་སྙམ་པའི་བཟོད་པ།",
                        "lines_span": "133-204",
                        "line_text_excerpt": "གལ་ཏེ་རང་དགས་འགྲུབ་འགྱུར་ན། །\nའགའ་ཡང་སྡུག་བསྔལ་མི་འདོད་པས། །\nལུས་ཅན་དག་ནི་ཐམས་ཅད་ཀྱང་། །\nསུ་ལའང་སྡུག་བསྔལ་འབྱུང་མི་འགྱུར། །\nབག་མེད་པས་ནི་བདག་ལའང་བདག །\nཚེར་མ་ལ་སོགས་གནོད་པ་བྱེད། །\nབུད་མེད་ལ་སོགས་ཐོབ་བྱའི་ཕྱིར། །\nརྔམ་ཞིང་ཟས་གཅོད་ལ་སོགས་བྱེད། །\nཁ་ཅིག་འགག་ཅིང་གཡང་སར་མཆོང་། །\nདུག་དང་མི་འཕྲོད་ཟ་བ་དང་། །\nབསོད་ནམས་མ་ཡིན་སྤྱོད་པ་ཡིས། །\nརང་ལ་གནོད་པ་བྱེད་པ་ཡོད། །\nགང་ཚེ་ཉོན་མོངས་དབང་གྱུར་པས། །\nབདག་སྡུག་ཉིད་ཀྱང་གསོད་བྱེད་པ། །\nདེ་ཚེ་དེ་དག་གཞན་ལུས་ལ། །\nགནོད་མི་བྱེད་པར་ཇི་ལྟར་འགྱུར། །\nཉོན་མོངས་སྐྱེས་པས་དེ་ལྟ་བུར། །\nབདག་གསོད་ལ་སོགས་ཞུགས་པ་ལ། །\nསྙིང་རྗེ་རྒྱ་ལ་མ་སྐྱེས་ན། །\nཁྲོ་བར་འགྱུར་བ་ཅིའི་ཐ་ཚིག །\nགལ་ཏེ་གཞན་ལ་འཚེ་བྱེད་པ། །\nབྱིས་པ་རྣམས་ཀྱི་རང་བཞིན་ནི། །\nདེ་ལ་ཁྲོ་བ་མི་རིགས་ཏེ། །\nསྲེག་པའི་རང་བཞིན་མེ་བཀོན་འདྲ། །\nའོན་ཏེ་སྐྱོན་དེ་གློ་བུར་ལ། །\nསེམས་ཅན་རང་བཞིན་དེས་པ་ནའང་། །\nའོ་ནའང་ཁྲོ་བར་མི་རིགས་ཏེ། །\nམཁའ་ལ་དུད་འཐུལ་དཀོན་པ་བཞིན། །\nདབྱུག་པ་ལ་སོགས་དངོས་བཀོལ་ཏེ། །\nགལ་ཏེ་འཕེན་པ་ལ་ཁྲོ་ན། །\nདེ་ཡང་ཞེ་སྡང་གིས་རྦད་པས། །\nཉིས་ན་ཞེ་སྡང་ལ་ཁྲོ་རིགས། །\nབདག་གིས་སྔོན་ཆད་སེམས་ཅན་ལ། །\nའདི་འདྲ་བ་ཡི་གནོད་པ་བྱས། །\nདེ་བས་སེམས་ཅན་འཚེ་བྱེད་པ། །\nབདག་ལ་གནོད་པ་འདི་འབྱུང་རིགས། །\nདེ་ཡི་མཚོན་དང་བདག་གི་ལུས། །\nགཉི་ག་སྡུག་བསྔལ་རྒྱུ་ཡིན་ཏེ། །\nདེས་མཚོན་བདག་གི་ལུས་ཕྱུང་ན། །\nགང་ཞིག་ལ་ནི་ཁྲོ་བར་བྱ། །\nཤུ་བ་མི་ཡི་གཟུགས་འདྲ་བ། །\nརེག་ཏུ་མི་བཟོད་སྡུག་བསྔལ་ཅན། །\nསྲེད་མདོངས་བདག་གིས་བཟུང་གྱུར་ན། །\nདེ་ལ་གནོད་པ་སུ་ལ་ཁྲོ། །\nབྱིས་པ་སྡུག་བསྔལ་མི་འདོད་ཅིང་། །\nསྡུག་བསྔལ་རྒྱུ་ལ་བརྐམ་པས་ན། །\nརང་གི་ཉེས་པས་གནོད་གྱུར་པ། །\nགཞན་ལ་བཀོན་དུ་ཅི་ཞིག་ཡོད། །\nདཔེར་ན་དམྱལ་བའི་སྲུང་མ་དང་། །\nརལ་གྲི་ལོ་མའི་ནགས་ཚལ་ལྟར། །\nརང་གི་ལས་ཀྱིས་འདི་བསྐྱེད་པ། །\nགང་ཞིག་ལ་ནི་ཁྲོ་བར་བྱ། །\nབདག་གི་ལས་ཀྱིས་བསྐུལ་བྱས་ནས། །\nབདག་ལ་གནོད་བྱེད་རྣམས་འབྱུང་སྟེ། །\nདེས་ནི་སེམས་ཅན་དམྱལ་འདོང་ན། །\nབདག་གིས་དེ་དག་མ་བརླག་གམ། །\nའདི་དག་ལ་ནི་རྟེན་བཅས་ནས། །\nབཟོད་པས་བདག་སྡིག་མང་དུ་འབྱུང་། །\nབདག་ལ་བརྟེན་ནས་དེ་དག་ནི། །\nཡུན་རིང་སྡུག་བསྔལ་དམྱལ་བར་འདོང་། །\nབདག་ནི་དེ་ལ་གནོད་བྱེད་ལ། །\nདེ་དག་བདག་ལ་ཕན་འདོགས་ན། །\nཕྱིན་ཅི་ལོག་ཏུ་ཅི་ཡི་ཕྱིར། །\nམ་རུངས་སེམས་ཁྱོད་ཁྲོ་བར་བྱེད། །\nགལ་ཏེ་བདག་ལ་བསམ་པ་ཡི། །\nཡོན་ཏན་ཡོད་ན་དམྱལ་མི་འགྲོ། །\nགལ་ཏེ་བདག་གིས་བདག་བསྲུངས་ན། །\nདེ་དག་ལ་འདིར་ཅི་ཞིག་བྱུང་། །\nའོན་ཏེ་ལན་དུ་གནོད་བྱས་ན། །\nདེ་དག་བསྲུངས་པར་མ་གྱུར་ལ། །\nབདག་གི་སྤྱོད་པའང་ཉམས་པར་འགྱུར། །\nདེས་ན་དཀའ་ཐུབ་ཞིག་པར་འགྱུར། །",
                        "children": []
                      }
                    ]
                  },
                  {
                    "level": "paragraph-6.2.2.1.2",
                    "title": "བདག་ལ་བརྙས་སོགས་བྱེད་པ་ལ་བཟོད་པ།",
                    "lines_span": "205-252",
                    "line_text_excerpt": "ཡིད་ནི་ལུས་ཅན་མ་ཡིན་པས། །\nསུས་ཀྱང་གང་དུའང་གཞོམ་མི་ནུས། །\nལུས་ལ་མངོན་པར་ཞེན་པས་ན། །\nལུས་ནི་སྡུག་བསྔལ་དག་གིས་གནོད། །\nབརྙས་དང་ཚིག་རྩུབ་སྨྲ་བ་དང་། །\nམི་སྙན་པ་ཡི་ཚིག་དེ་ཡིས། །\nལུས་ལ་གནོད་པར་མི་འགྱུར་ན། །\nསེམས་ཁྱོད་ཅི་ཕྱིར་རབ་ཏུ་ཁྲོ། །\nགཞན་དག་བདག་ལ་མི་དགའ་བ། །\nདེས་ནི་ཚེ་འདིའམ་ཚེ་གཞན་ལ། །\nབདག་ལ་ཟ་བར་མི་བྱེད་ན། །\nབདག་ནི་ཅི་ཕྱིར་དེ་མི་འདོད། །\nརྙེད་པའི་བར་ཆད་བྱེད་པའི་ཕྱིར། །\nགལ་ཏེ་འདི་བདག་མི་འདོད་ན། །\nབདག་གི་རྙེད་པ་འདིར་འདོར་གྱི། །\nསྡིག་པ་དག་ནི་བརྟན་པར་གནས། །\nབདག་ནི་དེང་ཉིད་ཤི་ཡང་བླའི། །\nལོག་འཚོས་ཡུན་རིང་གསོན་མི་རུང་། །\nབདག་ལྟ་ཡུན་རིང་གནས་གྱུར་ཀྱང་། །\nའཆི་བའི་སྡུག་བསྔལ་དེ་ཉིད་ཡིན། །\nརྨི་ལམ་ལོ་བརྒྱར་བདེ་མྱོང་ནས། །\nསད་པར་གྱུར་པ་གང་ཡིན་དང་། །\nགཞན་ཞིག་ཡུད་ཙམ་བདེ་མྱོང་ནས། །\nསད་པར་གྱུར་པ་གང་ཡིན་པ། །\nསད་པ་དེ་དག་གཉི་ག་ལའང་། །\nབདེ་བ་དེ་ནི་ཕྱིར་འོང་མེད། །\nཚེ་རིང་ཚེ་ཐུང་གཉི་ག་ཡང་། །\nའཆི་བའི་དུས་སུ་དེ་འདྲར་ཟད། །\nརྙེད་པ་མང་པོ་ཐོབ་གྱུར་ཏེ། །\nཡུན་རིང་དུས་སུ་བདེ་སྤྱད་ཀྱང་། །\nཆོམ་པོས་ཕྲོགས་པ་ཇི་བཞིན་དུ། །\nསྒྲེན་མོ་ལག་པ་སྟོང་པར་འགྲོ། །\nགལ་ཏེ་རྙེད་པས་གསོན་གྱུར་ན། །\nསྡིག་ཟད་བསོད་ནམས་བྱ་ཞེ་ན། །\nརྙེད་པའི་དོན་དུ་ཁྲོས་གྱུར་ན། །\nབསོད་ནམས་ཟད་སྡིག་མི་འགྱུར་རམ། །\nགང་གི་དོན་དུ་བདག་གསོན་པ། །\nདེ་ཉིད་གལ་ཏེ་ཉམས་གྱུར་ན། །\nསྡིག་པ་འབའ་ཞིག་བྱེད་པ་ཡི། །\nགསོན་པ་དེས་ཀོ་ཅི་ཞིག་བྱ། །\nགལ་ཏེ་སེམས་ཅན་ཉམས་བྱེད་པས། །\nམི་སྙན་སྨྲ་ལ་ཁྲོ་ཞེ་ན། །\nགཞན་ལ་མི་སྙན་བརྗོད་ལའང་ཁྱོད། །\nདེ་བཞིན་ཅི་སྟེ་ཁྲོ་མི་བྱེད། །\nམ་དད་གཞན་ལ་རག་ལས་པས། །\nདད་པ་མེད་ལ་ཁྱོད་བཟོད་ན། །\nཉོན་མོངས་སྐྱེ་ལ་རག་ལས་པས། །\nམི་སྙན་སྨྲ་ལ་ཅིས་མི་བཟོད། །",
                    "children": []
                  },
                  {
                    "level": "paragraph-6.2.2.1.3",
                    "title": "བདག་གི་བཤེས་ལ་མི་འདོད་པ་བྱེད་པ་ལ་བཟོད་པ།",
                    "lines_span": "253-300",
                    "line_text_excerpt": "སྐུ་གཟུགས་མཆོད་རྟེན་དམ་ཆོས་ལ། །\nའཁྱལ་ཞིང་འཇིག་པར་བྱེད་པ་ལའང་། །\nབདག་གིས་ཞེ་སྡང་མི་རིགས་ཏེ། །\nསངས་རྒྱས་སོགས་ལ་གནོད་མི་མངའ། །\nབླ་མ་གཉེན་ལ་སོགས་པ་དང་། །\nབཤེས་ལ་གནོད་པ་བྱེད་རྣམས་ལའང་། །\nསྔ་མའི་ཚུལ་གྱིས་རྐྱེན་དག་ལས། །\nའགྱུར་བར་མཐོང་ནས་ཁྲོ་བ་བཟློག །\nལུས་ཅན་རྣམས་ལ་སེམས་ཡོད་དང་། །\nསེམས་མེད་གཉི་གས་གནོད་བྱས་ན། །\nསེམས་ཡོད་ཅི་སྟེ་བཀར་ཏེ་བཀོན། །\nདེ་བས་གནོད་པ་བཟོད་པར་གྱིས། །\nལ་ལ་རྨོངས་པས་ཉེས་པ་བྱེད། །\nལ་ལ་རྨོངས་ཏེ་ཁྲོས་གྱུར་ན། །\nདེ་ལ་སྐྱོན་མེད་གང་གིས་བྱ། །\nསྐྱོན་དང་བཅས་ཏེ་གང་ཞིག་ཡིན། །\nགང་གིས་གཞན་དག་གནོད་བྱེད་པའི། །\nལས་དེ་སྔོན་ཆད་ཅི་ཕྱིར་བྱས། །\nཐམས་ཅད་ལས་ལ་རག་ལས་ན། །\nབདག་གིས་འདི་ལ་ཅི་སྟེ་བཀོན། །\nདེ་ལྟར་མཐོང་ནས་ཅི་ནས་ཀྱང་། །\nཐམས་ཅད་ཕན་ཚུན་བྱམས་སེམས་སུ། །\nའགྱུར་བ་དེ་ལྟར་བདག་གིས་ནི། །\nབསོད་ནམས་དག་ལ་བསྒྲིམས་ཏེ་བྱ། །\nདཔེར་ན་ཁྱིམ་ཚིག་གྱུར་པའི་མེ། །\nཁྱིམ་གཞན་ཞིག་ཏུ་སོང་ནས་ནི། །\nརྩྭ་སོགས་གང་ལ་མཆེད་བྱེད་པ། །\nདེ་ནི་ཕྱུང་སྟེ་དོར་བ་ཡིན། །\nདེ་བཞིན་གང་ལ་སེམས་ཆགས་ནས། །\nཞེ་སྡང་མེ་ནི་མཆེད་གྱུར་པ། །\nབསོད་ནམས་ཚིག་པར་དོགས་པ་ཡིས། །\nདེ་ནི་དེ་ཡི་མོད་ལ་དོར། །\nགསད་བྱའི་མི་ཞིག་ལག་བཅད་དེ། །\nགལ་ཏེ་ཐར་ན་ཅིས་མ་ལེགས། །\nགལ་ཏེ་མི་ཡི་སྡུག་བསྔལ་གྱིས། །\nདམྱལ་བ་བྲལ་ན་ཅིས་མ་ལེགས། །\nད་ལྟའི་སྡུག་བསྔལ་འདི་ཙམ་ལའང་། །\nབདག་གིས་བཟོད་པར་མི་ནུས་ན། །\nདེས་ན་དམྱལ་བའི་སྡུག་བསྔལ་རྒྱུ། །\nཁྲོ་བ་ཅི་སྟེ་བཟློག་མི་བྱེད། །\nའདོད་པའི་དོན་དུ་སྲེག་ལ་སོགས། །\nདམྱལ་བར་སྟོང་ཕྲག་མྱོང་གྱུར་ཡང་། །\nབདག་གིས་རང་གི་དོན་དང་ནི། །\nགཞན་གྱི་དོན་ཡང་མ་བྱས་སོ། །\nའདི་ནི་དེ་ཙམ་གནོད་མིན་ལ། །\nདོན་ཆེན་དག་ཀྱང་འགྲུབ་འགྱུར་བས། །\nའགྲོ་བའི་གནོད་སེལ་སྡུག་བསྔལ་ལ། །\nདགའ་བ་འབའ་ཞིག་འདིར་བྱ་རིགས། །",
                    "children": []
                  },
                  {
                    "level": "paragraph-6.2.2.1.4",
                    "title": "དགྲ་ལ་ལེགས་བྱས་བཟོད་པ།",
                    "lines_span": "301-344",
                    "line_text_excerpt": "གཞན་གྱིས་ཡོན་ཏན་ལྡན་བསྟོད་ནས། །\nགལ་ཏེ་དགའ་བའི་བདེ་ཐོབ་ན། །\nཡིད་ཁྱོད་ཀྱང་ནི་དེ་བསྟོད་ནས། །\nཅི་ཕྱིར་དེ་ལྟར་དགའ་མི་བྱེད། །\nཁྱོད་ཀྱི་དགའ་བའི་བདེ་བ་འདི། །\nབདེ་འབྱུང་ཁ་ན་མ་ཐོ་མེད། །\nཡོན་ཏན་ལྡན་པ་རྣམས་ཀྱིས་གནང་། །\nགཞན་སྡུད་པ་ཡི་མཆོག་ཀྱང་ཡིན། །\nགཞན་ཡང་དེ་ལྟར་བདེ་འགྱུར་ཞེས། །\nགལ་ཏེ་ཁྱོད་བདེ་འདི་མི་འདོད། །\nགླ་རྔན་སྦྱིན་སོགས་སྤངས་པའི་ཕྱིར། །\nམཐོང་དང་མ་མཐོང་ཉམས་པར་འགྱུར། །\nརང་གི་ཡོན་ཏན་བརྗོད་པའི་ཚེ། །\nགཞན་ལ་བདེ་བའང་འདོད་པར་བྱེད། །\nགཞན་གྱི་ཡོན་ཏན་བརྗོད་པའི་ཚེ། །\nརང་ལའང་བདེ་བ་མི་འདོད་བྱེད། །\nསེམས་ཅན་ཐམས་ཅད་བདེ་འདོད་པས། །\nབྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་ནས། །\nསེམས་ཅན་རང་གིས་བདེ་རྙེད་ན། །\nདེས་ཀོ་ཅི་སྟེ་ཁྲོ་བར་བྱེད། །\nའཇིག་རྟེན་གསུམ་མཆོད་འཚང་རྒྱ་བར། །\nསེམས་ཅན་རྣམས་ནི་འདོད་ཅེ་ན། །\nབསྙེན་བཀུར་ངན་ངོན་ཙམ་མཐོང་ནས། །\nཅི་ཕྱིར་དེ་ལ་གདུང་བར་བྱེད། །\nགསོ་བྱ་གང་ཞིག་ཁྱོད་གསོ་བ། །\nཁྱོད་ཉིད་ཀྱིས་ནི་སྦྱིན་བྱ་དེ། །\nགཉེན་གྱིས་འཚོ་བ་རྙེད་གྱུར་ན། །\nདགར་མི་འགྱུར་བར་སླར་ཁྲོའམ། །\nདེ་ཅི་འགྲོ་ལ་མི་འདོད་ན། །\nདེ་ལ་བྱང་ཆུབ་འདོད་གང་ཡིན། །\nགང་ཞིག་གཞན་འབྱོར་ཁྲོ་དེ་ལ། །\nབྱང་ཆུབ་སེམས་ནི་ག་ལ་ཡོད། །\nགལ་ཏེ་དེས་དེ་ལས་རྙེད་དམ། །\nསྦྱིན་བདག་ཁྱིམ་ན་གནས་གྱུར་པ། །\nཀུན་དུ་དེ་ཁྱོད་ལ་མེད་ན། །\nབྱིན་མ་བྱིན་རུང་དེས་ཅི་བྱ། །\nབསོད་ནམས་དང་ནི་དད་པའམ། །\nརང་གི་ཡོན་ཏན་ཅི་ཕྱིར་འདོར། །\nརྙེད་པ་གྱུར་པ་མི་འཛིན་པ། །\nགང་གིས་ཁྲོ་བ་མི་བྱེད་སྨྲོས། །\nཁྱོད་ནི་རང་གིས་སྡིག་བྱས་ལ། །\nམྱ་ངན་མེད་པར་མ་ཟད་ཀྱི། །\nབསོད་ནམས་བྱས་པ་གཞན་དག་དང་། །\nལྷན་ཅིག་འགྲན་པར་བྱེད་འདོད་དམ།། །།",
                    "children": []
                  }
                ]
              },
              {
                "level": "subsubsection-6.2.2.2",
                "title": "འདོད་པའི་གེགས་བྱེད་པ་ལ་བཟོད་པ་བསྒོམ་པ།",
                "lines_span": "345-444",
                "children": [
                  {
                    "level": "paragraph-6.2.2.2.1",
                    "title": "དགྲ་བོའི་མི་འདོད་པའི་གེགས་བྱེད་པ་ལ་བཟོད་པ་བསྒོམ་པ།",
                    "lines_span": "345-356",
                    "line_text_excerpt": "གལ་ཏེ་དགྲ་ཞིག་མི་དགའ་ནའང་། །\nདེ་ལ་ཁྱོད་དགར་ཅི་ཞིག་ཡོད། །\nཁྱོད་ཀྱི་ཡིད་སྨོན་ཙམ་གྱིས་ནི། །\nདེ་ལ་གནོད་པའི་རྒྱུར་མི་འགྱུར། །\nཁྱོད་ཀྱི་འདོད་པས་སྡུག་བསྔལ་དེ། །\nགྲུབ་ནའང་ཁྱོད་དགར་ཅི་ཞིག་ཡོད། །\nགལ་ཏེ་འཚེངས་པར་འགྱུར་ཞེ་ན། །\nདེ་ལས་ཕུང་བའང་གཞན་ཅི་ཡོད། །\nཉོན་མོངས་ཉ་པས་བཏབ་པ་ཡི། །\nམཆིལ་པ་འདི་ནི་མི་བཟད་གཟེ། །\nདེས་བཟུང་སེམས་དམྱལ་བུམ་པར་ཡང་། །\nདམྱལ་བའི་སྲུང་མས་བདག་འཚེད་དེས། །",
                    "children": []
                  },
                  {
                    "level": "paragraph-6.2.2.2.2",
                    "title": "བདག་དང་བདག་གི་བཤེས་ལ་འདོད་པའི་གེགས་བྱེད་པ་ལ་བཟོད་པ་བསྒོམ་པ།",
                    "lines_span": "357-444",
                    "line_text_excerpt": "བསྟོད་དང་གྲགས་པའི་རིམ་གྲོས་ནི། །\nབསོད་ནམས་མི་འགྱུར་ཆེར་མི་འགྱུར། །\nབདག་སྟོབས་མི་འགྱུར་ནད་མེད་མིན། །\nལུས་བདེ་བར་ཡང་མི་འགྱུར་རོ། །\nབདག་ནི་རང་དོན་ཤེས་གྱུར་ན། །\nདེ་ལ་རང་དོན་ཅི་ཞིག་ཡོད། །\nཡིད་བདེ་འབའ་ཞིག་འདོད་ན་ནི། །\nརྒྱན་སོགས་ཆང་ཡང་བསྟེན་དགོས་སོ། །\nགྲགས་པའི་དོན་དུ་ནོར་ཤོར་ཅིང་། །\nབདག་ཉིད་ཀྱང་ནི་གསོད་བྱེད་ན། །\nཚིག་འབྲུ་རྣམས་ཀྱིས་ཅི་ཞིག་བྱ། །\nཤ་ནི་དེས་ཀོ་སུ་ལ་བདེ། །\nབྱེ་མའི་ཁང་བུ་རྡིབ་གྱུར་ན། །\nབྱིས་པ་རྣམས་ནི་ག་ཆད་དུ། །\nདེ་བཞིན་བསྟོད་དང་གྲགས་ཉམས་ན། །\nརང་གི་སེམས་ནི་བྱིས་པ་བཞིན། །\nརེ་ཞིག་སྒྲ་ལ་སེམས་མེད་ཕྱིར། །\nབདག་ལ་བསྟོད་སེམས་ཡོད་མི་སྲིད། །\nབདག་ལ་གཞན་དགའ་ཞེས་གྲགས་པ། །\nདེ་ནི་དགའ་བའི་རྒྱུ་ཡིན་གྲང་། །\nགཞན་ནམ་ཡང་ན་བདག་ལའང་རུང་། །\nགཞན་དགའ་བདག་ལ་ཅི་ཞིག་ཕན། །\nདགའ་བདེ་དེ་ནི་དེ་ཉིད་ཀྱི། །\nབདག་གིས་དེ་ལས་ཤས་མི་འཐོབ། །\nདེ་བདེ་བ་ཡི་བདག་བདེ་ན། །\nཀུན་ལའང་དེ་བཞིན་བྱ་དགོས་ན། །\nཇི་ལྟར་གཞན་ལ་དགའ་བ་ཡིས། །\nབདེ་བར་གྱུར་ན་བདག་མི་བདེ། །\nདེ་བས་བདག་ནི་བསྟོད་དོ་ཞེས། །\nརང་གི་དགའ་བ་སྐྱེ་འགྱུར་བ། །\nདེ་ཡང་དེ་ལྟར་མི་འཐད་པས། །\nབྱིས་པའི་སྤྱོད་པ་ཁོ་ནར་ཟད། །\nབསྟོད་སོགས་བདག་ནི་གཡེང་བར་བྱེད། །\nདེས་ནི་སྐྱོ་བའང་འཇིག་པར་བྱེད། །\nཡོན་ཏན་ལྡན་ལ་ཕྲག་དོག་དང་། །\nཕུན་སུམ་ཚོགས་པའང་འཇིག་པར་བྱེད། །\nདེ་ཕྱིར་བདག་གི་བསྟོད་སོགས་ནི། །\nགཞིག་ཕྱིར་གང་དག་ཉེར་གནས་པ། །\nདེ་དག་བདག་ནི་ངན་སོང་དུ། །\nལྟུང་བ་བསྲུང་ཕྱིར་ཞུགས་མིན་ནམ། །\nབདག་ནི་གྲོལ་བ་དོན་གཉེར་ལ། །\nརྙེད་དང་བཀུར་སྟི་འཆིང་མི་དགོས། །\nགང་དག་བདག་བཅིངས་གྲོལ་བྱེད་པ། །\nདེ་ལ་བདག་ནི་ཇི་ལྟར་ཁྲོ། །\nབདག་ནི་སྡུག་བསྔལ་འཇུག་འདོད་ལ། །\nསངས་རྒྱས་ཀྱིས་ནི་བྱིན་བརླབས་བཞིན། །\nམི་གཏོང་སྒོ་འཕར་ཉིད་གྱུར་པ། །\nདེ་ལ་བདག་ནི་ཇི་ལྟར་ཁྲོ། །\nའདི་ནི་བསོད་ནམས་གེགས་བྱེད་ཅེས། །\nདེ་ལའང་ཁྲོ་བར་རིགས་མིན་ཏེ། །\nབཟོད་མཚུངས་དཀའ་ཐུབ་ཡོད་མིན་ན། །\nདེ་ལ་བདག་ནི་མི་གནས་སམ། །\nགལ་ཏེ་བདག་ནི་རང་སྐྱོན་གྱིས། །\nའདི་ལ་བཟོད་པ་མི་བྱེད་ན། །\nབསོད་ནམས་རྒྱུ་ནི་ཉེར་གནས་པ། །\nའདི་ལ་བདག་གེགས་བྱེད་པར་ཟད། །\nགང་ཞིག་གང་མེད་མི་འབྱུང་ལ། །\nགང་ཞིག་ཡོད་ན་ཡོད་གྱུར་པ། །\nདེ་ཉིད་དེ་ཡི་རྒྱུ་ཡིན་ན། །\nཇི་ལྟར་དེ་ལ་གེགས་ཞེས་བྱ། །\nདུས་སུ་ཕྱིན་པའི་སློང་མོ་བས། །\nསྦྱིན་པའི་གེགས་བྱས་ཡོད་མ་ཡིན། །\nརབ་ཏུ་འབྱིན་པར་བྱེད་གྱུར་པ། །\nརབ་བྱུང་གེགས་ཞེས་བྱར་མི་རུང་། །\nའཇིག་རྟེན་ན་ནི་སློང་བ་མོད། །\nགནོད་པ་བྱེད་པ་དཀོན་པ་སྟེ། །\nའདི་ལྟར་ཕར་གནོད་མ་བྱས་ན། །\nའགའ་ཡང་གནོད་པ་མི་བྱེད་དོ། །\nདེ་བས་ངལ་བས་མ་བསྒྲུབས་པའི། །\nཁྱིམ་དུ་གཏེར་ནི་བྱུང་བ་ལྟར། །\nབྱང་ཆུབ་སྤྱོད་པའི་གྲོགས་གྱུར་པས། །\nབདག་གིས་དགྲ་ལ་དགའ་བར་བྱ། །\nའདི་དང་བདག་གིས་བསྒྲུབས་པས་ན། །\nདེ་ཕྱིར་བཟོད་པའི་འབྲས་བུ་ནི། །\nའདི་ལ་ཐོག་མར་བདར་འོས་ཏེ། །\nའདི་ལྟར་དེ་ནི་བཟོད་པའི་རྒྱུ། །\nགལ་ཏེ་བཟོད་བསྒྲུབ་བསམ་མེད་པས། །\nདགྲ་འདི་མཆོད་བྱ་མིན་ཞེ་ན། །\nགྲུབ་པ་ཡི་ནི་རྒྱུར་རུང་བ། །\nདམ་པའི་ཆོས་ཀྱང་ཅི་སྟེ་མཆོད། །\nགལ་ཏེ་དགྲ་འདི་གནོད་བྱ་བའི། །\nབསམ་ཡོད་མཆོད་བྱ་མིན་ཞེ་ན། །\nསྨན་པ་བཞིན་དུ་ཕན་བརྩོན་ན། །\nབདག་གི་བཟོད་པ་ཇི་ལྟར་འགྲུབ། །\nདེ་བས་རབ་ཏུ་སྡང་སེམས་ལ། །\nབརྟེན་ནས་བཟོད་པ་སྐྱེ་བས་ན། །\nདེ་ཉིད་བཟོད་པའི་རྒྱུ་ཡིན་པས། །\nདམ་པའི་ཆོས་བཞིན་མཆོད་པར་འོས། །",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "level": "section-6.3",
        "title": "སེམས་ཅན་ལ་གུས་པར་བྱ་བ།",
        "lines_span": "445-548",
        "children": [
          {
            "level": "subsection-6.3.1",
            "title": "བསོད་ནམས་ཀྱི་ཞིང་དུ་བསམ་སྟེ་སེམས་ཅན་ལ་གུས་པར་བྱ་བ།",
            "lines_span": "445-472",
            "line_text_excerpt": "དེ་ཕྱིར་སེམས་ཅན་ཞིང་དང་ནི། །\nརྒྱལ་བའི་ཞིང་ཞེས་ཐུབ་པས་གསུངས། །\nའདི་དག་མགུ་བྱས་མང་པོ་ཞིག །\nའདི་ལྟར་ཕུན་ཚོགས་ཕ་རོལ་ཕྱིན། །\nསེམས་ཅན་རྣམས་དང་རྒྱལ་བ་ལས། །\nསངས་རྒྱས་ཆོས་འགྲུབ་འདྲ་བ་ལ། །\nརྒྱལ་ལ་གུས་བྱ་དེ་བཞིན་དུ། །\nསེམས་ཅན་ལ་མིན་ཅི་ཡི་ཚུལ། །\nབསམ་པའི་ཡོན་ཏན་རང་གིས་མིན། །\nའབྲས་བུ་ལས་ཡིན་དེས་མཚུངས་པར། །\nསེམས་ཅན་རྣམས་ལའང་ཡོན་ཏན་ཡོད། །\nདེ་ཕྱིར་དེ་དག་མཉམ་པ་ཡིན། །\nབྱམས་སེམས་ལྡན་ལ་མཆོད་པ་གང་། །\nདེ་ནི་སེམས་ཅན་ཆེ་བ་ཉིད། །\nསངས་རྒྱས་དད་པའི་བསོད་ནམས་གང་། །\nདེ་ཡང་སངས་རྒྱས་ཆེ་བ་ཉིད། །\nསངས་རྒྱས་ཆོས་འགྲུབ་ཆ་ཡོད་པ། །\nདེས་ན་དེ་དག་མཉམ་པར་འདོད། །\nཡོན་ཏན་རྒྱ་མཚོ་མཐའ་ཡས་པའི། །\nསངས་རྒྱས་རྣམས་དང་འགའ་མི་མཉམ། །\nཡོན་ཏན་མཆོག་ཚོགས་གཅིག་པུ་ཡི། །\nཡོན་ཏན་ཤས་ཙམ་འགའ་ཞིག་ལ། །\nསྣང་ནའང་དེ་ལ་མཆོད་དོན་དུ། །\nཁམས་གསུམ་ཕུལ་ཡང་ཆུང་བར་འགྱུར། །\nསངས་རྒྱས་ཆོས་མཆོག་སྐྱེ་བའི་ཤས། །\nསེམས་ཅན་རྣམས་ལ་ཡོད་པས་ན། །\nའདི་ཙམ་དག་གིས་ཆ་བསྟུན་ནས། །\nསེམས་ཅན་མཆོད་བྱར་རིགས་པར་འགྱུར། །",
            "children": []
          },
          {
            "level": "subsection-6.3.2",
            "title": "རྒྱལ་བ་དགྱེས་པ་ལ་བསམ་སྟེ་སེམས་ཅན་ལ་གུས་པར་བྱ་བ།",
            "lines_span": "473-516",
            "line_text_excerpt": "གཞན་ཡང་གཡོ་མེད་གཉེན་གྱུར་ཅིང་། །\nཕན་པ་དཔག་མེད་མཛད་རྣམས་ལ། །\nསེམས་ཅན་མགུ་བྱ་མ་གཏོགས་པར། །\nགཞན་གང་ཞིག་གིས་ལན་ལོན་འགྱུར། །\nགང་ཕྱིར་སྐུ་གཏོང་མནར་མེད་འཇུག་པ་ལ། །\nདེ་ལ་ཕན་བཏགས་ལན་ལོན་འགྱུར་བས་ན། །\nདེ་བས་འདི་དག་གནོད་ཆེན་བྱེད་ན་ཡང་། །\nཐམས་ཅད་བཟང་དགུ་ཞིག་ཏུ་སྤྱད་པར་བྱ། །\nརེ་ཞིག་བདག་གི་རྗེར་གྱུར་ཉིད་ཀྱང་ནི། །\nགང་ཕྱིར་རང་གི་སྐུ་ལའང་མི་གཟིགས་པ། །\nདེ་ལ་རྨོངས་པ་བདག་གིས་ཇི་ལྟར་ན། །\nང་རྒྱལ་བྱ་ཞིང་བྲན་གྱི་དངོས་མི་བྱ། །\nགང་དག་བདེ་བས་ཐུབ་རྣམས་དགྱེས་འགྱུར་ཞིང་། །\nགང་ལ་གནོད་ན་མི་དགྱེས་འབྱུང་འགྱུར་བ། །\nདེ་དག་དགའ་བས་ཐུབ་པ་ཀུན་དགྱེས་ཤིང་། །\nདེ་ལ་གནོད་བྱས་ཐུབ་ལ་གནོད་པ་བྱས། །\nཇི་ལྟར་ལུས་ལ་ཀུན་ནས་མེ་འབར་བ། །\nའདོད་པ་ཀུན་གྱིས་ཡིད་བདེར་མི་འགྱུར་བ། །\nདེ་བཞིན་སེམས་ཅན་གནོད་པ་བྱས་ན་ཡང་། །\nཐུགས་རྗེ་ཆེ་རྣམས་དགྱེས་པའི་ཐབས་མེད་དོ། །\nདེ་བས་བདག་གིས་འགྲོ་ལ་གནོད་བྱས་པས། །\nཐུགས་རྗེ་ཆེ་ཀུན་མི་དགྱེས་གྱུར་པ་གང་། །\nསྡིག་དེ་དེ་རིང་སོ་སོར་བཤགས་བགྱི་ཡིས། །\nམི་དགྱེས་གང་ལགས་དེ་ཐུབ་བཟོད་པར་གསོལ། །\nདེ་བཞིན་གཤེགས་རྣམས་དགྱེས་པར་བགྱི་སླད་དུ། །\nདེང་ནས་བཟུང་ནས་འཇིག་རྟེན་བྲན་དུ་མཆི། །\nའགྲོ་མང་རྡོག་པས་བདག་གི་སྤྱིར་འཚོག་གམ། །\nའགུམས་ཀྱང་མི་བསྡོ་འཇིག་རྟེན་མགོན་དགྱེས་མཛོད། །\nའགྲོ་བ་འདི་ཀུན་ཐུགས་རྗེའི་བདག་ཅན་དེས། །\nབདག་ཏུ་མཛད་པ་འདི་ལ་ཐེ་ཚོམ་མེད། །\nསེམས་ཅན་ངོ་བོར་མཐོང་བ་འདི་དག་ཉིད། །\nམགོན་དེ་བདག་ཉིད་ཅི་ཕྱིར་གུས་མི་བྱེད། །\nའདི་ཉིད་དེ་བཞིན་གཤེགས་པ་མཉེས་བྱེད་ཡིན། །\nརང་དོན་ཡང་དག་སྒྲུབ་པའང་འདི་ཉིད་དོ། །\nའཇིག་རྟེན་སྡུག་བསྔལ་སེལ་བའང་འདི་ཉིད་དེ། །\nདེ་ལྟས་བདག་གིས་རྟག་ཏུ་དེ་ཉིད་བྱ། །",
            "children": []
          },
          {
            "level": "subsection-6.3.3",
            "title": "ཕན་གནོད་ཀྱི་འབྲས་བུ་ལ་བསམ་སྟེ་སེམས་ཅན་ལ་གུས་པར་བྱ་བ།",
            "lines_span": "517-548",
            "line_text_excerpt": "དཔེར་ན་རྒྱལ་པོའི་མི་འགའ་ཞིག །\nསྐྱེ་བོ་མང་ལ་གནོད་བྱེད་ཀྱང་། །\nསྐྱེ་བོ་མིག་རྒྱང་རིང་པོ་དག །\nནུས་ཀྱང་ཕྱིར་གནོད་མི་བྱེད་དེ། །\nའདི་ལྟར་དེ་གཅིག་མ་ཡིན་གྱི། །\nརྒྱལ་པོའི་མཐུ་སྟོབས་དེ་ཡི་མཐུ། །\nདེ་བཞིན་གནོད་བྱེད་ཉམ་ཆུང་བ། །\nའགའ་ཡང་ཁྱད་དུ་གསད་མི་བྱ། །\nའདི་ལྟར་དམྱལ་བའི་སྲུང་མ་དང་། །\nཐུགས་རྗེ་ལྡན་རྣམས་དེ་ཡི་དཔུང་། །\nདེ་ལྟར་དམངས་ཀྱིས་རྒྱལ་གཏུམ་བཞིན། །\nསེམས་ཅན་རྣམས་ནི་མགུ་བར་བྱ། །\nརྒྱལ་པོ་ལྟ་ཞིག་ཁྲོས་ན་ཡང་། །\nསེམས་ཅན་མི་མགུ་བྱས་པ་ཡིས། །\nམྱོང་བར་འགྱུར་བ་གང་ཡིན་པ། །\nདམྱལ་བའི་གནོད་པ་དེས་བྱེད་དམ། །\nརྒྱལ་པོ་ལྟ་ཞིག་མགུ་ན་ཡང་། །\nསེམས་ཅན་མགུ་བར་བྱས་པ་ཡིས། །\nའཐོབ་པར་འགྱུར་བ་གང་ཡིན་པ། །\nསངས་རྒྱས་ཉིད་སྦྱིན་མི་སྲིད་དོ། །\nསེམས་ཅན་མགུ་ལས་བྱུང་བ་ཡི། །\nམ་འོངས་སངས་རྒྱས་འགྲུབ་ལྟ་ཞོག །\nཚེ་འདི་ཉིད་ལ་དཔལ་ཆེན་དང་། །\nགྲགས་དང་སྐྱིད་འགྱུར་ཅིས་མ་མཐོང་། །\nའཁོར་ཚེ་བཟོད་པས་མཛེས་སོགས་དང་། །\nནད་མེད་པ་དང་གྲགས་པ་ཡིས། །\nཤིན་ཏུ་ཡུན་རིང་འཚོ་བ་དང་། །\nའཁོར་ལོས་སྒྱུར་བའི་བདེ་རྒྱས་ཐོབ། །",
            "children": []
          }
        ]
      },
      {
        "level": "section-6.4",
        "title": "ལེའུའི་མཚན།",
        "lines_span": "549-550",
        "line_text_excerpt": "བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་ལས། བཟོད་པ་བསྟན་པ་ཞེས་བྱ་བ་སྟེ་ལེའུ་དྲུག་པའོ།། །།",
        "children": []
      }
    ]
  }
]