[
  {
    "level": "chapter-5",
    "title": "ཤེས་བཞིན་བསྲུང་བར་བྱ་བ་སྟེ་ལེའུ་ལྔ་པ།",
    "lines_span": "1-456",
    "children": [
      {
        "level": "section-5.1",
        "title": "བསླབ་པ་བསྲུང་བའི་ཆེད་དུ་སེམས་བསྲུང་བ།",
        "lines_span": "1-92",
        "children": [
          {
            "level": "subsection-5.1.1",
            "title": "མདོར་བསྟན་པ།",
            "lines_span": "1-4",
            "line_text_excerpt": "བསླབ་པ་བསྲུང་བར་འདོད་པ་ཡིས། །\nརབ་ཏུ་བསྒྲིམས་ནས་སེམས་བསྲུང་སྟེ། །\nསེམས་འདི་བསྲུང་བར་མ་བྱས་ན། །\nབསླབ་པ་བསྲུང་བར་ཡོང་མི་ནུས། །",
            "children": []
          },
          {
            "level": "subsection-5.1.2",
            "title": "རྒྱས་བཤད།",
            "lines_span": "5-92",
            "children": [
              {
                "level": "subsubsection-5.1.2.1",
                "title": "གནོད་པ་ཐམས་ཅད་སེམས་ལས་བྱུང་ཚུལ།",
                "lines_span": "5-36",
                "line_text_excerpt": "སེམས་ཀྱི་གླང་པོ་ཡན་བཏང་བས། །\nམནར་མེད་གནོད་པ་བྱེད་པ་ལྟར། །\nགླང་ཆེན་མ་ཐུལ་མྱོས་པ་ཡིས། །\nའདི་ན་དེ་འདྲའི་གནོད་མི་བྱེད། །\nཀུན་ནས་དྲན་པའི་ཐག་པ་ཡིས། །\nསེམས་ཀྱི་གླང་པོ་དམ་བཏགས་ན། །\nའཇིགས་པ་ཐམས་ཅད་མེད་འགྱུར་ཞིང་། །\nདགེ་བ་ཐམས་ཅད་ལག་ཏུ་འོང་། །\nསྟག་དང་སེང་གེ་གླང་ཆེན་དྲེད། །\nསྦྲུལ་དང་དགྲ་རྣམས་ཐམས་ཅད་དང་། །\nསེམས་ཅན་དམྱལ་བའི་སྲུང་མ་དང་། །\nབྱད་མ་དེ་བཞིན་སྲིན་པོ་རྣམས། །\nསེམས་འདི་གཅིག་པུ་བཏགས་པ་ཡིས། །\nདེ་དག་ཐམས་ཅད་བཏགས་པར་འགྱུར། །\nསེམས་འདི་གཅིག་པུ་བཏུལ་བས་ན། །\nདེ་དག་ཐམས་ཅད་ཐུལ་བར་འགྱུར། །\nའདི་ལྟར་འཇིགས་པ་ཐམས་ཅད་དང་། །\nསྡུག་བསྔལ་དཔག་ཏུ་མེད་པ་ཡང་། །\nསེམས་ལས་བྱུང་བ་ཡིན་ནོ་ཞེས། །\nཡང་དག་གསུང་བ་ཉིད་ཀྱིས་བསྟན། །\nསེམས་ཅན་དམྱལ་བའི་མཚོན་ཆ་རྣམས། །\nསུ་ཞིག་གིས་ནི་ཆེད་དུ་བྱས། །\nལྕགས་སྲེག་ས་གཞི་སུ་ཡིས་བྱས། །\nམེ་ཚོགས་དེ་དག་ཅི་ལས་བྱུང་། །\nདེ་འདྲ་དེ་དག་ཐམས་ཅད་ཀྱང་། །\nསྡིག་སེམས་ཡིན་པར་ཐུབ་པས་གསུངས། །\nདེ་ལྟར་འཇིག་རྟེན་གསུམ་པོ་ན། །\nསེམས་ལས་འཇིགས་པ་གཞན་འགའ་མེད། །",
                "children": []
              },
              {
                "level": "subsubsection-5.1.2.2",
                "title": "དགེ་བ་ཐམས་ཅད་སེམས་ལས་བྱུང་ཚུལ།",
                "lines_span": "37-72",
                "line_text_excerpt": "གལ་ཏེ་འགྲོ་བ་དབུལ་བོར་ནས། །\nསྦྱིན་པའི་ཕ་རོལ་ཕྱིན་ཡིན་ན། །\nད་རུང་འགྲོ་བཀྲེན་ཡོད་ན་སྔོན། །\nསྐྱོབ་པ་ཇི་ལྟར་ཕ་རོལ་ཕྱིན། །\nབདོག་པ་ཐམས་ཅད་འབྲས་བཅས་ཏེ། །\nསྐྱེ་བོ་ཀུན་ལ་བཏང་སེམས་ཀྱིས། །\nསྦྱིན་པའི་ཕ་རོལ་ཕྱིན་གསུངས་ཏེ། །\nདེ་ལྟས་དེ་ནི་སེམས་ཉིད་དོ། །\nཉ་ལ་སོགས་པ་གང་ཞིག་ཏུ། །\nདེ་དག་གསོད་མི་འགྱུར་བར་བསྐྲད། །\nསྤོང་བའི་སེམས་ནི་ཐོབ་པ་ལས། །\nཚུལ་ཁྲིམས་ཕ་རོལ་ཕྱིན་པར་བཤད། །\nསེམས་ཅན་མི་སྲུན་ནམ་མཁའ་བཞིན། །\nདེ་དག་གཞོམ་གྱིས་ཡོང་མི་ལང་། །\nཁྲོ་བའི་སེམས་འདི་གཅིག་བཅོམ་ན། །\nདགྲ་དེ་ཐམས་ཅད་ཆོམས་དང་འདྲ། །\nས་སྟེང་འདི་དག་ཀོས་གཡོག་ཏུ། །\nདེ་སྙེད་ཀོ་བས་ག་ལ་ལང་། །\nལྷམ་མཐིལ་ཙམ་གྱི་ཀོ་བས་ནི། །\nས་སྟེང་ཐམས་ཅད་གཡོགས་དང་འདྲ། །\nདེ་བཞིན་ཕྱི་རོལ་དངོས་པོ་ཡང་། །\nབདག་གིས་ཕྱིར་བཟློག་མི་ལང་གི །\nབདག་གི་སེམས་འདི་ཕྱིར་བཟློག་བྱའི། །\nགཞན་རྣམས་བཟློག་གོ་ཅི་ཞིག་དགོས། །\nསེམས་གསལ་གཅིག་བསྐྱེད་འབྲས་བུ་གང་། །\nཚངས་ལ་སོགས་པ་ཡིན་པ་ལྟར། །\nལུས་ངག་བཅས་པའི་འབྲས་བུ་ཡང་། །\nསྤྱོད་པ་ཞན་པས་དེ་ལྟ་མིན། །\nབཟླས་བརྗོད་དང་ནི་དཀའ་ཐུབ་ཀུན། །\nཡུན་རིང་དུས་སུ་སྤྱད་བྱས་ཀྱང་། །\nསེམས་གཞན་གཡེངས་པས་བྱས་པ་ནི། །\nདེ་ཉིད་རིག་པས་དོན་མེད་གསུངས། །\nགང་གིས་ཆོས་ཀྱི་གཙོ་བོ་མཆོག །\nསེམས་ཀྱི་གསང་འདི་མ་ཤེས་ན། །\nབདེ་ཐོབ་སྡུག་བསྔལ་གཞོམ་འདོད་ཀྱང་། །\nདེ་དག་དོན་མེད་གྱི་ནར་འཁྱམ། །",
                "children": []
              },
              {
                "level": "subsubsection-5.1.2.3",
                "title": "དེས་ན་ངེས་པར་སེམས་བསྲུང་དགོས་པར་གདམས་པ།",
                "lines_span": "73-92",
                "line_text_excerpt": "དེ་ལྟས་བདག་གི་སེམས་འདི་ནི། །\nལེགས་གཟུང་ལེགས་པར་བསྲུང་བར་བྱ། །\nསེམས་བསྲུང་བརྟུལ་ཞུགས་མ་གཏོགས་པ། །\nབརྟུལ་ཞུགས་མང་པོས་ཅི་ཞིག་བྱ། །\nམ་གྲངས་དྲོལ་བའི་ཁྲོད་གནས་ན། །\nསྒྲིམས་ཏེ་རྨ་ཡི་བག་བྱེད་བཞིན། །\nསྐྱེ་བོ་ངན་ཁྲོད་གནས་པས་ཀྱང་། །\nསེམས་ཀྱི་རྨ་འདི་རྟག་ཏུ་བསྲུང་། །\nརྨ་ཡི་སྡུག་བསྔལ་ཆུང་ངུ་ཡིས། །\nསྐྲག་པའང་རྨ་ཡི་བག་བྱེད་ན། །\nབསྡུས་འཇོམས་རིས་འཇོམས་སྐྲག་པ་དག །\nསེམས་ཀྱི་རྨ་ལྟ་ཅིས་མི་སྲུང་། །\nསྤྱོད་པ་འདི་འདྲས་གནས་བྱེད་ན། །\nསྐྱེ་བོ་ངན་པའི་ཁྲོད་གནས་སམ། །\nབུད་མེད་ཁྲོད་ན་གནས་ཀྱང་རུང་། །\nསྡོམ་བརྩོན་བརྟན་པ་ཉམས་མི་འགྱུར། །\nབདག་གི་རྙེད་དང་བཀུར་སྟི་དང་། །\nལུས་དང་འཚོ་བ་མེད་བླ་ཞིང་། །\nདགེ་བ་གཞན་ཡང་ཉམས་བླ་ཡི། །\nསེམས་ནི་ནམས་ཀྱང་ཉམས་མི་བྱ། །",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "level": "section-5.2",
        "title": "སེམས་བསྲུང་བའི་ཆེད་དུ་དྲན་ཤེས་བརྟེན་ཚུལ།",
        "lines_span": "93-136",
        "children": [
          {
            "level": "subsection-5.2.1",
            "title": "མདོར་བསྟན་པ།",
            "lines_span": "93-96",
            "line_text_excerpt": "སེམས་བསྲུང་འདོད་པ་རྣམས་ལ་ནི། །\nདྲན་པ་དང་ནི་ཤེས་བཞིན་དག །\nཐམས་ཅད་འབད་པས་སྲུངས་ཤིག་ཅེས། །\nབདག་ནི་དེ་ལྟར་ཐལ་མོ་སྦྱོར། །",
            "children": []
          },
          {
            "level": "subsection-5.2.2",
            "title": "རྒྱས་བཤད།",
            "lines_span": "97-136",
            "children": [
              {
                "level": "subsubsection-5.2.2.1",
                "title": "ཤེས་བཞིན་མེད་པའི་ཉེས་དམིགས།",
                "lines_span": "97-116",
                "line_text_excerpt": "ནད་ཀྱིས་དཀྲུགས་པའི་མི་དག་ནི། །\nལས་རྣམས་ཀུན་ལ་མཐུ་མེད་པ། །\nདེ་བཞིན་རྨོངས་པས་སེམས་དཀྲུགས་པ། །\nལས་རྣམས་ཀུན་ལ་མཐུ་མེད་དོ། །\nཤེས་བཞིན་མེད་པའི་སེམས་ལྡན་པའི། །\nཐོས་དང་བསམས་དང་བསྒོམས་པ་ཡང་། །\nགློ་རྡོལ་བུམ་པའི་ཆུ་བཞིན་དུ། །\nདྲན་པ་ལ་ནི་དེ་མི་གནས། །\nཐོས་ལྡན་དད་པ་ཅན་དང་ནི། །\nབརྩོན་པ་ལྷུར་ལེན་དུ་མ་ཡང་། །\nཤེས་བཞིན་མེད་པའི་སྐྱོན་ཆགས་པས། །\nལྟུང་བའི་རྙོག་དང་བཅས་པར་འགྱུར། །\nཤེས་བཞིན་མེད་པའི་ཆོམ་རྐུན་དག །\nདྲན་པ་ཉམས་པའི་རྗེས་འབྲང་བས། །\nབསོད་ནམས་དག་ནི་ཉེར་བསགས་ཀྱང་། །\nརྐུན་པོས་ཕྲོགས་བཞིན་ངན་འགྲོར་འགྲོ། །\nཉོན་མོངས་ཆོམ་རྐུན་ཚོགས་འདི་ནི། །\nགླགས་སྐབས་ཚོལ་བར་བྱེད་པ་སྟེ། །\nགླགས་རྙེད་གྱུར་ནས་དགེ་འཕྲོག་ཅིང་། །\nབདེ་འགྲོའི་སྲོག་ཀྱང་འཇོམས་པར་བྱེད། །",
                "children": []
              },
              {
                "level": "subsubsection-5.2.2.2",
                "title": "དྲན་པ་བསྟེན་ཐབས་དངོས་།",
                "lines_span": "117-136",
                "line_text_excerpt": "དེ་བས་དྲན་པ་ཡིད་སྒོ་ནས། །\nགུད་དུ་ནམ་ཡང་མི་གཏོང་ངོ་། །\nསོང་ནའང་ངན་འགྲོ་གནོད་པ་དག །\nདྲན་པར་བྱས་ཏེ་ཉེ་བར་བཞག །\nབླ་མ་དང་ནི་འགྲོགས་པ་ལས། །\nམཁན་པོས་རྗེས་སུ་བསྟན་པ་དང་། །\nའཇིགས་པས་སྐལ་ལྡན་གུས་བྱེད་ལ། །\nདྲན་པ་བདེ་བླག་ཉིད་དུ་སྐྱེ། །\nསངས་རྒྱས་བྱང་ཆུབ་སེམས་དཔའ་དག །\nཀུན་དུ་ཐོགས་མེད་གཟིགས་པར་ལྡན། །\nདེ་དག་ཐམས་ཅད་སྤྱན་སྔ་ན། །\nརྟག་པར་བདག་ནི་གནས་སོ་ཞེས། །\nདེ་ལྟར་བསམས་ནས་ངོ་ཚ་དང་། །\nགུས་དང་འཇིགས་ལྡན་དེ་བཞིན་གནོས། །\nདེས་ན་སངས་རྒྱས་རྗེས་དྲན་པའང་། །\nདེ་ལ་ཡང་དང་ཡང་དུ་འབྱུང་། །\nགང་ཚེ་དྲན་པ་ཡིད་སྒོ་ནས། །\nབསྲུང་བའི་དོན་དུ་གནས་གྱུར་པ། །\nདེ་ཚེ་ཤེས་བཞིན་འོང་འགྱུར་ཞིང་། །\nསོང་བ་དག་ཀྱང་འོང་བར་འགྱུར། །",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "level": "section-5.3",
        "title": "དྲན་ཤེས་དང་ལྡན་པའི་སྒོ་ནས་བློ་སྦྱོང་གི་སྤྱོད་པ་ལ་བསླབ་ཚུལ།",
        "lines_span": "137-404",
        "children": [
          {
            "level": "subsection-5.3.1",
            "title": "ཉེས་སྤྱོད་སྡོམ་པའི་ཚུལ་ཁྲིམས།",
            "lines_span": "137-240",
            "children": [
              {
                "level": "subsubsection-5.3.1.1",
                "title": "སྒོ་གསུམ་གྱི་སྤྱོད་པ་ཐམས་ཅད་དག་པར་བྱ་བ།",
                "lines_span": "137-180",
                "line_text_excerpt": "རེ་ཞིག་དང་པོ་འདི་འདྲའི་སེམས། །\nའདི་ནི་སྐྱོན་བཅས་ཤེས་བྱས་ནས། །\nདེ་ཚེ་བདག་གིས་ཤིང་བཞིན་དུ། །\nཟུངས་ཐུབ་པར་ནི་གནས་པར་བྱ། །\nདོན་མེད་གཡེང་བར་ལྟ་བ་ནི། །\nནམ་ཡང་བདག་གིས་མི་བྱ་སྟེ། །\nངེས་པར་སེམས་པས་རྟག་ཏུ་ནི། །\nམིག་ནི་ཕབ་སྟེ་བལྟ་བར་བྱ། །\nལྟ་བ་ངལ་བསོའི་ཆེད་དུ་ནི། །\nརེས་འགའ་ཕྱོགས་སུ་བལྟ་བར་བྱ། །\nའགའ་ཞིག་མིག་ལམ་སྣང་གྱུར་ན། །\nབལྟས་ནས་འོངས་པ་ལེགས་ཞེས་བརྗོད། །\nལམ་སོགས་འཇིགས་པ་བརྟག་པའི་ཕྱིར། །\nཡང་དང་ཡང་དུ་ཕྱོགས་བཞིར་བལྟ། །\nངལ་བསོས་ཁ་ནི་ཕྱིར་བལྟས་ནས། །\nརྒྱབ་ཀྱི་ཕྱོགས་སུ་བལྟ་བར་བྱ། །\nམདུན་དང་རྒྱབ་ཏུ་བརྟག་བྱས་ནས། །\nའགྲོའམ་ཡང་ན་འོང་བྱ་སྟེ། །\nདེ་ལྟར་གནས་སྐབས་ཐམས་ཅད་དུ། །\nདགོས་པ་ཤེས་ནས་སྤྱད་པར་བྱ། །\nལུས་ཀྱིས་འདི་ལྟར་གནས་བྱ་ཞེས། །\nབྱ་བ་བསྡོགས་ནས་དེ་ནས་ནི། །\nསྐབས་སུ་ལུས་འདི་ཇི་ལྟ་བུར། །\nགནས་པ་ཡིན་ཞེས་བལྟ་བར་བྱ། །\nསེམས་ཀྱི་གླང་ཆེན་མྱོས་པ་ནི། །\nཆོས་ལ་སེམས་པའི་ཀ་ཆེན་ལ། །\nཇི་ལྟར་བཏགས་པ་མི་འཆོར་བར། །\nདེ་ལྟར་འབད་པ་ཀུན་གྱིས་བརྟག །\nཅི་ནས་ཏིང་འཛིན་བརྩོན་པ་ནི། །\nསྐད་ཅིག་གཅིག་ཀྱང་མི་འཆོར་བར། །\nབདག་གི་ཡིད་འདི་གར་སྤྱོད་ཅེས། །\nདེ་ལྟར་ཡིད་ལ་སོ་སོར་བརྟག །\nའཇིགས་དང་དགའ་སྟོན་སོགས་འབྲེལ་བར། །\nགལ་ཏེ་མི་ནུས་ཅི་བདེར་བྱ། །\nའདི་ལྟར་སྦྱིན་པའི་དུས་དག་ཏུ། །\nཚུལ་ཁྲིམས་བཏང་སྙོམས་བྱ་བར་གསུངས། །\nགང་ཞིག་བསམས་ཏེ་བྱར་བརྩམས་པ། །\nདེ་ལས་གཞན་དུ་མི་བསམ་སྟེ། །\nདེར་གཏད་པ་ཡི་བསམ་པ་ཡིས། །\nདེ་ཉིད་རེ་ཞིག་བསྒྲུབ་པར་བྱ། །\nདེ་ལྟ་ན་ནི་ཀུན་ལེགས་བྱས། །\nགཞན་དུ་གཉིས་ཀར་མི་འགྱུར་རོ། །\nཤེས་བཞིན་མ་ཡིན་ཉེ་ཉོན་མོངས། །\nདེ་ལྟ་ན་ནི་འཕེལ་མི་འགྱུར། །",
                "children": []
              },
              {
                "level": "subsubsection-5.3.1.2",
                "title": "བསླབ་པ་མི་ཉམས་པར་བསྲུང་བ།",
                "lines_span": "181-224",
                "line_text_excerpt": "བྲེ་མོའི་གཏམ་ནི་སྣ་ཚོགས་དང་། །\nངོ་མཚར་ལྟད་མོ་རྣམ་མང་པོ། །\nཀུན་ལ་འཇུག་པར་གྱུར་པ་ན། །\nདེ་ལ་ཆགས་པ་སྤང་བར་བྱ། །\nདོན་མེད་ས་རྐོ་རྩྭ་གཅོད་དང་། །\nས་རིས་འདྲི་སོགས་བྱེད་གྱུར་ན། །\nབདེ་གཤེགས་བསླབ་པ་དྲན་བྱས་ནས། །\nསྐྲག་པས་དེ་ཡི་མོད་ལ་དོར། །\nགང་ཚེ་བསྐྱོད་པར་འདོད་གྱུར་ཏམ། །\nསྨྲ་བར་འདོད་པར་གྱུར་ན་ཡང་། །\nདང་པོར་རང་གི་སེམས་བརྟགས་ནས། །\nབརྟན་པས་རིག་པ་ལྡན་པར་བྱ། །\nགང་ཚེ་རང་ཡིད་ཆགས་པ་དང་། །\nཁྲོ་བར་འདོད་པ་དེ་ཡི་ཚེ། །\nལས་སུ་མི་བྱ་སྨྲ་མི་བྱ། །\nཤིང་བཞིན་དུ་ནི་གནས་པར་བྱ། །\nརྒོད་དང་ག་ཞར་བཅས་པའམ། །\nགལ་ཏེ་ང་རྒྱལ་རྒྱགས་ལྡན་པའམ། །\nམཚང་འབྲུ་བ་ཡི་བསམ་པ་དང་། །\nགལ་ཏེ་སྐྱོར་འབྱིན་སླུ་སེམས་སམ། །\nགང་ཚེ་བདག་བསྟོད་ལྷུར་ལེན་པའམ། །\nགཞན་ལ་སྨོད་པ་ཉིད་དང་ནི། །\nགཤེ་བཅས་འགྱོད་དང་བཅས་གྱུར་པ། །\nདེ་ཚེ་ཤིང་བཞིན་གནས་པར་བྱ། །\nརྙེད་དང་བཀུར་སྟི་གྲགས་འདོད་པའམ། །\nགཡོག་འཁོར་དོན་དུ་གཉེར་འདོད་པའམ། །\nབདག་སེམས་རིམ་གྲོ་འདོད་གྱུར་ན། །\nདེ་ཚེ་ཤིང་བཞིན་གནས་པར་བྱ། །\nགཞན་དོན་ཡལ་བར་འདོར་བ་དང་། །\nརང་དོན་གཉེར་བར་འདོད་པ་དང་། །\nསྨྲ་བར་འདོད་པའི་སེམས་བྱུང་ན། །\nདེས་ནི་ཤིང་བཞིན་གནས་པར་བྱ། །\nམི་བཟོད་ལེ་ལོ་འཇིགས་པ་དང་། །\nདེ་བཞིན་སྤྱི་རྟོལ་མུ་ཅོར་དང་། །\nརང་གི་ཕྱོགས་ཞེན་སེམས་བྱུང་ན། །\nདེ་ཚེ་ཤིང་བཞིན་གནས་པར་བྱ། །\nདེ་ལྟར་ཀུན་ནས་ཉོན་མོངས་དང་། །\nདོན་མེད་བརྩོན་པའི་ཡིད་བརྟགས་ནས། །\nདེ་ཚེ་དཔའ་བོས་གཉེན་པོ་ཡིས། །\nདེ་ནི་བརྟན་པོར་གཟུང་བར་བྱ། །",
                "children": []
              },
              {
                "level": "subsubsection-5.3.1.3",
                "title": "དགེ་བ་བྱེད་པའི་དངོས་པོ་དགུ་སོགས་དགེ་སྤྱོད་ཀྱི་ཡན་ལག",
                "lines_span": "225-240",
                "line_text_excerpt": "ཤིན་ཏུ་ངེས་དང་རབ་དད་དང་། །\nབརྟན་དང་གུས་དང་ཞེ་སར་བཅས། །\nངོ་ཚ་ཤེས་དང་འཇིགས་བཅས་དང་། །\nཞི་ཞིང་གཞན་དགའ་བྱེད་ལ་བརྩོན། །\nཕན་ཚུན་མི་མཐུན་བྱིས་པ་ཡི། །\nའདོད་པ་རྣམས་ཀྱིས་མི་སྐྱོ་ཞིང་། །\nཉོན་མོངས་སྐྱེས་པ་འདི་དག་གི །\nསེམས་འདི་བྱུང་སྙམ་བརྩེར་ལྡན་དང་། །\nཁ་ན་མ་ཐོ་མེད་དངོས་ལ། །\nབདག་དང་སེམས་ཅན་དབང་བྱས་ཤིང་། །\nསྤྲུལ་པ་བཞིན་དུ་ང་མེད་པར། །\nཡིད་འདི་རྟག་ཏུ་གཟུང་བར་བྱ། །\nརིང་ཞིག་ལོན་ནས་དལ་བའི་མཆོག །\nཐོབ་པ་ཡང་དང་ཡང་བསམས་ནས། །\nསེམས་དེ་ལྟ་བུར་རི་རབ་ལྟར། །\nརབ་ཏུ་མི་གཡོ་གཟུང་བར་བྱ། །",
                "children": []
              }
            ]
          },
          {
            "level": "subsection-5.3.2",
            "title": "དགེ་བ་ཆོས་སྡུད་ཀྱི་ཚུལ་ཁྲིམས།",
            "lines_span": "241-348",
            "children": [
              {
                "level": "subsubsection-5.3.2.1",
                "title": "བསླབ་པ་ལ་མི་སློབ་པའི་རྒྱུ་ལུས་ལ་ཆགས་པ་སྤང་དགོས་པར་བསྟན་པ།",
                "lines_span": "241-288",
                "line_text_excerpt": "བྱ་རྒོད་ཤ་ལ་ཆགས་པ་ཡིས། །\nཕན་ཚུན་ཀུན་དུ་བཤལ་ཁྲིད་ཀྱང་། །\nཡིད་ཁྱོད་མི་དགར་མི་བྱེད་ན། །\nད་ལྟ་ཅི་ཕྱིར་ཁ་ཏ་བྱེད། །\nལུས་འདི་བདག་གིར་གཟུང་བྱས་ནས། །\nཡིད་ཁྱོད་ཅི་ཕྱིར་སྲུང་བར་བྱེད། །\nཁྱོད་དང་འདི་གཉིས་སོ་སོ་ན། །\nདེས་ཀོ་ཁྱོད་ལ་ཅི་ཞིག་བྱ། །\nརྨོངས་པའི་ཡིད་ཁྱོད་ཅི་ཡི་ཕྱིར། །\nཤིང་གཟུགས་གཙང་མ་གཟུང་མི་བྱེད། །\nམི་གཙང་ཚོགས་ཀྱི་འཁྲུལ་འཁོར་འདི། །\nརུལ་བ་བསྲུངས་ཏེ་ཅི་ཞིག་རུང་། །\nཐོག་མར་པགས་པའི་རིམ་པ་འདི། །\nརང་གི་བློ་ཡིས་ཐ་དད་ཕྱེ། །\nཤ་ཡང་རུས་པའི་དྲ་བ་ལས། །\nཤེས་རབ་མཚོན་གྱིས་གུད་དུ་ཕྱེ། །\nརུས་པ་རྣམས་ཀྱང་དབྱེ་བྱས་ནས། །\nརྐང་གི་བར་དུ་བལྟ་བྱ་ཞིང་། །\nའདི་ལ་སྙིང་པོ་ཅི་ཡོད་ཅེས། །\nབདག་ཉིད་ཀྱིས་ནི་བརྟག་པར་གྱིས། །\nདེ་ལྟར་འབད་དེ་བཙལ་ཀྱང་དེར། །\nཁྱོད་ཀྱིས་སྙིང་པོ་མ་མཐོང་ན། །\nད་དུང་ཅི་ཕྱིར་ཆགས་ཚུལ་གྱིས། །\nཁྱོད་ནི་ལུས་འདི་སྲུང་བར་བྱེད། །\nཁྱོད་ཀྱིས་མི་གཙང་བཟར་མི་རུང་། །\nཁྲག་ཀྱང་བཏུང་དུ་མི་རུང་ལ། །\nརྒྱུ་ལྟོའང་གཞིབ་ཏུ་མི་རུང་ན། །\nལུས་ཀྱིས་ཁྱོད་ལ་ཅི་ཞིག་བྱ། །\nཉིས་ན་ཝ་དང་བྱ་རྒོད་ཀྱིས། །\nཟས་ཀྱི་དོན་དུ་འདི་བསྲུང་རིགས། \nམི་འོ་ཅོག་གི་ལུས་འདི་ནི། །\nབཀོལ་བར་བྱ་བ་ཉིད་དུ་ཟད། །\nའདི་ལྟར་ཁྱོད་ཀྱིས་བསྲུངས་ཀྱང་ནི། །\nའཆི་བདག་བརྩེ་བ་མེད་པ་ཡིས། །\nཕྲོགས་ཏེ་བྱ་དང་ཁྱིར་བྱིན་ན། །\nདེ་ཚེ་ཁྱོད་ཀྱིས་ཅི་བྱར་ཡོད། །\nབྲན་གཡོག་བཀོལ་དུ་མི་བཏུབ་ལའང་། །\nགོས་ལ་སོགས་པ་མི་སྦྱིན་ན། །\nལུས་འདི་བསྙོད་ཀྱང་གཞན་འགྲོ་ན། །\nཁྱོད་ཀོ་ཅི་སྟེ་ཤ་ཐང་གསོ། །\nའདི་ལ་གླ་རྔན་བྱིན་ནས་ནི། །\nད་ནི་རང་གི་དོན་བྱེད་ཆུག །\nཕན་པ་མེད་པར་འདི་ལ་ནི། །\nཐམས་ཅད་སྦྱིན་པར་མི་བྱའོ། །\nའགྲོ་དང་འོང་བའི་རྟེན་ཙམ་དུ། །\nལུས་ལ་གྲུ་ཡི་བློ་བཞག་སྟེ། །\nསེམས་ཅན་རྣམས་དོན་བསྒྲུབ་པའི་ཕྱིར། །\nཡིད་བཞིན་གྱི་ནི་ལུས་སུ་བསྒྱུར། །",
                "children": []
              },
              {
                "level": "subsubsection-5.3.2.2",
                "title": "བསྒྲུབ་པའི་ཐབས་ལ་མཁས་པར་བྱ་བ།",
                "lines_span": "289-348",
                "line_text_excerpt": "དེ་ལྟར་རང་དབང་ཡོད་ཀྱིས་དེ། །\nརྟག་ཏུ་འཛུམ་པའི་བཞིན་དུ་གྱིས། །\nཁྲོ་གཉེར་ངོ་ཟུམ་ཡོངས་ཐོང་སྟེ། །\nའགྲོ་བའི་བཤེས་དང་གསོང་པོར་གྱིས། །\nཁྲི་ལ་སོགས་པ་བབ་ཅོལ་དུ། །\nསྒྲ་དང་བཅས་པར་མི་དོར་རོ། །\nསྒོ་ཡང་དྲག་ཏུ་མི་དབྱེ་སྟེ། །\nརྟག་ཏུ་གཅོམ་བསྐྱུངས་དགའ་བར་བྱ། །\nཆུ་སྐྱར་བྱི་ལ་ཆོམ་རྐུན་དག །\nསྒྲ་མེད་འཇབ་ཅིང་འགྲོ་བ་ཡིས། །\nམངོན་པར་འདོད་པའི་དོན་སྒྲུབ་པ། །\nཐུབ་པས་རྟག་ཏུ་དེ་བཞིན་སྤྱད། །\nགཞན་ལ་གཞེན་བསྐུལ་འདེབས་མཁས་ཤིང་། །\nམ་བཅོལ་ཕན་པ་བྱེད་པའི་ངག །\nགུས་པས་སྤྱི་བོས་བླང་གྱིས་ཏེ། །\nརྟག་ཏུ་ཀུན་གྱི་སློབ་མར་གྱུར། །\nལེགས་པར་སྨྲས་པ་ཐམས་ཅད་ལ། །\nདགེ་བར་གསུངས་ཞེས་བརྗོད་པར་བྱ། །\nབསོད་ནམས་བྱེད་པ་མཐོང་གྱུར་ན། །\nབསྟོད་པས་ལེགས་པར་དགའ་བ་བསྐྱེད། །\nལྐོག་ན་ཡོན་ཏན་བརྗོད་བྱ་ཞིང་། །\nཡོན་ཏན་བརྗོད་ན་རྗེས་སུ་བརྗོད། །\nརང་གི་ཡོན་ཏན་བརྗོད་ན་དེ། །\nཡོན་ཏན་ཤེས་པར་རིག་པར་བྱ། །\nརྩོམ་པ་ཐམས་ཅད་དགའ་ཕྱིར་ཏེ། །\nདེ་ནི་རིན་གྱིས་ཉོ་ནའང་དཀོན། །\nདེ་ལྟས་གཞན་བྱས་ཡོན་ཏན་གྱིས། །\nདགའ་བའི་བདེ་བ་སྤྱད་པར་བྱ། །\nབདག་ལ་འདིར་གོད་ཡོང་མེད་ལ། །\nཕ་རོལ་དུ་ཡང་བདེ་བ་ཆེ། །\nཉེས་པས་མི་དགའ་སྡུག་བསྔལ་ཞིང་། །\nཕ་རོལ་དུ་ཡང་སྡུག་བསྔལ་ཆེ། །\nསྨྲ་ན་ཡིད་ཕེབས་འབྲེལ་པ་དང་། །\nདོན་གསལ་ཡིད་དུ་འོང་བ་དང་། །\nཆགས་དང་ཞེ་སྡང་སྤངས་པ་དང་། །\nའཇམ་ཞིང་རན་པར་སྨྲ་བར་བྱ། །\nམིག་གིས་སེམས་ཅན་ལྟ་ན་ཡང་། །\nའདི་དག་ཉིད་ལ་བརྟེན་ནས་བདག །\nསངས་རྒྱས་ཉིད་དུ་འགྱུར་རོ་ཞེས། །\nདྲང་ཞིང་བྱམས་པའི་ཚུལ་གྱིས་བལྟ། །\nརྟག་པར་མངོན་ཞེན་གྱིས་བསླང་བའམ། །\nགཉེན་པོ་ཡིས་ནི་བསླང་བ་ཉིད། །\nཡོན་ཏན་དང་ནི་ཕན་འདོགས་ཞིང་། །\nསྡུག་བསྔལ་བ་ལ་དགེ་ཆེན་འགྱུར། །\nམཁས་ཤིང་ལྡང་དང་ལྡན་བྱས་ནས། །\nལས་རྣམས་བདག་གིས་རྟག་ཏུ་བྱ། །\nལས་རྣམས་ཀུན་ལ་སུ་ལ་ཡང་། །\nལྟོས་པར་བྱ་བ་མ་ཡིན་ནོ། །\nསྦྱིན་པའི་ཕ་རོལ་ཕྱིན་ལ་སོགས། །\nགོང་ནས་གོང་དུ་ཁྱད་ཞུགས་སྤྱད། །\nཆུང་ངུའི་ཕྱིར་ནི་ཆེ་མི་གཏང་། །\nགཙོ་ཆེར་གཞན་གྱི་དོན་བསམ་མོ། །",
                "children": []
              }
            ]
          },
          {
            "level": "subsection-5.3.3",
            "title": "སེམས་ཅན་དོན་བྱེད་ཀྱི་ཚུལ་ཁྲིམས།",
            "lines_span": "349-404",
            "children": [
              {
                "level": "subsubsection-5.3.3.1",
                "title": "གཞན་དོན་ལྷུར་ལེན་པ།",
                "lines_span": "349-352",
                "line_text_excerpt": "དེ་ལྟར་རིག་བྱས་གཞན་དོན་ལ། །\nརྟག་ཏུ་བརྩོན་པར་གནས་པར་བྱ། །\nཐུགས་རྗེ་མངའ་བ་རིང་གཟིགས་པས། །\nབཀག་པ་རྣམས་ཀྱང་དེ་ལ་གནང་། །",
                "children": []
              },
              {
                "level": "subsubsection-5.3.3.2",
                "title": "ཟང་ཟིང་དང་ཆོས་ཀྱིས་བསྡུ་བ།",
                "lines_span": "353-380",
                "line_text_excerpt": "ལོག་པར་ལྟུང་དང་མགོན་མེད་དང་། །\nབརྟུལ་ཞུགས་གནས་ལ་བགོ་བྱ་ཞིང་། །\nརན་པ་ཙམ་དུ་བཟའ་བྱ་སྟེ། །\nཆོས་གོས་གསུམ་མ་གཏོགས་པ་སྦྱིན། །\nདམ་པའི་ཆོས་ནི་སྤྱོད་པའི་ལུས། །\nཕྲན་ཚེགས་ཆེད་དུ་གནོད་མི་བྱ། །\nདེ་ལྟར་བྱས་ན་སེམས་ཅན་གྱི། །\nབསམ་པ་མྱུར་དུ་རྫོགས་པར་འགྱུར། །\nསྙིང་རྗེའི་བསམ་པ་མ་དག་པར། །\nལུས་འདི་གཏང་བར་མི་བྱ་སྟེ། །\nཅི་ནས་འདི་དང་གཞན་དུ་ཡང་། །\nདོན་ཆེན་སྒྲུབ་པའི་རྒྱུར་གཏང་ངོ་། །\nམ་གུས་པ་ལ་ཆོས་མི་བཤད། །\nམི་ན་བཞིན་དུ་མགོ་དཀྲིས་དང་། །\nགདུགས་དང་འཁར་བ་མཚོན་ཐོགས་དང་། །\nམགོ་བོ་གཡོགས་པ་དག་ལ་མིན། །\nདམན་ལ་ཟབ་དང་རྒྱ་ཆེ་དང་། །\nསྐྱེས་པ་མེད་པར་བུད་མེད་མིན། །\nདམན་དང་མཆོག་གི་ཆོས་རྣམས་ལ། །\nམཚུངས་པར་གུས་པས་ཀུན་དུ་སྤྱད། །\nརྒྱ་ཆེན་ཆོས་ཀྱི་སྣོད་གྱུར་པ། །\nདམན་པའི་ཆོས་ལ་སྦྱར་མི་བྱ། །\nསྤྱོད་པ་ཡོངས་སུ་དོར་མི་བྱ། །\nམདོ་དང་སྔགས་ཀྱིས་འདྲིད་མི་བྱ། །",
                "children": []
              },
              {
                "level": "subsubsection-5.3.3.3",
                "title": "ཕ་རོལ་གྱི་མ་དད་པ་བསྲུང་བ།",
                "lines_span": "381-404",
                "line_text_excerpt": "སོ་ཤིང་དང་ནི་མཆིལ་མ་དག །\nདོར་བ་ན་ནི་དགབ་པར་བྱ། །\nགཅི་ལ་སོགས་པའང་ལོངས་སྤྱོད་པའི། །\nཆུ་དང་ཐང་ལ་དོར་བ་སྨད། །\nཁ་བཀང་བ་དང་སྒྲ་བཅས་དང་། །\nཁ་གདངས་ནས་ནི་བཟའ་མི་བྱ། །\nརྐང་པ་བརྐྱང་སྟེ་མི་འདུག་ཅིང་། །\nལག་པ་མཉམ་པར་མི་མཉེའོ། །\nབཞོན་པ་མལ་སྟན་གནས་དག་ཏུ། །\nབུད་མེད་གཞན་དང་གཅིག་མི་བྱ། །\nའཇིག་རྟེན་མ་དད་གྱུར་པ་ཀུན། །\nམཐོང་དང་དྲིས་ཏེ་སྤང་བར་བྱ། །\nསོར་མོས་བརྡ་ནི་མི་བྱ་སྟེ། །\nགུས་དང་བཅས་པས་གཡས་པ་ཡི། །\nལག་པ་དག་ནི་ཀུན་གྱིས་ཀྱང་། །\nལམ་ཡང་དེ་ལྟར་བསྟན་པར་བྱ། །\nལག་པ་ཤས་ཆེར་བསྐྱོད་མིན་ཏེ། །\nཅུང་ཟད་བསྐྱོད་ལ་སྒྲ་བསྒྲགས་པ། །\nསེ་གོལ་ལ་སོགས་བརྡ་བྱས་ཏེ། །\nགཞན་དུ་མ་བསྡམས་པར་འགྱུར་རོ། །\nམགོན་པོ་མྱ་ངན་འདས་གཟིམས་ལྟར། །\nའདོད་པའི་ཕྱོགས་སུ་ཉལ་བར་བྱ། །\nཤེས་བཞིན་མྱུར་དུ་ལྡང་སེམས་ལ། །\nཐོག་མ་ཉིད་དུ་ངེས་པར་སྦྱར། །",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "level": "section-5.4",
        "title": "བསྒྲུབ་པ་ཕུན་སུམ་ཚོགས་པའི་ཡན་ལག་གཞན་བསྟན་པ།",
        "lines_span": "405-456",
        "children": [
          {
            "level": "subsection-5.4.1",
            "title": "བསྒྲུབ་པ་ཕུན་སུམ་ཚོགས་པ་དངོས་།",
            "lines_span": "405-448",
            "line_text_excerpt": "བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དག །\nཚད་མེད་པར་ནི་གསུངས་པ་ལས། །\nསེམས་སྦྱང་བ་ཡི་སྤྱོད་པ་ནི། །\nངེས་པར་དེ་སྲིད་སྤྱད་པར་བྱ། །\nཉིན་དང་མཚན་མོ་ལན་གསུམ་དུ། །\nཕུང་པོ་གསུམ་པ་གདོན་བྱ་ཞིང་། །\nརྒྱལ་དང་བྱང་ཆུབ་སེམས་བརྟེན་པས། །\nལྟུང་བའི་ལྷག་མ་དེས་ཞི་བྱ། །\nརང་ངམ་གཞན་གྱི་དབང་ཡང་རུང་། །\nགནས་སྐབས་གང་དུ་ཅི་སྤྱོད་ཀྱང་། །\nབསླབ་པར་གསུངས་པ་གང་ཡིན་པའི། །\nགནས་སྐབས་དེ་ལ་འབད་དེ་བསླབ། །\nརྒྱལ་སྲས་རྣམས་ཀྱིས་མི་བསླབ་པ། །\nདེ་ནི་གང་ཡང་ཡོད་མིན་ཏེ། །\nདེ་ལྟར་གནས་པའི་མཁས་པ་ལ། །\nབསོད་ནམས་མི་འགྱུར་གང་ཡང་མེད། །\nདངོས་སམ་ཡང་ན་བརྒྱུད་ཀྱང་རུང་། །\nསེམས་ཅན་དོན་ལས་གཞན་མི་སྤྱད། །\nསེམས་ཅན་ཁོ་ནའི་དོན་གྱི་ཕྱིར། །\nཐམས་ཅད་བྱང་ཆུབ་ཕྱིར་བསྔོའོ། །\nརྟག་པར་དགེ་བའི་བཤེས་གཉེན་ནི། །\nཐེག་ཆེན་དོན་ལ་མཁས་པ་དང་། །\nབྱང་ཆུབ་སེམས་དཔའི་བརྟུལ་ཞུགས་མཆོག །\nསྲོག་གི་ཕྱིར་ཡང་མི་བཏང་ངོ་། །\nདཔལ་འབྱུང་བ་ཡི་རྣམ་ཐར་ལས། །\nབླ་མ་བསྟེན་པའི་ཚུལ་ལྟར་བསླབ། །\nའདི་དང་སངས་རྒྱས་བཀའ་སྩལ་གཞན། །\nམདོ་སྡེ་བཀླགས་ནས་ཤེས་པར་བྱ། །\nམདོ་སྡེ་རྣམས་ལས་བསླབ་པ་སྣང་། །\nདེ་བས་མདོ་སྡེ་བཀླག་པར་བྱ། །\nནམ་མཁའི་སྙིང་པོའི་མདོ་སྡེ་ནི། །\nཐོག་མ་ཉིད་དུ་བལྟ་བར་བྱ། །\nགང་ཕྱིར་རྟག་ཏུ་སྤྱད་པ་ནི། །\nདེ་ལས་རྒྱ་ཆེར་རབ་སྟོན་པས། །\nབསླབ་པ་ཀུན་ལས་བཏུས་པ་ཡང་། །\nངེས་པར་ཡང་དང་ཡང་དུ་བལྟ། །\nཡང་ན་རེ་ཞིག་མདོར་བསྡུས་པའི། །\nམདོ་རྣམས་ཀུན་ལས་བཏུས་པ་བལྟ། །\nའཕགས་པ་ཀླུ་སྒྲུབ་ཀྱིས་མཛད་པའི། །\nགཉིས་པོའང་འབད་པས་བལྟ་བར་བྱ། །\nགང་ལས་གང་ནི་མ་བཀག་པ། །\nདེ་ཉིད་སྤྱད་པར་བྱ་བ་སྟེ། །\nའཇིག་རྟེན་སེམས་ནི་བསྲུང་བའི་ཕྱིར། །\nབསླབ་པ་མཐོང་ནས་ཡང་དག་སྤྱད། །",
            "children": []
          },
          {
            "level": "subsection-5.4.2",
            "title": "ལེའུའི་དོན་བསྡུ་བ།",
            "lines_span": "449-456",
            "line_text_excerpt": "ལུས་དང་སེམས་ཀྱི་གནས་སྐབས་ལ། །\nཡང་དང་ཡང་དུ་བརྟག་བྱ་བ། །\nདེ་ཉིད་ཁོ་ན་མདོར་ན་ནི། །\nཤེས་བཞིན་བསྲུང་བའི་མཚན་ཉིད་དོ། །\nལུས་ཀྱིས་འདི་དག་སྤྱད་པར་བྱ། །\nཚིག་ཙམ་བརྗོད་པས་ཅི་ཞིག་འགྲུབ། །\nསྨན་དཔྱད་བཀླགས་པ་ཙམ་གྱིས་ནི། །\nནད་པ་དག་ལ་ཕན་འགྱུར་རམ། །",
            "children": []
          }
        ]
      }
    ]
  }
]