[
    {
      "level": "chapter",
      "number": "9",
      "title": "Wisdom",
      "verses_span": "1-167",
      "children": [
        {
          "level": "section",
          "number": "9.1",
          "title": "Brief exposition",
          "verses_span": "1",
          "verse_text_excerpt": "All these branches of the Doctrine\nThe Enlightened Sage expounded for the sake of wisdom.\nTherefore they must cultivate this wisdom\nWho wish to have an end of suffering.",
          "children": []
        },
        {
          "level": "section",
          "number": "9.2",
          "title": "Detailed explanation",
          "verses_span": "2-150",
          "children": [
            {
              "level": "subsection",
              "number": "9.2.1",
              "title": "Wisdom established by means of the view",
              "verses_span": "2-29",
              "children": [
                {
                  "level": "sub-subsection",
                  "number": "9.2.1.1",
                  "title": "An outline of the two truths",
                  "verses_span": "2",
                  "verse_text_excerpt": "Relative and ultimate,\nThese the two truths are declared to be.\nThe ultimate is not within the reach of intellect,\nFor intellect is said to be the relative.",
                  "children": []
                },
                {
                  "level": "sub-subsection",
                  "number": "9.2.1.2",
                  "title": "Concerning those who establish the two truths",
                  "verses_span": "3-4",
                  "verse_text_excerpt": "In light of this, within the world, two kinds of people are observed:\nThose with yogic insight and the common run of people.\nIn this regard, the views of ordinary folk\nAre undermined by yogis who themselves are in the world\n\n(Within whose ranks\nThe lower, in degrees of insight, are confuted by the higher)\nBy means of the examples that the yogis and the worldly both accept.\nAnd for the sake of the result, analysis is left aside.",
                  "children": []
                },
                {
                  "level": "sub-subsection",
                  "number": "9.2.1.3",
                  "title": "Refutation of objections to the two truths",
                  "verses_span": "5-15",
                  "children": [
                    {
                      "level": "sub-sub-subsection",
                      "number": "9.2.1.3.1",
                      "title": "Refutation of the objections of ordinary people",
                      "verses_span": "5",
                      "verse_text_excerpt": "When ordinary folk perceive phenomena,\nThey look on them as real, and not illusory.\nThis, then, is the subject of debate\nWhere ordinary and yogis differ.",
                      "children": []
                    },
                    {
                      "level": "sub-sub-subsection",
                      "number": "9.2.1.3.2",
                      "title": "Refutation of the objections of the Shravakas",
                      "verses_span": "6-15",
                      "verse_text_excerpt": "Forms and so forth, which we all perceive,\nExist by general acclaim but not by valid reasoning.\nThey’re false just like, for instance, unclean things\nRegarded in the common view as pure.\n\nBut that he might instruct the worldly,\nOur Protector spoke of “things.”\nBut these in truth lack even momentariness.\nNow if you say it’s wrong to claim the momentary as relative,\n\nThere is no fault. For momentariness\nIs relative for yogis, but for worldly beings, ultimate.\nWere it otherwise, the common view\nCould fault the yogic insight into corporal impurity.\n\n“Through a Buddha, who is but illusion, how does merit spring?”\nAs if the Buddha were existing truly.\n“But,” you ask, “if beings are like illusions,\nHow, when dying, can they take rebirth?”\n\nAs long as the conditions are assembled,\nIllusions, likewise, will persist and manifest.\nWhy, through simply being more protracted,\nShould sentient beings be regarded as more real?\n\nIf one kills or harms the magical illusion of a man,\nThere is no mind in such a thing and therefore there’s no sin.\nBut beings do indeed have mirage-like minds;\nSin and merit will, in consequence, arise.\n\nThere is no power in things like spells,\nSo mirage-like minds do not occur through them.\nIllusions spring from various causes;\nThus illusions are of different kinds.\n\nA single cause for everything\nThere never was!\n“If ultimately, beings are in nirvāṇa,” you will say,\n“But relatively circle in saṃsāra,\n\n“Even Buddhahood reverts to the saṃsāric state.\nSo why,” you ask, “pursue the Bodhisattva path?”\nAs long as there’s no cutting of the causal stream,\nThere is no halting even of illusory displays.\n\nBut when the causal stream is severed,\nEven relative phenomena do not appear.\n“If even that which is deceived does not exist,\nWhat is it,” you will ask, “that sees illusion?”",
                      "children": []
                    }
                  ]
                },
                {
                  "level": "sub-subsection",
                  "number": "9.2.1.4",
                  "title": "Refutation of the objections of the Chittamatrins",
                  "verses_span": "16-29",
                  "verse_text_excerpt": "But if, for you, these same illusions have no being,\nWhat, indeed, is there to be perceived?\n“But objects have another mode of being,” you will say,\n“That very mode is but the mind itself.”\n\nBut if the mirage is the mind itself,\nWhat is then perceived by what?\nThe Guardian of the World himself has said\nThat mind cannot be seen by mind.\n\nIn just the same way, he has said,\nThe sword’s edge cannot cut the sword.\n“But,” you say, “it’s like the flame\nThat perfectly illuminates itself.”\n\nThe flame, in fact, can never light itself.\nAnd why? Because the darkness never dims it!\n“The blueness of a thing by nature blue,” you say,\n“Depends, unlike a crystal, upon nothing else.\n\n“Likewise some perceptions\nCome from other things, while some do not.”\nBut something that’s by nature blue has never of itself imposed\nA blueness on its non-blue self.\n\nThe phrase “The lamp illuminates itself”\nThe mind can know and formulate.\nBut what is there to know and say\nThat “mind is self-illuminating?”\n\nThe mind, indeed, is never seen by anything.\nAnd therefore, whether it can know, or cannot know, itself,\nIs like the beauty of a barren woman’s daughter:\nSomething that it’s pointless to discuss.\n\n“But if,” you ask, “the mind is not self-knowing,\nHow does it remember what it knew?”\nWe say that, like the poison of the water rat,\nIt’s through the link with things experienced that memory occurs.\n\n“In certain cases,” you will say, “the mind\nCan see the minds of others, how then not itself?”\nBut through the application of a magic balm,\nThe eye may see the treasure, but the salve it does not see.\n\nIt’s not indeed our purpose to disprove\nExperiences of sight or sound or knowing.\nOur aim is here to undermine the cause of sorrow:\nThe thought that such phenomena have true existence.\n\n“Illusions are not other than the mind,” you say,\nAnd yet you don’t consider them the same.\nHow could they not be different if the mind is real?\nAnd how can mind be real if you deny a difference?\n\nAlthough it is unreal, a mirage can be seen;\nAnd that which sees is just the same.\n“But saṃsāra must be based on something real,” you say,\n“Or else it is like empty space.”\n\nBut how could the unreal be causally effective,\nEven if it rests on something real?\nThis mind of yours is isolated and alone,\nAlone, in solitude, and unaccompanied.\n\nIf the mind indeed is free of objects,\nAll beings must be Buddhas, Thus-Gone and enlightened.\nAnd so, what purpose can there be\nIn saying thus, that there is “Only Mind”?",
                  "children": []
                }
              ]
            },
            {
              "level": "subsection",
              "number": "9.2.2",
              "title": "Refutation of objections with regard to the path, that is, emptiness",
              "verses_span": "30-34",
              "verse_text_excerpt": "“Even if we know that all is like illusion,\nHow,” you ask, “will this dispel afflictive passion?\nMagicians may indeed themselves desire\nThe mirage-women they themselves create.”\n\nThe reason is they have not rid themselves\nOf habits of desiring objects of perception;\nAnd when they gaze upon such things,\nTheir aptitude for emptiness is weak indeed.\n\nBy training in this aptitude for emptiness,\nThe habit to perceive real things will be relinquished.\nBy training in the thought “There isn’t anything,”\nThis view itself will also be abandoned.\n\n“There is nothing”—when this is asserted,\nNo thing is there to be examined.\nHow can a “nothing,” wholly unsupported,\nRest before the mind as something present?\n\nWhen something and its nonexistence\nBoth are absent from before the mind,\nNo other option does the latter have:\nIt comes to perfect rest, from concepts free.",
              "children": []
            },
            {
              "level": "subsection",
              "number": "9.2.3",
              "title": "Refutation of objections with regard to the fruit, that is, the benefit of others",
              "verses_span": "35-39",
              "verse_text_excerpt": "As the wishing jewel and tree of miracles\nFulfill and satisfy all hopes and wishes,\nLikewise, through their prayers for those who might be trained,\nThe physical appearance of the Conquerors occurs.\n\nThe healing shrine of the garuḍa,\nEven when its builder was long dead,\nContinued even ages thence\nTo remedy and soothe all plagues and venom.\n\nLikewise having gained the “shrine of victory”\nIn accordance with their deeds for sake of Buddhahood,\nThough Bodhisattvas pass beyond all grief,\nThey yet can satisfy all ends.\n\n“But how,” you ask, “can offerings made\nTo beings freed from all discursiveness give fruit?”\nIt’s said that whether Buddhas live or pass beyond,\nThe offerings made to them are equal in their merit.\n\nWhether you assert them in the ultimate or relative,\nMerit, so the scriptures say, arises,\nJust as there will be results\nWhen Buddhas are considered truly real.",
              "children": []
            }
          ]
        },
        {
          "level": "section",
          "number": "9.3",
          "title": "Proofs of the supremacy of the Mahayana",
          "verses_span": "40-51",
          "children": [
            {
              "level": "subsection",
              "number": "9.3.1",
              "title": "The Mahayana is the Buddha’s teaching",
              "verses_span": "40-51",
              "verse_text_excerpt": "“We’re free,” you say, “through seeing the (Four) Truths—\nWhat use is it to us, this view of emptiness?”\nBut as the scriptures have themselves proclaimed,\nWithout this path there can be no enlightenment.\n\nYou say the Mahāyāna has no certainty.\nBut how do you substantiate your own tradition?\n“Because it is accepted by both parties,” you will say.\nBut at the outset, you yourself lacked proof!\n\nThe reasons why you trust in your tradition\nMay likewise be applied to Mahāyāna.\nMoreover, if accord between two parties shows the truth,\nThe Vedas and the rest are also true.\n\n“Mahāyāna is at fault,” you say, “because it is contested.”\nBut Buddhist texts are questioned by extremists,\nWhile Buddhists also vie among themselves;\nAnd so your own tradition you must now abandon.\n\nThe true monk is the root of Dharma,\nAnd to be a monk is difficult indeed.\nIt’s hard for minds enmeshed in thoughts\nTo pass beyond the bonds of suffering.\n\nYou say there’s liberation in the instant\nThat defilements are entirely forsaken.\nYet those who from defilements are set free\nContinue to display the influence of karma.\n\n“Only for a while,” you say. “For it is certain\nThat the causes of rebirth, their cravings, are no more.”\nThey have no craving, granted, through defilement,\nBut like their ignorance, why should they not have craving undefiled?\n\nThis craving is produced by virtue of sensation,\nAnd sensation, this they surely have.\nConcepts linger still within their minds;\nAnd it is to these concepts that they cling.\n\nThe mind that has not realized voidness,\nMay be halted, but will once again arise,\nJust as from a non-perceptual absorption.\nTherefore one must train in emptiness.\n\nIf all the words recorded in the sūtras\nYou admit to be the Buddha’s perfect speech,\nWhy don’t you now accept the greater part of Mahāyāna,\nWith which your sūtras are in perfect harmony?\n\nIf due to just a single jarring element,\nThe whole is held to be at fault,\nWhy should a single sūtra in agreement with your texts\nNot vindicate the rest as Buddha’s teaching?\n\nMahākāshyapa himself and others\nCould not sound the depths of such a teaching.\nWho will therefore say that they’re to be rejected\nJust because they are not grasped by you?",
              "children": []
            }
          ]
        },
        {
          "level": "section",
          "number": "9.4",
          "title": "Proofs that the theory and practice of emptiness are the real solution",
          "verses_span": "52-56",
          "verse_text_excerpt": "To linger and abide within saṃsāra,\nFreed from every craving and from every fear,\nIn order to achieve the good of those who ignorantly suffer:\nSuch is the fruit that emptiness will bear.\n\nTherefore it is incorrect\nTo find fault with this view of emptiness.\nAnd so, with every doubt abandoned,\nWe should meditate on it!\n\nAfflictive passion and the veil upon cognition—\nThe cure for their obscurity is emptiness.\nHow then shall they not meditate on this\nWho wish for swift attainment of omniscience?\n\nWhatever is the source of suffering,\nLet that be the object of our fear.\nBut voidness will allay our every grief,\nHow could it be for us a thing of dread?\n\nIf such a thing as “I” exists indeed,\nThen terrors, granted, will torment it.\nBut since no self or “I” exists at all,\nWhat is there left for fears to terrify?",
          "children": []
        },
        {
          "level": "section",
          "number": "9.5",
          "title": "Wisdom experienced by means of meditation",
          "verses_span": "57-110",
          "children": [
            {
              "level": "subsection",
              "number": "9.5.1",
              "title": "Meditation on the absence of self in individuals",
              "verses_span": "57-77",
              "children": [
                {
                  "level": "sub-subsection",
                  "number": "9.5.1.1",
                  "title": "Meditation on the emptiness of the coemergent self",
                  "verses_span": "57-59",
                  "verse_text_excerpt": "The teeth, the hair, the nails are not the “I,”\nAnd “I” is not the bones or blood,\nThe mucus from the nose and phlegm are not the “I,”\nAnd neither is it made of lymph or pus.\n\nThe “I” is not the body’s grease or sweat,\nThe lungs and liver likewise do not constitute it.\nNeither are the inner organs “I,”\nNor yet the body’s excrement and waste.\n\nThe flesh and skin are not the “I,”\nAnd neither are the body’s warmth and breath.\nThe cavities within the frame are not the “I,”\nAnd “I” is not accounted for in sixfold consciousness.",
                  "children": []
                },
                {
                  "level": "sub-subsection",
                  "number": "9.5.1.2",
                  "title": "Meditation on the emptiness of the imputed self",
                  "verses_span": "60-77",
                  "children": [
                    {
                      "level": "sub-sub-subsection",
                      "number": "9.5.1.2.1",
                      "title": "Refutation of the belief in a self that is conscious",
                      "verses_span": "60-67",
                      "verse_text_excerpt": "If the hearing consciousness is permanent,\nIt follows that it’s hearing all the time.\nAnd if there is no object, what does it cognize?\nOn what grounds do you call it consciousness?\n\nIf something that’s unconscious knows,\nIt follows that a stick has knowledge also.\nTherefore in the absence of a thing to know,\nIt’s clear that consciousness will not arise.\n\nIf the selfsame consciousness detects a form,\nAt that time, why does it not hear?\nPerhaps you say the sound’s no longer there.\nThen neither is there consciousness of sound.\n\nHow could that which has the nature of a sound-perceiver\nEver be transformed into a form-perceiver?\n“A single man,” you say, “can be both son and father.”\nBut these are merely names; his nature is not so.\n\nAnd likewise “pain,” “neutrality,” and “pleasure”\nAre neither fatherhood nor sonship;\nAnd we indeed have never yet observed\nA consciousness of form perceiving sound.\n\n“But like an actor,” you reply, “it takes a different role and sees.”\nIf so, this consciousness is not a constant thing.\nAnd if its later mode is still the first,\nThat’s identity indeed and never seen before!\n\n“But its different modes,” you say, “are quite unreal.”\nIts essence therefore you must now describe.\nYou say that this is simply knowing.\nIt follows that all beings are a single thing.\n\nWhat has mind and what does not have mind\nAre thus identical, for both are equal in existing.\nIf the different kinds of mind are all unreal,\nWhat common basis can there be for them?",
                      "children": []
                    },
                    {
                      "level": "sub-sub-subsection",
                      "number": "9.5.1.2.2",
                      "title": "Refutation of the belief in a self that is unconscious",
                      "verses_span": "68-69",
                      "verse_text_excerpt": "Something destitute of mind, we hold, is not a self.\nFor mindlessness means matter, like a vase.\n“But,” you say, “the self has consciousness when joined to mind.”\nThen this refutes its nature of unconsciousness.\n\nIf the self, moreover, is immutable,\nWhat change in it could mingling with the mind produce?\nAnd selfhood we might equally affirm\nOf empty space, inert and destitute of mind.",
                      "children": []
                    }
                  ]
                },
                {
                  "level": "sub-subsection",
                  "number": "9.5.1.3",
                  "title": "Answers to objections concerning the nonexistence of the self",
                  "verses_span": "70-77",
                  "children": [
                    {
                      "level": "sub-sub-subsection",
                      "number": "9.5.1.3.1",
                      "title": "The nonexistence of the self is not incompatible with the principle of cause and effect",
                      "verses_span": "70-74",
                      "verse_text_excerpt": "“If self does not exist,” you say,\n“There is no link connecting actions with results.\nIf when the deed is done, the doer is no more,\nWho is there to reap the karmic fruit?”\n\nThe bases of the act and fruit are not the same,\nIn both a self is without scope for action.\nThis is valid both for you and us;\nWhat point is there, therefore, in our debate?\n\n“A cause coterminous with its result”\nIs something quite impossible to see.\nAnd only in the context of a single mental stream\nCan it be said that one who acts will later reap the fruit.\n\nThe thoughts now passed, and those to come, are not the self;\nThey are no more, or are not yet.\nIs then the self the thought which now is born?\nIf so, it sinks to nothing when the latter fades.\n\nFor instance, we may take banana trees—\nCutting through the fibers, finding nothing.\nLikewise analytical investigation\nWill find no “I,” no underlying self.",
                      "children": []
                    },
                    {
                      "level": "sub-sub-subsection",
                      "number": "9.5.1.3.2",
                      "title": "The nonexistence of the self is not incompatible with compassion",
                      "verses_span": "75",
                      "verse_text_excerpt": "“If beings,” you will say, “have no existence,\nWho will be the object of compassion?”\nThose whom ignorance imputes,\nFor whose sake we have pledged ourselves.",
                      "children": []
                    },
                    {
                      "level": "sub-sub-subsection",
                      "number": "9.5.1.3.3",
                      "title": "A demonstration that the self as label is not refuted",
                      "verses_span": "76-77",
                      "verse_text_excerpt": "“If,” you ask, “there are no beings, who will gain the fruit?”\nIt’s true! It is through ignorance that they are said to be!\nBut for the total vanquishing of sorrow,\nThe goal, which ignorance conceives, should not be spurned.\n\nThe source of sorrow is the pride of saying “I,”\nIt’s fostered and increased by false belief in self.\nTo this you may believe that there is no redress,\nBut meditation on no-self will be the supreme way.",
                      "children": []
                    }
                  ]
                }
              ]
            },
            {
              "level": "subsection",
              "number": "9.5.2",
              "title": "Meditation on the absence of self in phenomena",
              "verses_span": "78-105",
              "children": [
                {
                  "level": "sub-subsection",
                  "number": "9.5.2.1",
                  "title": "Close mindfulness of the body",
                  "verses_span": "78-87",
                  "children": [
                    {
                      "level": "sub-sub-subsection",
                      "number": "9.5.2.1.1",
                      "title": "Examination of the body in general",
                      "verses_span": "78-84",
                      "verse_text_excerpt": "What we call the body is not feet or shins;\nThe body, likewise, is not thighs or loins.\nIt’s not the belly nor indeed the back,\nAnd from the chest and arms the body is not formed.\n\nThe body is not ribs or hands,\nArmpits, shoulders, bowels, or entrails.\nIt is not the head, and it is not the throat.\nWhat is the “body,” then, in all of this?\n\nIf the “body” spreads itself\nAnd with the members coincides,\nIts parts indeed are present in those parts.\nBut where does “body,” in itself, abide?\n\nBut if the “body,” single and entire\nIs present in the hands and other members,\nHowever many parts there are, the hands and all the rest,\nYou’ll find an equal quantity of “bodies.”\n\nIf “body” is not outside or within its parts,\nHow is it, then, residing in its members?\nAnd since it is not other than its parts,\nHow can you say that it exists at all?\n\nThus there is no “body.” It is through illusion,\nWith regard to hands and other parts, that “body” as a notion is conceived—\nJust as on account of its specific shape\nA pile of stones is taken for a man.\n\nAs long as the conditions are assembled,\nThe body will appear to be a man.\nAs long as all the parts are likewise present,\nA body will appear therein.",
                      "children": []
                    },
                    {
                      "level": "sub-sub-subsection",
                      "number": "9.5.2.1.2",
                      "title": "Specific examination of physical parts",
                      "verses_span": "85-86",
                      "verse_text_excerpt": "Likewise, since it is a group of fingers,\nThe hand itself does not exist as such.\nAnd so it is with fingers, made of joints—\nAnd joints themselves consist of many parts.\n\nThese parts themselves will break down into particles,\nAnd particles divide according to direction.\nThese fragments, too, lack partless parts; they are like space.\nThus even particles have no existence.",
                      "children": []
                    },
                    {
                      "level": "sub-sub-subsection",
                      "number": "9.5.2.1.3",
                      "title": "The need for relinquishing attachment to one’s body",
                      "verses_span": "87",
                      "verse_text_excerpt": "All form, therefore, is like a dream,\nAnd who will be attached to it, who thus investigates?\nThe body, in this way, has no existence;\nWhat, therefore, is male and what is female?",
                      "children": []
                    }
                  ]
                },
                {
                  "level": "sub-subsection",
                  "number": "9.5.2.2",
                  "title": "Close mindfulness of the feelings",
                  "verses_span": "88-101",
                  "children": [
                    {
                      "level": "sub-sub-subsection",
                      "number": "9.5.2.2.1",
                      "title": "Examination of the nature of the feelings",
                      "verses_span": "88-92",
                      "verse_text_excerpt": "If suffering itself is truly real,\nWhy is joy not altogether quenched thereby?\nIf pleasure’s real, then why will pleasant tastes\nNot comfort and amuse a man in agony?\n\nIf the feeling fails to be experienced,\nThrough being overwhelmed by something stronger,\nHow can “feeling” rightly be ascribed\nTo that which lacks the character of being felt?\n\nPerhaps you say that only subtle pain remains,\nIts grosser form has now been overmastered—\nOr rather it is felt as “mere pleasure.”\nBut what is subtle still remains itself.\n\nIf, because its opposite is present,\nDiscomfort fails to manifest,\nIs not the claim that it’s a “feeling”\nNo more than a mental imputation?\n\nSince so it is, the antidote\nIs meditation and analysis.\nAbsorption grown in fields of their investigation\nIs indeed the food and sustenance of yogis.",
                      "children": []
                    },
                    {
                      "level": "sub-sub-subsection",
                      "number": "9.5.2.2.2",
                      "title": "Examination of the cause of the feelings",
                      "verses_span": "93-97",
                      "verse_text_excerpt": "If between the sense power and a thing\nThere is a space, how will the two terms meet?\nAnd if there is no space, they form a unity,\nAnd therefore what is it that meets with what?\n\nNo penetration can there be of particle by particle,\nFor they are both the same in lacking volume.\nBut if they do not penetrate, they do not merge;\nAnd if they do not merge, there’s no encounter.\n\nFor how could anyone accept\nThat what is partless could be said to meet?\nAnd you must show me, if you ever saw,\nA contact taking place between two partless things.\n\nConsciousness is immaterial,\nAnd so one cannot speak of contact with it.\nA combination, too, has no reality,\nJust as we have previously shown.\n\nIf therefore there’s no touch or contact,\nWhence is it that feeling takes its rise?\nWhat purpose is there, then, in all our toil,\nFor what is it, indeed, that torments what?",
                      "children": []
                    },
                    {
                      "level": "sub-sub-subsection",
                      "number": "9.5.2.2.3",
                      "title": "Examination of the result of the feelings",
                      "verses_span": "98",
                      "verse_text_excerpt": "Since there is no subject for sensation,\nAnd sensation, too, lacks all existence,\nHow is craving not arrested\nWhen all this is clearly understood?",
                      "children": []
                    },
                    {
                      "level": "sub-sub-subsection",
                      "number": "9.5.2.2.4",
                      "title": "Examination of the feeling subject",
                      "verses_span": "99-101",
                      "verse_text_excerpt": "What we see and what we touch\nIs stuff of dreams and mirages.\nIf feeling is coincident with consciousness,\nIt follows that it is not seen thereby.\n\nIf the one arises first, the other after,\nMemory occurs and not direct sensation.\nSensation is without perception of itself\nAnd likewise, by another it is not perceived.\n\nThe agent of sensation has no real existence,\nThus sensation, likewise, has no being.\nWhat damage, therefore, can sensation do to it—\nThis aggregate deprived of self?",
                      "children": []
                    }
                  ]
                },
                {
                  "level": "sub-subsection",
                  "number": "9.5.2.3",
                  "title": "Close mindfulness of the mind",
                  "verses_span": "102-105",
                  "children": [
                    {
                      "level": "sub-sub-subsection",
                      "number": "9.5.2.3.1",
                      "title": "The mind is without inherent existence",
                      "verses_span": "102-103",
                      "verse_text_excerpt": "The mind within the senses does not dwell,\nIt has no place in outer things like form.\nAnd in between, the mind does not abide:\nNot out, not in, not elsewhere, can the mind be found.\n\nIt is not in the body, yet is nowhere else.\nIt does not merge with it nor stand apart—\nSomething such as this does not exist, not even slightly.\nBeings by their nature are beyond the reach of suffering.",
                      "children": []
                    },
                    {
                      "level": "sub-sub-subsection",
                      "number": "9.5.2.3.2",
                      "title": "The mind is unborn",
                      "verses_span": "104-105",
                      "verse_text_excerpt": "If consciousness precedes the cognized object,\nWith regard to what does it arise?\nIf consciousness arises at the same time as its object,\nAgain, regarding what does it arise?\n\nIf consciousness comes later than its object,\nOnce again, from what does it arise?\nThus the origin of all phenomena\nExceeds the reach of understanding.",
                      "children": []
                    }
                  ]
                }
              ]
            },
            {
              "level": "subsection",
              "number": "9.5.3",
              "title": "Refutation of objections",
              "verses_span": "106-110",
              "children": [
                {
                  "level": "sub-subsection",
                  "number": "9.5.3.1",
                  "title": "Eliminating the objection that the two truths are untenable",
                  "verses_span": "106-107",
                  "verse_text_excerpt": "“If this is so,” you say, “there is no relative,\nAnd then the two truths—what becomes of them?\nMoreover, if the relative derives from beings’ minds,\nHow can they pass beyond their sorrows?”\n\nBut that is just the thought of others;\nIt is not what I mean by the relative.\nIf subsequently there are thoughts, the relative’s still there;\nIf not, the relative has ceased indeed.",
                  "children": []
                },
                {
                  "level": "sub-subsection",
                  "number": "9.5.3.2",
                  "title": "Refutation of the objection that phenomena are inaccessible to reasoned analysis",
                  "verses_span": "108",
                  "verse_text_excerpt": "The analyzing mind and what is analyzed\nAre linked together, mutually dependent.\nIt is on the basis of conventional consensus\nThat all investigation is expressed.",
                  "children": []
                },
                {
                  "level": "sub-subsection",
                  "number": "9.5.3.3",
                  "title": "Refutation of the objection that analysis must result in an infinite regress",
                  "verses_span": "109-110",
                  "verse_text_excerpt": "“But when,” you say, “the process of analysis\nIs made, in turn, the object of our scrutiny,\nThis investigation likewise may be analyzed,\nAnd thus we find an infinite regress.”\n\nIf phenomena are truly analyzed,\nNo basis for analysis remains.\nAnd when the object is removed, the subject too subsides.\nThat indeed is said to be nirvāṇa.",
                  "children": []
                }
              ]
            },
            {
              "level": "subsection",
              "number": "9.5.4",
              "title": "Misconceptions dispelled through reasoning",
              "verses_span": "111-150",
              "children": [
                {
                  "level": "sub-subsection",
                  "number": "9.5.4.1",
                  "title": "A refutation of the argument of those who believe in true existence",
                  "verses_span": "111-115",
                  "verse_text_excerpt": "Those who say that both are true,\nAre hard-pressed to maintain their case.\nIf consciousness reveals the truth of things,\nOn what grounds, in its turn, does consciousness exist?\n\nIf knowledge objects show that consciousness exists,\nWhat is it that shows that they exist?\nIf both subsist through mutual dependence,\nBoth will thereby lose their true existence.\n\nIf, without a son, a man cannot be father,\nWhence, indeed, will such a son arise?\nThere is no father in the absence of a son.\nJust so, the mind and object have no true existence.\n\n“The plant arises from the seed,” you say,\n“And through it is the seed deduced.\nIt’s just the same with consciousness arising from its object.\nHow can it fail to show the thing’s existence?”\n\nA consciousness that’s different from the plant itself\nDeduces the existence of the seed.\nBut what will show that consciousness exists,\nWhereby the object is itself established?",
                  "children": []
                },
                {
                  "level": "sub-subsection",
                  "number": "9.5.4.2",
                  "title": "An exposition of the proofs of those who uphold the doctrine of emptiness",
                  "verses_span": "116-150",
                  "children": [
                    {
                      "level": "sub-sub-subsection",
                      "number": "9.5.4.2.1",
                      "title": "Investigation of the cause: the diamond splinters argument",
                      "verses_span": "116-140",
                      "children": [
                        {
                          "level": "sub-sub-sub-subsection",
                          "number": "9.5.4.2.1.1",
                          "title": "Refutation of the belief in uncaused origination",
                          "verses_span": "116-117",
                          "verse_text_excerpt": "In everyday perception\nThere’s a cause for everything.\nThe different segments of the lotus flower\nArise from a variety of causes.\n\n“But what gives rise,” you ask, “to such variety of causes?”\nAn even earlier variety of causes, we declare.\n“And how,” you ask, “do causes give their fruits?”\nThrough power, we answer, of preceding causes.",
                          "children": []
                        },
                        {
                          "level": "sub-sub-sub-subsection",
                          "number": "9.5.4.2.1.2",
                          "title": "Refutation of the belief in other-production",
                          "verses_span": "118-126",
                          "children": [
                            {
                              "level": "sub-sub-sub-sub-subsection",
                              "number": "9.5.4.2.1.2.1",
                              "title": "Refutation of the belief in production from a permanent cause",
                              "verses_span": "118-126",
                              "verse_text_excerpt": "If Īshvara is held to be the cause of beings,\nYou must now define for us his nature.\nIf, by this, you simply mean the elements,\nNo need to tire ourselves disputing names!\n\nYet earth and other elements are many,\nImpermanent, inert, without divinity.\nTrampled underfoot, they are impure,\nAnd thus they cannot be a God Omnipotent.\n\nThe Deity cannot be space—inert and unproductive.\nHe cannot be the self, for this we have refuted.\nHe’s inconceivable, they say—then likewise his creatorship.\nIs there any point, therefore, to such a claim?\n\nWhat is it that he wishes to create?\nHas he made the self and all the elements?\nBut are not self and elements and he himself eternal?\nAnd consciousness, we know, arises from its object.\n\nPain and pleasure have, from all time, sprung from karma,\nSo tell us, what has his Divinity produced?\nAnd if there’s no beginning in the cause,\nHow can there be beginnings in its fruits?\n\nWhy are creatures not created constantly,\nFor Īshvara relies on nothing but himself?\nAnd if there’s nothing that he has not made,\nWhat remains on which he might depend?\n\nIf Īshvara depends, the cause of all\nIs but the meeting of conditions and not Īshvara.\nWhen these obtain, he cannot but create;\nWhen these are absent, he is powerless to make.\n\nIf Almighty God does not intend,\nBut yet creates, another thing has forced him.\nIf he wishes to create, he’s swayed by his desire.\nSo even though Creator, what of his omnipotence?\n\nThose who hold the permanence of particles\nWere indeed refuted earlier.",
                              "children": []
                            }
                          ]
                        },
                        {
                          "level": "sub-sub-sub-subsection",
                          "number": "9.5.4.2.1.3",
                          "title": "Refutation of the belief in self-production",
                          "verses_span": "127-140",
                          "children": [
                            {
                              "level": "sub-sub-sub-sub-subsection",
                              "number": "9.5.4.2.1.3.1",
                              "title": "Refutation of the primal substance",
                              "verses_span": "127-134",
                              "verse_text_excerpt": "The Sāṃkhyas are the ones who hold\nThat permanent prakṛiti is the cause of the evolving world.\n\n“Pleasure,” “pain,” “neutrality,” so-called,\nAre qualities which, when they rest\nIn equilibrium are termed “prakṛiti.”\nThe universe arises when this balance is disturbed.\n\nThree natures in a unity are disallowed,\nAnd thus prakṛiti is without existence.\nThese qualities likewise do not exist,\nFor each of them indeed is three.\n\nIf these qualities have no existence,\nA thing like sound is very far from plausible!\nAnd cloth and other mindless objects\nCannot be the seat of feelings such as pleasure.\n\n“But,” you say, “these things possess the nature of their cause.”\nBut have we not investigated “things” already?\nFor you the cause is “pleasure” and the like,\nAnd yet from pleasure, cloth has never sprung!\n\nPleasure, rather, is produced from cloth.\nIf this is nonexistent, pleasure likewise.\nAs for permanence of pleasure and the rest—\nWell, there’s a thing that’s never been observed!\n\nIf pleasure and the rest are manifestly present,\nHow comes it that they’re not perceived?\nAnd if you claim they take on subtle form,\nHow is it that they are both gross and subtle?\n\nIf coarseness is abandoned, subtlety assumed,\nSubtlety and grossness both lack permanence.\nSo why not grant that, in this way,\nAll things possess the character of transience?\n\nIf the coarser aspect is none other than the pleasure,\nIt’s clear that pleasure is itself impermanent.",
                              "children": []
                            },
                            {
                              "level": "sub-sub-sub-sub-subsection",
                              "number": "9.5.4.2.1.3.2",
                              "title": "The actual refutation of self-production: the main argument",
                              "verses_span": "135-140",
                              "verse_text_excerpt": "If you claim that what does not exist in any sense\n(Because it has no being) cannot manifest,\n\nAlthough you have denied the birth of things\nThat did not previously exist, it’s this that you’re now saying!\nBut if results exist within their cause,\nThose who eat their food consume their excrement.\n\nAnd likewise with the money they would spend on clothing,\nLet them rather buy the cotton grains to wear!\n“But,” you say, “the world is ignorant and blind.\nFor this is taught by ‘those who know the truth.’”\n\nThis knowledge must be present in the worldly too!\nAnd if they have it, why do they not see?\nIf now you say that what the worldly see has no validity,\nThis means that what they clearly see is false.\n\n“If,” you ask, “there’s no validity in valid knowledge,\nIs not all that it assesses false?\nAnd therefore it becomes untenable\nTo meditate on voidness, ultimate reality.”\n\nIf there is no object for analysis,\nThere can be no grasping of its nonexistence.\nAnd so deceptive objects of whatever kind\nWill also have a nonexistence equally deceptive.\n\nWhen therefore in one’s dream a child has died,\nThe state of mind that thinks it is no more\nSupplants the thought that it is living still.\nAnd yet both thoughts are equally deceptive.",
                              "children": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "level": "sub-sub-subsection",
                      "number": "9.5.4.2.2",
                      "title": "Conclusion of the argument",
                      "verses_span": "141-142",
                      "verse_text_excerpt": "Therefore, as we see through such investigation,\nNothing is that does not have a cause;\nAnd nothing is existent in its causes\nTaken one by one or in the aggregate.\n\nIt does not come from somewhere else,\nNeither does it stay nor yet depart.\nHow will what confusion takes for truth\nIn any sense be different from a mirage?",
                      "children": []
                    },
                    {
                      "level": "sub-sub-subsection",
                      "number": "9.5.4.2.3",
                      "title": "Investigation of the nature: the great interdependence argument",
                      "verses_span": "143-144",
                      "verse_text_excerpt": "Things, then, bodied forth by magic spells,\nAnd that which is displayed by dint of causes—\nWhence have these arisen? we should ask;\nAnd where they go to, that we should examine!\n\nWhat is seen when circumstances meet\nAnd is not seen in absence of the same\nIs not real; it is like an image in a mirror.\nHow can true existence be ascribed to it?",
                      "children": []
                    },
                    {
                      "level": "sub-sub-subsection",
                      "number": "9.5.4.2.4",
                      "title": "Investigation of the result: the argument that refutes the origination of the existent and the nonexistent effect",
                      "verses_span": "145-150",
                      "verse_text_excerpt": "What need is there for cause\nIn something that’s already real?\nBut then, what need is there for cause\nIn something that does not exist?\n\nEven through a hundred million causes,\nNo change takes place in nonexistent things,\nFor in that state of “non-thing,” how could “things” occur?\nAnd into what could nonexistent things transform?\n\nSince things cannot become when they are nonexistent,\nWhen could such existent things occur?\nFor insofar as entities do not arise,\nNonentities themselves will not depart.\n\nAnd if nonentity is not dispersed,\nNo chance is there for entity to manifest.\nAnd entity cannot be changed into nonentity,\nFor otherwise it has a double nature.\n\nThus there are no entities\nAnd likewise there’s no ceasing of the same.\nAnd therefore beings, each and every one,\nAre without origin and never cease.\n\nWandering beings, thus, resemble dreams,\nAnd also the banana tree, if you examine well.\nIn ultimate reality there’s no distinguishing\nBetween the states of sorrow and beyond all sorrow.",
                      "children": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "level": "section",
          "number": "9.6",
          "title": "The benefits of realizing emptiness",
          "verses_span": "151-167",
          "children": [
            {
              "level": "subsection",
              "number": "9.6.1",
              "title": "The equivalence of the eight worldly concerns",
              "verses_span": "151-154",
              "verse_text_excerpt": "With things that in this way are empty\nWhat is there to gain and what to lose?\nWho is there to pay me court and honors,\nAnd who is there to scorn and to revile me?\n\nPleasure, sorrow—whence do these arise?\nWhat is there to give me joy and pain?\nAnd if I search their very suchness,\nWho is craving? What is craved?\n\nExamine now this world of living beings:\nWho is there therein to pass away?\nWhat is there to come, and what has been?\nAnd who, indeed, are relatives and friends?\n\nMay beings like myself discern and grasp\nThat all things have the character of space!\nBut those who seek their happiness and ease,\nThrough disputes or enjoyments,",
              "children": []
            },
            {
              "level": "subsection",
              "number": "9.6.2",
              "title": "The effortless display of great compassion",
              "verses_span": "155-167",
              "verse_text_excerpt": "All are deeply troubled, or else thrilled with joy.\nThey suffer, strive, contend among themselves,\nSlashing, stabbing, injuring each other:\nThey live their lives engulfed in evil and travail.\n\nFrom time to time they surface in the states of bliss,\nAbandoning themselves to many pleasures.\nBut dying, down they fall to suffer torment,\nLong, unbearable, in realms of sorrow.\n\nMany are the chasms and abysses of existence,\nWhere the truth of suchness is not found.\nAll is contradiction, all denial;\nSuchness in this world is not like this.\n\nHere, exceeding all description,\nIs the shoreless sea of pain unbearable.\nHere it is that strength is low,\nAnd lives are flickering and brief.\n\nAll activities for sake of life and health,\nRelief of hunger and of weariness,\nTime consumed in sleep, all accident and injury,\nAnd sterile friendships with the childish—\n\nThus life passes quickly, meaningless.\nTrue discernment—hard it is to have!\nHow therefore shall we ever find the means\nTo curb the futile wanderings of the mind?\n\nFurther, evil forces work and strain\nTo cast us down into the states of woe;\nManifold are false, deceptive trails,\nAnd it is hard to dissipate our doubts.\n\nHard it is to find again this state of freedom,\nHarder yet to come upon enlightened teachers,\nHard, indeed, to turn aside the torrent of defilement!\nAlas, our sorrows fall in endless streams!\n\nAlas indeed that living beings,\nCarried on the flood of bitter pain,\nHowever terrible their plight may be,\nDo not perceive they suffer so!\n\nThey are like those who bathe themselves repeatedly\nAnd then proceed to scorch themselves with fire.\nThey suffer greatly in this way,\nYet there they stay, proclaiming loud their bliss.\n\nLikewise there are some who live and act\nAs though old age and death will never come to them.\nBut first they’re slain and then there comes\nThe dreadful fall into the states of loss.\n\nWhen shall I be able to allay and quench\nThe dreadful heat of suffering’s blazing fires\nWith plenteous rains of my own bliss\nThat pour torrential from my clouds of merit?\n\nMy wealth of merit gathered in,\nWith reverence but without conceptual target,\nWhen shall I reveal this truth of emptiness\nTo those who go to ruin through belief in real existence?",
              "children": []
            }
          ]
        }
      ]
    }
  ]
  