[
    {
      "level": "chapter-8",
      "title": "བསམ་གཏན་བསྟན་པ། - Chapter on Dhyana (Chapter 8)",
      "verses_span": "1-187",
      "summary": {
        "content_summary": "ལེའུ་འདིས་བརྩོན་འགྲུས་ཀྱི་སྟོབས་ཀྱིས་བསམ་གཏན་གྱི་ཏིང་ངེ་འཛིན་སྒྲུབ་པའི་ཐབས་ལམ་རིམ་པ་བཞིན་དུ་སྟོན་པར་བྱེད། དེའང་ཐོག་མར་ཏིང་ངེ་འཛིན་གྱི་མི་མཐུན་ཕྱོགས་རྣམ་གཡེང་སྤོང་བའི་ཆེད་དུ་འཇིག་རྟེན་གྱི་འདུ་འཛི་དང་ནང་གི་རྣམ་རྟོག་སྤོང་དགོས་པར་གདམས། དེ་ནས་བསམ་གཏན་དངོས་ཀྱི་གཞི་རུ་གྱུར་པའི་བྱང་ཆུབ་ཀྱི་སེམས་བསྒོམ་པའི་ཚུལ་ལ་བདག་གཞན་མཉམ་པ་དང་བདག་གཞན་བརྗེ་བའི་ཉམས་ལེན་ཟབ་མོ་རྣམས་རྒྱུ་མཚན་དང་དཔེ་དོན་དང་བཅས་ཏེ་རྒྱས་པར་བཤད། མཐར་བསྒོམ་པ་དེ་དག་ལ་བརྟེན་ནས་སེམས་དམིགས་པ་ལ་རྩེ་གཅིག་ཏུ་གནས་པའི་ཐབས་ལ་བརྩོན་དགོས་པར་བསྐུལ་མ་མཛད་དེ་ལེའུ་ཡོངས་སུ་རྫོགས་པར་བྱེད།",
        "key_concepts": [
          "བསམ་གཏན།",
          "ཞི་གནས།",
          "ལྷག་མཐོང༌།",
          "དབེན་པ།",
          "བདག་གཞན་མཉམ་པ།",
          "བདག་གཞན་བརྗེ་བ།",
          "བདག་འཛིན།",
          "གཞན་གཅེས་འཛིན།"
        ],
        "transformative_goal": "རྣམ་གཡེང་གི་རྒྱུ་འཇིག་རྟེན་གྱི་ཆགས་ཞེན་དང་རང་གཅེས་འཛིན་གྱི་བློ་སྤངས་ཏེ། ཞི་ལྷག་ཟུང་འབྲེལ་གྱི་ཏིང་ངེ་འཛིན་ལ་བརྟེན་ནས་གཞན་དོན་ཁོ་ན་སྒྲུབ་པའི་བྱང་ཆུབ་ཀྱི་སེམས་རྒྱུད་ལ་བརྟན་པོར་སྐྱེད་པ།",
        "function_in_hierarchy": "བདག་འཛིན་གྱི་གཉེན་པོ་ཤེས་རབ་ཀྱི་སྔོན་དུ་གཞན་གཅེས་འཛིན་གྱི་གཉེན་པོ་བསམ་གཏན་འདི་བསྟན་པས། ཕར་ཕྱིན་དྲུག་གི་རིམ་པའི་ནང་བརྩོན་འགྲུས་ལས་བྱུང་བའི་བསམ་གཏན་གྱི་ཉམས་ལེན་གྱི་གནད་རྣམས་ཆ་ཚང་བར་སྟོན་པའི་ལེའུ་ཡིན།",
        "inter_node_relationships": [
          {
            "related_node_id": "chapter-7",
            "relationship_type": "builds_on",
            "conceptual_bridge": "ལེའུ་བདུན་པས་བསྟན་པའི་བརྩོན་འགྲུས་ཀྱི་སྟོབས་དེ་ཉིད་ལེའུ་འདིའི་བསམ་གཏན་གྱི་ཏིང་ངེ་འཛིན་སྒྲུབ་པའི་ནུས་ཤུགས་སུ་འགྱུར་བས་ན་རྒྱུ་འབྲས་ཀྱི་འབྲེལ་བ་ཟབ་མོ་ཡོད།"
          },
          {
            "related_node_id": "chapter-9",
            "relationship_type": "is_prerequisite_for",
            "conceptual_bridge": "ལེའུ་འདིར་བསྟན་པའི་བསམ་གཏན་གྱི་སེམས་གནས་པའི་ཏིང་ངེ་འཛིན་ནི་ལེའུ་དགུ་པར་སྟོན་པའི་ཤེས་རབ་ཀྱི་ལྷག་མཐོང་སྐྱེ་བའི་རྟེན་མེད་དུ་མི་རུང་བ་ཡིན།"
          }
        ],
        "implicit_concepts": [
          "ཀུན་རྫོབ་དང་དོན་དམ་བྱང་ཆུབ་སེམས་གཉིས་ཀྱི་གཞི་རྟེན།",
          "སེམས་སྦྱོང་གི་གོ་རིམ།",
          "ཐེག་པ་ཆེན་པོའི་ཏིང་ངེ་འཛིན་གྱི་ཁྱད་ཆོས།"
        ],
        "pedagogical_strategy": "ཐོག་མར་མི་མཐུན་ཕྱོགས་ངོས་བཟུང་ནས་སྤོང་ཐབས་བསྟན། དེ་ནས་གཉེན་པོ་དངོས་ཀྱི་ཉམས་ལེན་རིམ་པ་བཞིན་དུ་བསྟན། མཐར་དེ་ལ་བརྩོན་པར་བསྐུལ་བ་སྟེ་རིམ་ཅན་གྱི་ཁྲིད་ལུགས་སྤྱོད་པ།",
        "intended_impact_on_reader": "བསམ་གཏན་སྒྲུབ་པ་ལ་དོན་གཉེར་དྲག་པོ་བསྐྱེད་པ་དང་། ལྷག་པར་དུ་བདག་གཞན་མཉམ་བརྗེའི་ཉམས་ལེན་ཟབ་མོ་ལ་བློ་ཁ་ཕྱོགས་ཏེ་སྙིང་རྗེ་ཆེན་པོ་རྒྱུད་ལ་སྐྱེད་པ།",
        "audience_assumptions": "ཀློག་པ་པོ་ནི་ཐེག་པ་ཆེན་པོའི་ལམ་ལ་ཞུགས་པའི་གང་ཟག་ཅིག་ཡིན་ལ། བརྩོན་འགྲུས་བསྟེན་ནས་སེམས་དམིགས་པ་ལ་འཇོག་པའི་ཐབས་ལམ་ཞིབ་ཕྲ་ཤེས་འདོད་ཡོད་པར་ཆ་འཇོག་བྱེད།"
      },
      "children": [
        {
          "level": "section-8.1",
          "title": "མཚམས་སྦྱར་བའི་སྒོ་ནས་མདོར་བསྟན་པ། - Brief Presentation Through Introduction",
          "verses_span": "1-1",
          "summary": {
            "content_summary": "ས་བཅད་འདིས་ལེའུ་སྔ་མ་དང་མཚམས་སྦྱར་ནས་བརྩོན་འགྲུས་ལ་བརྟེན་ནས་ཡིད་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་འཇོག་དགོས་པའི་རྒྱུ་མཚན་སྟོན། གལ་ཏེ་སེམས་རྣམ་པར་གཡེངས་ན་ཉོན་མོངས་པའི་དབང་དུ་ཤོར་ནས་སྡུག་བསྔལ་བར་འགྱུར་བས་ན་ཏིང་ངེ་འཛིན་གལ་ཆེ་བའི་ཚུལ་མདོར་བསྡུས་ནས་བསྟན།",
            "key_concepts": [
              "བརྩོན་འགྲུས།",
              "ཏིང་ངེ་འཛིན།",
              "རྣམ་པར་གཡེང་བ།",
              "ཉོན་མོངས།"
            ],
            "transformative_goal": "བསམ་གཏན་བསྒོམ་པའི་དགོས་པ་དང་གལ་ཆེའི་རང་བཞིན་ངོས་བཟུང་སྟེ། རྣམ་གཡེང་གི་ཉེས་དམིགས་ཤེས་ནས་ཏིང་ངེ་འཛིན་ལ་བརྩོན་པའི་བློ་བསྐྱེད་པ།",
            "function_in_hierarchy": "ལེའུ་སྔ་མ་བརྩོན་འགྲུས་ཀྱི་ལེའུ་དང་འབྲེལ་ནས་ལེའུ་འདིའི་བརྗོད་བྱ་གཙོ་བོ་ཏིང་ངེ་འཛིན་ངོ་སྤྲོད་བྱེད་པའི་སྒོ་འབྱེད་ཀྱི་ཚུལ་དུ་གནས།",
            "inter_node_relationships": [
              {
                "related_node_id": "chapter-7",
                "relationship_type": "builds_on",
                "conceptual_bridge": "བརྩོན་འགྲུས་ཀྱི་འབྲས་བུ་ནི་སེམས་མཉམ་པར་བཞག་པའི་ཏིང་ངེ་འཛིན་ཡིན་པར་བསྟན་པས། ལེའུ་སྔ་ཕྱི་གཉིས་རྒྱུ་འབྲས་ཀྱི་ཚུལ་དུ་སྦྲེལ་བར་བྱེད།"
              },
              {
                "related_node_id": "section-8.2",
                "relationship_type": "introduces",
                "conceptual_bridge": "ཏིང་ངེ་འཛིན་གྱི་དགོས་པ་བསྟན་པ་འདིས་དེ་སྒྲུབ་པའི་རྒྱུའམ་ཐབས་ལམ་ཤེས་འདོད་ཀྱི་བློ་བསྐྱེད་དེ། ས་བཅད་རྗེས་མའི་བརྗོད་བྱ་ལ་འཇུག་པའི་སྒོ་ལྟ་བུར་གྱུར།"
              }
            ],
            "implicit_concepts": [
              "རྒྱུ་འབྲས་ཀྱི་རྟེན་འབྲེལ།",
              "སེམས་ཀྱི་རང་དབང་།"
            ],
            "pedagogical_strategy": "མཚམས་སྦྱོར་དང་རྒྱུ་མཚན་བསྟན་པ། དགོས་པ་དང་ཉེས་དམིགས་གཉིས་ལྡན་གྱི་སྒོ་ནས་གདམས་པ།",
            "intended_impact_on_reader": "ལེའུ་འདིའི་གཞུང་དོན་ལ་སློབ་པའི་ཀུན་སློང་བརྟན་པོ་བསྐྱེད་པ་དང་། རྣམ་གཡེང་གི་ཉེས་པ་ལ་ཞེད་སྣང་སྐྱེས་ནས་དེ་སྤོང་བའི་འདུན་པ་བསྐྱེད་པ།",
            "audience_assumptions": "ཀློག་པ་པོས་བརྩོན་འགྲུས་ཀྱི་ལེའུ་སྦྱངས་ཟིན་པ་དང་། དེའི་འབྲས་བུ་ཅི་ཡིན་ཤེས་འདོད་ཡོད་པར་ཆ་འཇོག་བྱེད།"
          },
          "children": []
        },
        {
          "level": "section-8.2",
          "title": "བསམ་གཏན་འགྲུབ་པའི་རྒྱུ་ཚོགས་བཤད་པ། - Explanation of the Causes for Accomplishing Dhyana",
          "verses_span": "2-89",
          "summary": {
            "content_summary": "ས་བཅད་འདིས་བསམ་གཏན་གྱི་ཏིང་ངེ་འཛིན་འགྲུབ་པའི་རྒྱུ་གཙོ་བོ་གཉིས་ཏེ། ཕྱིའི་འདུ་འཛི་ལས་དབེན་པའི་ལུས་དབེན་པ་དང་། ནང་གི་འདོད་ཆགས་སོགས་ལས་དབེན་པའི་སེམས་དབེན་པ་གཉིས་རྒྱས་པར་སྟོན། དེ་ཡང་འཇིག་རྟེན་གྱི་བྱ་བ་སྤོང་བ་དང་ནང་གི་རྣམ་རྟོག་དོར་བའི་ཐབས་ལམ་རྣམས་ཞིབ་ཏུ་བཤད་ཡོད། ལྷག་པར་དུ་འདོད་ཡོན་ཏེ་བུད་མེད་དང་རྙེད་བཀུར་ལ་སོགས་པའི་ཉེས་དམིགས་རྣམས་རྒྱུ་མཚན་དུ་མའི་སྒོ་ནས་དགག་སྟེ། དེ་དག་ལས་སྐྱོ་བ་བསྐྱེད་ནས་དབེན་པའི་ཡོན་ཏན་ལ་དགའ་བ་བསྒོམ་དགོས་པར་གདམས།",
            "key_concepts": [
              "ལུས་དབེན།",
              "སེམས་དབེན།",
              "འཇིག་རྟེན་སྤང་བ།",
              "རྣམ་རྟོག་དོར་བ།",
              "འདོད་ཡོན་གྱི་ཉེས་དམིགས།",
              "དབེན་པའི་ཡོན་ཏན།"
            ],
            "transformative_goal": "བསམ་གཏན་གྱི་མི་མཐུན་ཕྱོགས་ཏེ་འཇིག་རྟེན་པའི་འདུ་འཛི་དང་འདོད་ཡོན་ལ་ཆགས་པའི་བློ་ལྡོག་སྟེ། ཏིང་ངེ་འཛིན་གྱི་མཐུན་རྐྱེན་དབེན་པའི་གནས་དང་དབེན་པའི་བསམ་པ་ལ་སྤྲོ་བ་དྲག་པོ་བསྐྱེད་པ།",
            "function_in_hierarchy": "འདི་ནི་ལེའུ་ཡོངས་ཀྱི་ནང་ནས་བསམ་གཏན་དངོས་ཀྱི་སྔོན་འགྲོའི་ཉམས་ལེན་ཏེ་མི་མཐུན་ཕྱོགས་སྤོང་བའི་རྒྱུ་ཚོགས་བསྟན་པའི་སྐབས་ཡིན། འདིས་རྗེས་ཀྱི་བསམ་གཏན་བསྒོམ་པ་དངོས་ལ་རྨང་གཞི་འདིང་བར་བྱེད།",
            "inter_node_relationships": [
              {
                "related_node_id": "section-8.1",
                "relationship_type": "elaborates",
                "conceptual_bridge": "ས་བཅད་སྔོན་མས་རྣམ་གཡེང་གི་ཉེས་པ་བསྟན་པ་ལ། འདིར་རྣམ་གཡེང་དེ་དག་གི་རྒྱུ་འཇིག་རྟེན་དང་རྣམ་རྟོག་ཡིན་པར་ངོས་བཟུང་ནས་དེ་དག་སྤོང་ཐབས་རྒྱས་པར་བཤད།"
              },
              {
                "related_node_id": "section-8.3",
                "relationship_type": "is_prerequisite_for",
                "conceptual_bridge": "འདིར་བསྟན་པའི་རྒྱུ་ཚོགས་ཏེ་དབེན་པ་མ་བསྟེན་པར་ས་བཅད་རྗེས་མར་གསལ་བའི་བདག་གཞན་མཉམ་བརྗེའི་བསམ་གཏན་ཟབ་མོ་བསྒོམ་མི་ནུས་པས། འདི་ནི་སྔོན་འགྲོའི་ཚུལ་དུ་གནས།"
              }
            ],
            "implicit_concepts": [
              "ངེས་འབྱུང་གི་བསམ་པ།",
              "རྒྱུ་དང་རྐྱེན་ལ་བརྟེན་པའི་ཆོས་ཉིད།"
            ],
            "pedagogical_strategy": "མདོར་བསྟན་དང་རྒྱས་བཤད། རྒྱུ་མཚན་དང་དཔེ་དོན་དུ་མའི་སྒོ་ནས་འདོད་ཡོན་གྱི་སྐྱོན་རྣམས་ཞིབ་འབྲི་བྱས་ཏེ་ཡིད་འབྱུང་བསྐྱེད་པ།",
            "intended_impact_on_reader": "འཇིག་རྟེན་གྱི་བྱ་བ་དང་འདོད་ཡོན་གྱི་ཆགས་ཞེན་ལ་སྙིང་པོ་མེད་པར་མཐོང་ནས། དེ་དག་སྤངས་ཏེ་དབེན་པའི་གནས་སུ་དགེ་སྦྱོར་ལ་བརྩོན་པའི་འདུན་པ་དྲག་པོ་སྐྱེད་པ།",
            "audience_assumptions": "ཀློག་པ་པོ་ཏིང་ངེ་འཛིན་སྒྲུབ་འདོད་ཡོད་ཀྱང་། འཇིག་རྟེན་གྱི་འདུ་འཛི་དང་འདོད་ཡོན་ལ་ཆགས་ཞེན་གྱི་འཆིང་བ་ལས་གྲོལ་དཀའ་བའི་གནས་སྐབས་སུ་ཡོད་པར་ཆ་འཇོག་བྱེད།"
          },
          "children": [
            {
              "level": "subsection-8.2.1",
              "title": "མདོར་བསྟན་པ། - Brief Explanation",
              "verses_span": "2-4",
              "summary": {
                "content_summary": "ས་བཅད་འདིས་བསམ་གཏན་འགྲུབ་པའི་རྒྱུ་གཙོ་བོ་རྣམས་མདོར་བསྡུས་ནས་སྟོན། དེ་ཡང་རྣམ་གཡེང་སྤོང་བ་ལ་ལུས་དང་སེམས་གཉིས་ཀ་དབེན་དགོས་པ་དང་། དེ་ཡང་འཇིག་རྟེན་སྤོང་བ་དང་རྣམ་རྟོག་དོར་བ་ལ་རག་ལས་པར་བསྟན། མཐར་ཞི་གནས་ནི་ལྷག་མཐོང་གི་རྟེན་ཡིན་པ་དང་། ཞི་གནས་དེ་ཉིད་ཀྱང་འཇིག་རྟེན་ལ་ཆགས་པ་མེད་པ་ལས་འགྲུབ་པར་གདམས་ནས་ཉམས་ལེན་གྱི་གོ་རིམ་གསལ་པོར་བསྟན།",
                "key_concepts": [
                  "ལུས་དབེན།",
                  "སེམས་དབེན།",
                  "འཇིག་རྟེན་སྤང་བ།",
                  "རྣམ་རྟོག་དོར་བ།",
                  "ཞི་གནས།",
                  "ལྷག་མཐོང༌།"
                ],
                "transformative_goal": "བསམ་གཏན་ནས་ཤེས་རབ་བར་གྱི་ལམ་གྱི་གོ་རིམ་དང་རྒྱུ་འབྲས་ཀྱི་འབྲེལ་བ་རགས་ཙམ་ཞིག་ངོས་བཟུང་སྟེ། ཉམས་ལེན་གྱི་རྨང་གཞི་འདིང་བ།",
                "function_in_hierarchy": "འདི་ནི་བསམ་གཏན་འགྲུབ་པའི་རྒྱུ་ཚོགས་ཀྱི་ས་བཅད་ནང་གི་སྔོན་འགྲོའི་གདམས་ངག་སྙིང་པོར་དྲིལ་ནས་བསྟན་པ་སྟེ། རྗེས་ཀྱི་རྒྱས་བཤད་རྣམས་ཀྱི་རྩ་བའམ་ས་བོན་ལྟ་བུར་གྱུར།",
                "inter_node_relationships": [
                  {
                    "related_node_id": "subsection-8.2.2",
                    "relationship_type": "is_summary_of",
                    "conceptual_bridge": "འདིར་མདོར་བསྟན་པའི་ “འཇིག་རྟེན་སྤང་བ་” དང་ “རྣམ་རྟོག་དོར་བ་” ཞེས་པའི་གནད་དེ་དག་ས་བཅད་རྗེས་མས་རྒྱས་པར་འགྲེལ་བཤད་བྱེད།"
                  }
                ],
                "implicit_concepts": [
                  "ལམ་རིམ་གྱི་དགོངས་པ།",
                  "ཐོས་བསམ་སྒོམ་གསུམ་གྱི་གོ་རིམ།"
                ],
                "pedagogical_strategy": "རྩ་བའི་རིགས་པ་མདོར་བསྡུས་ནས་སྟོན་པ། (Principle-first instruction) སྒྲུབ་བྱེད་ཀྱི་ལམ་རིམ་གསལ་པོར་བཀོད་པ།",
                "intended_impact_on_reader": "ཉམས་ལེན་གྱི་གོ་རིམ་མ་ནོར་བ་ཞིག་ཤེས་པར་བྱས་ནས། སྒྲུབ་པ་པོ་རང་ཉིད་ཀྱིས་ཐོག་མར་ཅི་ཞིག་ལ་འབད་དགོས་པ་གསལ་པོར་རྟོགས་པ།",
                "audience_assumptions": "ཀློག་པ་པོ་ནི་ཉམས་ལེན་དངོས་ལ་འཇུག་པར་སྤྲོ་བ་ཡོད་ཀྱང་། འགྲོ་ལུགས་ཀྱི་གོ་རིམ་གསལ་པོ་མི་ཤེས་པར་ཆ་འཇོག་བྱེད།"
              },
              "children": []
            },
            {
              "level": "subsection-8.2.2",
              "title": "རྒྱས་པར་བཤད་པ། - Detailed Explanation",
              "verses_span": "5-89",
              "summary": {
                "content_summary": "ས་བཅད་འདིས་གོང་དུ་མདོར་བསྟན་པའི་བསམ་གཏན་གྱི་རྒྱུ་གཉིས་ཏེ་འཇིག་རྟེན་སྤོང་བ་དང་རྣམ་རྟོག་དོར་བ་གཉིས་ཞིབ་རྒྱས་སུ་འགྲེལ། དང་པོ་འཇིག་རྟེན་སྤོང་བའི་སྐབས་སུ་ནང་གཉེན་བཤེས་དང་ཕྱི་རྙེད་བཀུར་ལ་ཆགས་པའི་ཉེས་དམིགས་རྣམས་བསྟན་ཏེ་དེ་དག་སྤངས་ནས་དབེན་པའི་ཡོན་ཏན་བསྟེན་དགོས་པར་གདམས། གཉིས་པ་རྣམ་རྟོག་དོར་བའི་སྐབས་སུ་རྣམ་རྟོག་གི་རྩ་བ་འདོད་ཆགས་ཀྱི་ཡུལ་ཏེ་བུད་མེད་དང་ནོར་སོགས་ཀྱི་ཉེས་དམིགས་རྣམས་རྒྱུ་དང་ངོ་བོ་དང་འབྲས་བུའི་སྒོ་ནས་རྒྱས་པར་བསྟན་ནས་དེ་དག་ལ་སྐྱོ་བ་བསྐྱེད་དགོས་པར་བཤད།",
                "key_concepts": [
                  "བྱིས་པ་དང་འགྲོགས་པའི་ཉེས་པ།",
                  "རྙེད་བཀུར་ལ་ཆགས་པའི་སྐྱོན།",
                  "དབེན་པའི་ཡོན་ཏན།",
                  "འདོད་ཆགས་ཀྱི་གཉེན་པོ།",
                  "མི་སྡུག་པ་བསྒོམ་པ།"
                ],
                "transformative_goal": "ཀུན་རྫོབ་ཀྱི་འཁྲུལ་སྣང་སྟེ་འཇིག་རྟེན་གྱི་འདུ་འཛི་དང་འདོད་ཡོན་གྱི་རང་བཞིན་ངོ་མ་དེ་སྐྱོན་ཅན་དང་སྡུག་བསྔལ་གྱི་རྒྱུ་ཡིན་པར་གཏིང་ཚུགས་པར་ཤེས་ཏེ། དེ་དག་ལ་ཞེན་པ་རྩད་ནས་ལོག་པར་བྱེད་པ།",
                "function_in_hierarchy": "འདི་ནི་བསམ་གཏན་གྱི་སྔོན་འགྲོ་དངོས་སམ་རྨང་གཞི་སྒྲུབ་པའི་ཉམས་ལེན་གྱི་སྐབས་ཡིན། འདིས་བསམ་པ་ངན་པ་དོར་ནས་བསམ་པ་བཟང་པོ་བསྐྱེད་པའི་ཐབས་ལམ་ཞིབ་ཕྲ་སྟོན།",
                "inter_node_relationships": [
                  {
                    "related_node_id": "subsection-8.2.1",
                    "relationship_type": "is_elaboration_of",
                    "conceptual_bridge": "འདིས་གོང་གི་མདོར་བསྟན་གྱི་དོན་རྣམས་ལ་རྒྱུ་མཚན་དང་དཔེ་དོན་ཞིབ་ཕྲ་སྦྱར་ནས་གཏན་ལ་འབེབས་པར་བྱེད།"
                  }
                ],
                "implicit_concepts": [
                  "བློ་སྦྱོང་།",
                  "སོ་སོར་རྟོག་པའི་ཤེས་རབ།"
                ],
                "pedagogical_strategy": "དབྱེ་ཞིབ་དང་རྒྱུ་མཚན་དགོད་པ། (Analytical Reasoning) ཉེས་དམིགས་དང་ཕན་ཡོན་གཉིས་ལྡན་གྱི་སྒོ་ནས་བློ་སྣ་བསྒྱུར་ཐབས་བྱེད་པ།",
                "intended_impact_on_reader": "འཇིག་རྟེན་གྱི་སྣང་བ་ལ་ཡིད་ཆེས་དང་ཞེན་པ་རྦད་དེ་ལོག་ནས། དབེན་པའི་གནས་སུ་སྒྲུབ་པ་སྙིང་པོར་བྱེད་འདོད་ཀྱི་བློ་བརྟན་པོ་སྐྱེད་པ།",
                "audience_assumptions": "ཀློག་པ་པོ་ལ་འཇིག་རྟེན་གྱི་འདོད་ཡོན་ལ་ཆགས་ཞེན་གྱི་གོམས་གཤིས་ཟབ་མོ་ཡོད་པས། དེ་ལྡོག་བྱེད་ཀྱི་རྒྱུ་མཚན་དང་གཉེན་པོ་ཤུགས་དྲག་ཅན་དགོས་པར་ཆ་འཇོག་བྱེད།"
              },
              "children": [
                {
                  "level": "subsubsection-8.2.2.1",
                  "title": "འཇིག་རྟེན་སྤང་བ། - Abandoning the Worldly",
                  "verses_span": "5-40",
                  "summary": {
                    "content_summary": "ས་བཅད་འདིས་འཇིག་རྟེན་སྤང་བའི་ཚུལ་རྒྱས་པར་སྟོན་ཏེ། དང་པོར་ནང་སེམས་ཅན་ཏེ་གཉེན་བཤེས་སོགས་ལ་ཆགས་པའི་ཉེས་དམིགས་བསྟན། དེ་ནས་ཕྱི་རྙེད་པ་དང་བཀུར་སྟི་སོགས་ལ་ཆགས་པའི་སྐྱོན་རྣམས་བཤད། མཐར་དེ་དག་སྤངས་ནས་དབེན་པའི་གནས་ཀྱི་ཡོན་ཏན་ལ་བརྟེན་ནས་སེམས་ཏིང་ངེ་འཛིན་ལ་ཇི་ལྟར་འཇོག་དགོས་པའི་ཚུལ་བཅས་རིམ་པ་གསུམ་གྱི་སྒོ་ནས་གསལ་བར་བྱེད།",
                    "key_concepts": [
                      "སེམས་ཅན་ལ་ཆགས་པ།",
                      "རྙེད་བཀུར་ལ་སྲེད་པ།",
                      "དབེན་པའི་གནས།"
                    ],
                    "transformative_goal": "འཇིག་རྟེན་གྱི་འདུ་འཛིའི་རྩ་བ་སྟེ་ནང་གི་མི་དང་ཕྱིའི་དངོས་པོ་ལ་ཆགས་པའི་བློ་ལྡོག་སྟེ། དེ་ལས་བྱུང་བའི་རྣམ་གཡེང་ཞི་ནས་དབེན་པའི་གནས་སུ་སེམས་གནས་པའི་ནུས་པ་བསྐྱེད་པ།",
                    "function_in_hierarchy": "འདི་ནི་བསམ་གཏན་གྱི་རྒྱུ་ལས་ལུས་དབེན་པ་སྒྲུབ་པའི་ཐབས་ལམ་དངོས་ཡིན། འདིས་ཕྱིའི་འདུ་འཛི་ལས་སེམས་བཀུག་ནས་ནང་གི་ཏིང་ངེ་འཛིན་ལ་རྨང་གཞི་འདིང་བར་བྱེད།",
                    "inter_node_relationships": [
                      {
                        "related_node_id": "subsubsection-8.2.2.2",
                        "relationship_type": "is_prerequisite_for",
                        "conceptual_bridge": "ཕྱིའི་འཇིག་རྟེན་གྱི་འདུ་འཛི་མ་སྤངས་པར་ནང་གི་རྣམ་རྟོག་དོར་དཀའ་བས། ས་བཅད་འདི་ནི་རྗེས་མའི་རྣམ་རྟོག་དོར་བའི་ཐབས་ཀྱི་སྔོན་འགྲོ་ལྟ་བུར་གྱུར།"
                      }
                    ],
                    "implicit_concepts": [
                      "འཁོར་བའི་ཉེས་དམིགས།",
                      "ཚུལ་ཁྲིམས་ཀྱི་བསླབ་པ།"
                    ],
                    "pedagogical_strategy": "ནང་དང་ཕྱི་ཞེས་དབྱེ་བ་ཕྱེ་ནས་རིམ་པས་འཆད་པ། སྤང་བྱའི་ཉེས་དམིགས་དང་བླང་བྱའི་ཕན་ཡོན་གཉིས་གཤིབ་བསྡུར་གྱི་སྒོ་ནས་གདམས་པ།",
                    "intended_impact_on_reader": "འཇིག་རྟེན་གྱི་བྱ་གཞག་ཐམས་ཅད་ལ་སྙིང་པོ་མེད་པར་མཐོང་ནས་དེ་དག་ལ་བློ་ལོག་སྟེ། དབེན་པའི་གནས་སུ་སྒྲུབ་པ་ལ་གཅིག་ཏུ་འབད་འདོད་ཀྱི་བསམ་པ་བསྐྱེད་པ།",
                    "audience_assumptions": "ཀློག་པ་པོ་ནི་འཇིག་རྟེན་གྱི་འབྲེལ་བ་དང་ལོངས་སྤྱོད་ལ་ཆགས་ཞེན་ཆེ་བས། དེ་དག་གི་ཉེས་པ་ཞིབ་མོར་མ་བསྟན་ན་སྤོང་མི་ནུས་པར་ཆ་འཇོག་བྱེད།"
                  },
                  "children": [
                    {
                      "level": "subsubsection-leaf-8.2.2.1.1",
                      "title": "ནང་སེམས་ཅན་གྱི་འཇིག་རྟེན་ལ་སྲེད་པ་སྤོང་བར་བྱ་བ། - Abandoning Craving for the Inner World of Sentient Beings",
                      "verses_span": "5-16",
                      "summary": {
                        "content_summary": "ས་བཅད་འདིས་འཇིག་རྟེན་གྱི་གཉེན་བཤེས་སོགས་ལ་ཆགས་པའི་ཉེས་དམིགས་རྣམས་སྟོན། གང་ལ་ཞེན་པའི་ཡུལ་དང་ཞེན་པ་པོ་གཉིས་ཀ་མི་རྟག་པ་དང་། ཆགས་པ་དེས་ཡང་དག་པའི་དོན་ལ་སྒྲིབ་ཅིང་། སྐྱོ་བའི་སེམས་འཇིག་པ། མཐར་མྱ་ངན་བསྐྱེད་པ་སོགས་ཀྱི་སྐྱོན་བསྟན། ལྷག་པར་དུ་བྱིས་པའི་རང་བཞིན་ཅན་གྱི་གྲོགས་པོ་རྣམས་ནི་མགུ་བར་དཀའ་བ་དང་། ཕན་པ་མི་འདོགས་པ། མི་དགེ་བའི་རྒྱུར་འགྲོ་བ་བཅས་ཀྱི་རྒྱུ་མཚན་གྱིས་དེ་དག་དང་ཐག་རིང་དུ་གནས་དགོས་པར་གདམས།",
                        "key_concepts": [
                          "སེམས་ཅན་ལ་ཆགས་པ།",
                          "མི་རྟག་པ།",
                          "བྱིས་པའི་རང་བཞིན།",
                          "མགུ་བར་དཀའ།",
                          "དབེན་པ།"
                        ],
                        "transformative_goal": "འཇིག་རྟེན་པའི་མཛའ་བཤེས་ལ་བརྟེན་པའི་བདེ་སྐྱིད་ནི་འཁྲུལ་སྣང་ཙམ་དང་སྡུག་བསྔལ་གྱི་རྒྱུ་ཡིན་པར་ངོས་ཟིན་ནས། དེ་དག་ལ་ཆགས་ཞེན་གྱི་འཆིང་བ་ལས་གྲོལ་ཏེ་ནང་སེམས་ཀྱི་ཞི་བདེ་འཚོལ་བ།",
                        "function_in_hierarchy": "འདི་ནི་འཇིག་རྟེན་སྤོང་བའི་ནང་ཚན་དང་པོ་སྟེ། རྣམ་གཡེང་གི་རྒྱུ་གཙོ་བོ་དང་པོ་སྟེ་མི་དང་འགྲོགས་པ་ལས་བྱུང་བའི་ཆགས་སྡང་སྤོང་བའི་ཐབས་སྟོན།",
                        "inter_node_relationships": [
                          {
                            "related_node_id": "subsubsection-leaf-8.2.2.1.2",
                            "relationship_type": "complements",
                            "conceptual_bridge": "ནང་གི་མི་ལ་ཆགས་པ་སྤོང་བ་འདིས་ཕྱིའི་དངོས་པོ་ལ་ཆགས་པ་སྤོང་བའི་ས་བཅད་རྗེས་མ་དང་མཉམ་དུ་འཇིག་རྟེན་གྱི་ཆགས་ཞེན་གྱི་ཕྱོགས་གཉིས་ཀ་ཁེབས་པར་བྱེད།"
                          }
                        ],
                        "implicit_concepts": [
                          "དགེ་བའི་བཤེས་གཉེན་གྱི་དགོས་པ།",
                          "འཁོར་བའི་གྲོགས་ཀྱི་ཉེས་དམིགས།"
                        ],
                        "pedagogical_strategy": "རྒྱུ་མཚན་དཔྱད་ཞིབ་དང་འབྲས་བུ་དབྱེ་ཞིབ། མི་རྟག་པ་དང་། རྒྱུ་འབྲས། བྱིས་པའི་སེམས་ཁམས་དབྱེ་ཞིབ་བཅས་ཀྱི་སྒོ་ནས་འཇིག་རྟེན་པའི་འབྲེལ་བའི་སྐྱོན་རྣམས་གསལ་སྟོན་བྱེད།",
                        "intended_impact_on_reader": "རང་གི་མཛའ་གྲོགས་དང་གཉེན་ཉེ་དུ་ལ་ཡོད་པའི་ཆགས་ཞེན་གྱི་བློ་ལ་བསྐྱར་ཞིབ་བྱེད་དུ་བཅུག་ནས། དེ་དག་གིས་རང་གི་ཉམས་ལེན་ལ་བར་ཆད་ཇི་ལྟར་བྱེད་ཚུལ་ཤེས་པར་བྱེད་པ།",
                        "audience_assumptions": "ཀློག་པ་པོ་ནི་གཉེན་དང་གྲོགས་པོ་ནི་བདེ་སྐྱིད་ཀྱི་རྟེན་ཡིན་པར་འཛིན་པའི་བློ་དང་ལྡན་པས། དེ་ལས་ལྡོག་པའི་རྒྱུ་མཚན་གསལ་པོ་དགོས་པར་ཆ་འཇོག་བྱེད།"
                      },
                      "children": []
                    },
                    {
                      "level": "subsubsection-leaf-8.2.2.1.2",
                      "title": "ཕྱི་རྙེད་སོགས་ཀྱི་འཇིག་རྟེན་ལ་སྲེད་པ་སྤོང་བར་བྱ་བ། - Abandoning Craving for the Outer World of Possessions",
                      "verses_span": "17-24",
                      "summary": {
                        "content_summary": "ས་བཅད་འདིས་ཕྱིའི་འཇིག་རྟེན་ཏེ་རྙེད་པ་དང་། བཀུར་སྟི། སྙན་གྲགས་བཅས་ལ་ཆགས་པའི་ཉེས་དམིགས་སྟོན། ཆགས་ཡུལ་དེ་དག་མི་རྟག་ཅིང་འབྲལ་བའི་རང་བཞིན་ཡིན་པས་འཇིགས་པ་སྐྱེད་པ་དང་། བསྟོད་སྨད་ལ་དགའ་སྡུག་བྱེད་པ་དོན་མེད་ཡིན་པ། ཐ་ན་རྒྱལ་བས་ཀྱང་སེམས་ཅན་ཐམས་ཅད་མགུ་བར་བྱ་མི་ནུས་ན་རང་ལྟ་བུས་སྨོས་ཅི་དགོས་པར་བསྟན། མཐར་བྱིས་པ་རྣམས་རང་དོན་མེད་པར་མི་དགའ་བས་མཛའ་བཤེས་སུ་མི་རུང་བར་གསུངས་ནས་རྙེད་བཀུར་གྱི་ཆགས་ཞེན་སྤོང་དགོས་པར་གདམས།",
                        "key_concepts": [
                          "རྙེད་པ་དང་བཀུར་སྟི།",
                          "སྙན་གྲགས།",
                          "ཆགས་པའི་ཉེས་དམིགས།",
                          "འཇིག་རྟེན་ཆོས་བརྒྱད།",
                          "བྱིས་པའི་རང་དོན།"
                        ],
                        "transformative_goal": "འཇིག་རྟེན་ཆོས་བརྒྱད་ཀྱི་སྣང་བ་ལ་སྙིང་པོ་མེད་པར་རྟོགས་ཏེ། བསྟོད་སྨད་དང་རྙེད་བཀུར་ལ་མི་ལྟོས་པའི་བཏང་སྙོམས་ཀྱི་བློ་བརྟན་པོ་བསྐྱེད་པ།",
                        "function_in_hierarchy": "འདི་ནི་འཇིག་རྟེན་སྤོང་བའི་ནང་ཚན་གཉིས་པ་སྟེ། ནང་སེམས་ཅན་ལ་ཆགས་པ་སྤངས་པའི་རྗེས་སུ་ཕྱིའི་དངོས་པོ་དང་སྙན་གྲགས་ལ་ཆགས་པ་སྤོང་བའི་ཐབས་སྟོན་པས་རྣམ་གཡེང་གི་རྒྱུ་གཉིས་ཀ་སྤོང་བར་བྱེད།",
                        "inter_node_relationships": [
                          {
                            "related_node_id": "subsubsection-leaf-8.2.2.1.1",
                            "relationship_type": "complements",
                            "conceptual_bridge": "ས་བཅད་སྔོན་མས་མི་ལ་ཆགས་པ་སྤོང་བ་དང་། འདིས་དངོས་པོ་དང་སྙན་གྲགས་ལ་ཆགས་པ་སྤོང་བར་བསྟན་པས། འཇིག་རྟེན་གྱི་ཆགས་ཡུལ་གཙོ་བོ་གཉིས་ཀ་ལ་གཉེན་པོ་བསྟེན་ཚུལ་ཆ་ཚང་བར་སྟོན།"
                          },
                          {
                            "related_node_id": "subsubsection-leaf-8.2.2.1.3",
                            "relationship_type": "contrasts_with",
                            "conceptual_bridge": "འདིར་བསྟན་པའི་འཇིག་རྟེན་གྱི་ཉེས་དམིགས་རྣམས་ནི་ས་བཅད་རྗེས་མར་སྟོན་པའི་དབེན་པའི་ཡོན་ཏན་གྱི་ལྡོག་ཕྱོགས་ཡིན་པས། ཕན་ཚུན་བསྡུར་ནས་དབེན་པའི་ཁྱད་ཆོས་གསལ་བར་བྱེད།"
                          }
                        ],
                        "implicit_concepts": [
                          "བཏང་སྙོམས།",
                          "རང་གཞན་གྱི་བློའི་བདེན་འཛིན།"
                        ],
                        "pedagogical_strategy": "རིགས་པའི་སྒོ་ནས་དحضོད་པ་དང་དགག་པ་བྱེད་པ། (Logical refutation) དཔེ་དོན་སྦྱར་ནས་གནད་དོན་གསལ་བཤད་བྱེད་པ། (Illustration through examples)",
                        "intended_impact_on_reader": "གཞན་གྱི་བསྟོད་སྨད་དང་རྙེད་བཀུར་ལ་རེ་དོགས་ཀྱིས་མི་བཅིང་བའི་སེམས་ཀྱི་རང་དབང་དང་བརྟན་བརླིང་གི་ཚོར་བ་སྐྱེད་པ།",
                        "audience_assumptions": "ཀློག་པ་པོ་ནི་རྙེད་བཀུར་དང་སྙན་གྲགས་ལ་རིན་ཐང་ཆེན་པོ་ཡོད་པར་འཛིན་པས། དེ་དག་གི་སྙིང་པོ་མེད་ཚུལ་རིགས་པས་བསྒྲུབ་དགོས་པར་ཆ་འཇོག་བྱེད།"
                      },
                      "children": []
                    },
                    {
                      "level": "subsubsection-leaf-8.2.2.1.3",
                      "title": "སྤངས་ནས་དབེན་པའི་ཡོན་ཏན་བརྟེན་ཚུལ། - How to Rely on the Qualities of Solitude after Abandoning",
                      "verses_span": "25-40",
                      "summary": {
                        "content_summary": "ས་བཅད་འདིས་འཇིག་རྟེན་གྱི་འདུ་འཛི་སྤངས་ནས་དབེན་པའི་གནས་ཀྱི་ཡོན་ཏན་ལ་ཇི་ལྟར་བརྟེན་དགོས་པའི་ཚུལ་སྟོན། དབེན་པའི་གནས་སུ་རི་དྭགས་དང་བྱ་རྣམས་ཀྱིས་མི་སྙན་པ་མི་བརྗོད་པ་དང་། གནས་དང་ཡོ་བྱད་ལ་ཆགས་པ་མེད་པར་རང་དབང་དུ་སྤྱོད་པའི་བདེ་སྐྱིད་བསམ། ལྷག་པར་དུ་ལུས་འདི་ཉིད་ཀྱང་མཐར་འཇིག་པའི་ཆོས་ཅན་དང་། སྐྱེ་འཆི་གཅིག་པུར་བྱེད་དགོས་པ། གྲོགས་དང་བྲལ་དགོས་པ་བཅས་མི་རྟག་པའི་བསམ་པ་བསྒོམས་ནས་དབེན་པའི་གནས་སུ་སེམས་རྩེ་གཅིག་ཏུ་འཇོག་པའི་ཐབས་ལ་འབད་དགོས་པར་གདམས།",
                        "key_concepts": [
                          "དབེན་པའི་ཡོན་ཏན།",
                          "ཆགས་པ་མེད་པ།",
                          "མི་རྟག་པ་བསྒོམ་པ།",
                          "འཆི་བ་དྲན་པ།",
                          "སེམས་རྩེ་གཅིག་པ།"
                        ],
                        "transformative_goal": "འཇིག་རྟེན་གྱི་འདུ་འཛི་ལ་ཡིད་འབྱུང་ནས་དབེན་པའི་བདེ་སྐྱིད་ལ་མོས་པ་དྲག་པོ་བསྐྱེད་དེ། ནང་སེམས་ཏིང་ངེ་འཛིན་ལ་གནས་པའི་བློ་སྦྱོང་བ།",
                        "function_in_hierarchy": "འདི་ནི་འཇིག་རྟེན་སྤོང་བའི་ས་བཅད་ཀྱི་མཇུག་བསྡུ་བ་སྟེ། སྤང་བྱ་བསྟན་པའི་རྗེས་སུ་བླང་བྱ་སྟེ་དབེན་པའི་ཕན་ཡོན་བསྟན་ནས་བསམ་གཏན་ལ་འཇུག་པའི་འདུན་པ་བརྟན་པོ་བསྐྱེད་པར་བྱེད།",
                        "inter_node_relationships": [
                          {
                            "related_node_id": "subsubsection-leaf-8.2.2.1.2",
                            "relationship_type": "is_antidote_to",
                            "conceptual_bridge": "དབེན་པའི་ཡོན་ཏན་འདི་དག་ནི་ས་བཅད་སྔོན་མར་བསྟན་པའི་འཇིག་རྟེན་གྱི་རྙེད་བཀུར་དང་འདུ་འཛིའི་ཉེས་དམིགས་ཀྱི་གཉེན་པོ་དངོས་ཡིན།"
                          }
                        ],
                        "implicit_concepts": [
                          "ངེས་འབྱུང་གི་བསམ་པ།",
                          "ཆོག་ཤེས།",
                          "སོ་སོར་ཐར་པའི་སྡོམ་པ།"
                        ],
        "pedagogical_strategy": "ཡིད་ལ་སྨོན་པའི་ཚུལ་གྱིས་འཆད་པ། (Aspirational instruction) འཇིག་རྟེན་དང་དབེན་པ་གཉིས་ཀྱི་བདེ་སྡུག་གཤིབ་བསྡུར་གྱི་སྒོ་ནས་དབེན་པའི་ཡོན་ཏན་ལ་ཡིད་འགུགས་པ།",
                        "intended_impact_on_reader": "འཇིག་རྟེན་གྱི་བྱ་གཞག་ལ་སྙིང་པོ་མེད་པར་གཏིང་ནས་མཐོང་སྟེ། དབེན་པའི་གནས་སུ་སྒྲུབ་པ་སྙིང་པོར་བྱེད་པའི་སྤྲོ་བ་བརྟན་པོ་རྒྱུད་ལ་སྐྱེད་པ།",
                        "audience_assumptions": "ཀློག་པ་པོས་འཇིག་རྟེན་སྤོང་དགོས་པར་རྒྱུ་མཚན་ཤེས་ཀྱང་། དབེན་པའི་གནས་ཀྱི་བདེ་བ་དང་ཡོན་ཏན་ལ་ངེས་ཤེས་གསལ་པོ་མེད་པར་ཆ་འཇོག་བྱེད།"
                      },
                      "children": []
                    }
                  ]
                },
                {
                  "level": "subsubsection-8.2.2.2",
                  "title": "རྣམ་རྟོག་དོར་བ། - Casting Away Conceptual Thoughts",
                  "verses_span": "41-89",
                  "summary": {
                    "content_summary": "ས་བཅད་འདིས་ཏིང་ངེ་འཛིན་གྱི་འགལ་རྐྱེན་གཙོ་བོ་གཉིས་པ་སྟེ་ནང་གི་རྣམ་རྟོག་དོར་བའི་ཚུལ་རྒྱས་པར་སྟོན། དེའི་ནང་ནས་ཀྱང་རྣམ་རྟོག་གི་རྩ་བ་འདོད་ཆགས་ཀྱི་ཡུལ་ཏེ་བུད་མེད་དང་ནོར་ལོངས་སྤྱོད་ཀྱི་རང་བཞིན་ལ་དཔྱད་པ་གཏོང་། བུད་མེད་ཀྱི་ལུས་ནི་མི་གཙང་བའི་རང་བཞིན་ཡིན་པ་རྒྱུ་མཚན་དུ་མའི་སྒོ་ནས་བསྒྲུབས་ནས་དེ་ལ་ཆགས་པ་ལྡོག་པར་བྱེད། དེ་བཞིན་དུ་ནོར་ལོངས་སྤྱོད་རྣམས་ནི་ཉེས་དམིགས་མང་ལ་མནོག་ཆུང་བས་སྡུག་བསྔལ་གྱི་རྒྱུ་ཡིན་པར་བསྟན། མཐར་འདོད་ཡོན་དེ་དག་ལ་སྐྱོ་བ་བསྐྱེད་ནས་དབེན་པའི་ཡོན་ཏན་ལ་ཡིད་སྨོན་བྱེད་དགོས་པར་གདམས།",
                    "key_concepts": [
                      "རྣམ་རྟོག",
                      "འདོད་ཆགས།",
                      "མི་སྡུག་པ།",
                      "ལུས་ཀྱི་རང་བཞིན།",
                      "ནོར་གྱི་ཉེས་དམིགས།"
                    ],
                    "transformative_goal": "འདོད་ཆགས་ཀྱི་རྣམ་རྟོག་གི་འཆིང་བ་ལས་གྲོལ་བ། ཆགས་ཡུལ་གྱི་དངོས་པོའི་རང་བཞིན་ཕྱིན་ཅི་ལོག་ཏུ་འཛིན་པའི་བློ་ལྡོག་སྟེ། ཡང་དག་པའི་དོན་ལ་སེམས་གཏོད་པའི་ནུས་པ་བསྐྱེད་པ།",
                    "function_in_hierarchy": "འདི་ནི་བསམ་གཏན་གྱི་རྒྱུ་ཚོགས་ལས་སེམས་དབེན་པ་སྒྲུབ་པའི་ཐབས་ལམ་དངོས་ཡིན། ཕྱིའི་འདུ་འཛི་སྤངས་པའི་རྗེས་སུ་ནང་གི་རྣམ་རྟོག་གི་རྩ་བ་གཅོད་པའི་ཉམས་ལེན་གྱི་གནད་སྟོན།",
                    "inter_node_relationships": [
                      {
                        "related_node_id": "subsubsection-8.2.2.1",
                        "relationship_type": "builds_on",
                        "conceptual_bridge": "ཕྱིའི་འཇིག་རྟེན་སྤངས་ནས་དབེན་པར་གནས་ཀྱང་ནང་གི་རྣམ་རྟོག་མ་དོར་ན་ཏིང་ངེ་འཛིན་མི་འགྲུབ་པས། ས་བཅད་འདིས་སྔོན་མའི་ཉམས་ལེན་དེ་གཏིང་ཟབ་ཏུ་གཏོང་བར་བྱེད།"
                      }
                    ],
                    "implicit_concepts": [
                      "སོ་སོར་རྟོག་པའི་ཤེས་རབ།",
                      "འཁྲུལ་པའི་རང་བཞིན།",
                      "བདེན་འཛིན་གྱི་གཉེན་པོ།"
                    ],
                    "pedagogical_strategy": "དབྱེ་ཞིབ་དང་དགག་སྒྲུབ། (Analytical refutation) ཆགས་ཡུལ་གྱི་དངོས་པོའི་གྲུབ་ཆ་རྣམས་སོ་སོར་ཕྱེ་ནས་དེ་དག་གི་རང་བཞིན་ལ་དཔྱད་པ་བཏང་སྟེ་ཆགས་པ་ལྡོག་པར་བྱེད་པའི་ཐབས་ལམ་སྤྱོད་པ།",
                    "intended_impact_on_reader": "འདོད་ཡོན་གྱི་ཡུལ་རྣམས་ལ་ཆགས་ཞེན་གྱི་བློ་རང་ཤུགས་ཀྱིས་ཞི་ཞིང་། དེ་དག་ནི་སྡུག་བསྔལ་གྱི་རྒྱུ་ཙམ་དུ་མཐོང་ནས་དེ་ལ་ཡིད་འབྱུང་བའི་ཚོར་བ་བརྟན་པོ་སྐྱེད་པ།",
                    "audience_assumptions": "ཀློག་པ་པོ་ལ་འདོད་ཆགས་ཀྱི་རྣམ་རྟོག་ཤུགས་ཆེ་ཞིང་། དེ་སྤོང་བར་བྱེད་པ་ལ་ཡུལ་གྱི་རང་བཞིན་ལ་གཏིང་ཟབ་པའི་དཔྱད་པ་དང་རྒྱུ་མཚན་དགོས་པར་ཆ་འཇོག་བྱེད།"
                  },
                  "children": [
                    {
                      "level": "subsubsection-leaf-8.2.2.2.1",
                      "title": "མདོར་བསྟན་པ། - Brief Explanation",
                      "verses_span": "41-41",
                      "summary": {
                        "content_summary": "ཤོ་ལོ་ཀ་གཅིག་པོ་འདིས་རྣམ་རྟོག་དོར་དགོས་པའི་རྒྱུ་མཚན་མདོར་བསྡུས་ནས་སྟོན། འདོད་པའི་ཡོན་ཏན་ལ་ཆགས་པའི་རྣམ་རྟོག་ནི་ཚེ་འདི་དང་ཕྱི་མ་གཉིས་ཀར་ཕུང་ཁྲོལ་དང་སྡུག་བསྔལ་བསྐྱེད་པའི་རྒྱུ་ཡིན་པར་བསྟན་ནས། དེ་དོར་དགོས་པའི་གནད་གསལ་པོར་མཛད།",
                        "key_concepts": [
                          "འདོད་པ།",
                          "ཕུང་ཁྲོལ།",
                          "ཚེ་འདིའི་སྡུག་བསྔལ།",
                          "ཕྱི་མའི་སྡུག་བསྔལ།"
                        ],
                        "transformative_goal": "འདོད་པའི་རྣམ་རྟོག་ནི་བདེ་བའི་རྒྱུ་མ་ཡིན་པར་སྡུག་བསྔལ་གྱི་རྩ་བ་ཡིན་པར་ངོས་བཟུང་ནས། དེ་སྤོང་བའི་བློ་བསྐྱེད་པ།",
                        "function_in_hierarchy": "འདི་ནི་རྣམ་རྟོག་དོར་བའི་ས་བཅད་ཀྱི་སྒོ་འབྱེད་དང་འདྲ་སྟེ། རྗེས་ཀྱི་རྒྱས་བཤད་རྣམས་ཀྱི་བརྗོད་བྱ་སྙིང་པོར་བསྡུས་ནས་སྟོན་པའི་ཚུལ་དུ་གནས།",
                        "inter_node_relationships": [
                          {
                            "related_node_id": "subsubsection-leaf-8.2.2.2.2",
                            "relationship_type": "is_summary_of",
                            "conceptual_bridge": "འདིར་བསྟན་པའི་འདོད་པས་ཕུང་ཁྲོལ་བསྐྱེད་ཚུལ་དེ་ས་བཅད་རྗེས་མས་རྒྱས་པར་འགྲེལ་བཤད་བྱེད།"
                          }
                        ],
                        "implicit_concepts": [
                          "ལས་རྒྱུ་འབྲས།"
                        ],
                        "pedagogical_strategy": "རྒྱུ་འབྲས་ཀྱི་རྣམ་གཞག་མདོར་བསྡུས་ནས་སྟོན་པ། (Concise statement of cause and effect)",
                        "intended_impact_on_reader": "འདོད་པའི་རྣམ་རྟོག་ལ་ཉེན་ཚབས་ཆེ་བའི་ཚོར་བ་སྐྱེད་དུ་བཅུག་ནས། དེའི་རང་བཞིན་ཞིབ་ཏུ་ཤེས་འདོད་ཀྱི་བློ་སློང་བ།",
                        "audience_assumptions": "ཀློག་པ་པོས་འདོད་པ་ལ་བདེ་བའི་རྣམ་པ་ཡོད་པར་འཛིན་པས། ཐོག་མར་དེའི་ཉེས་པ་སྤྱི་ཡོངས་ནས་བསྟན་དགོས་པར་ཆ་འཇོག་བྱེད།"
                      },
                      "children": []
                    },
                    {
                      "level": "subsubsection-leaf-8.2.2.2.2",
                      "title": "རྒྱས་པར་བཤད་པ། - Detailed Explanation",
                      "verses_span": "42-89",
                      "summary": {
                        "content_summary": "ས་བཅད་འདིས་གོང་དུ་བསྟན་པའི་འདོད་པའི་ཉེས་དམིགས་རྒྱས་པར་འགྲེལ། དེའང་ནང་བུད་མེད་ལ་སྲེད་པ་སྤོང་བ་དང་། ཕྱི་རྙེད་པ་སོགས་ལ་སྲེད་པ་སྤོང་བ། དེ་དག་ལ་སྐྱོ་ནས་དབེན་པའི་ཡོན་ཏན་དྲན་པ་བཅས་ནང་ཚན་གསུམ་གྱི་སྒོ་ནས་སྟོན། དང་པོ་བུད་མེད་ལ་སྲེད་པ་སྤོང་བ་ལ་རྒྱུ་བསྒྲུབ་དཀའ་བ་དང་། ངོ་བོ་མི་གཙང་བ། འབྲས་བུ་གནོད་པ་མང་བ་བཅས་ཀྱི་སྒོ་ནས་དགག གཉིས་པ་རྙེད་པ་སོགས་ལ་སྲེད་པའི་ཉེས་པ་བསྟན། མཐར་དེ་དག་ལ་ཡིད་འབྱུང་བསྐྱེད་དེ་དབེན་པའི་གནས་ཀྱི་བདེ་སྐྱིད་ལ་ཡིད་སྨོན་བྱེད་དགོས་པར་གདམས།",
                        "key_concepts": [
                          "བུད་མེད་ལ་སྲེད་པ།",
                          "མི་གཙང་བ།",
                          "ནོར་ལ་ཆགས་པ།",
                          "དབེན་པའི་ཡོན་ཏན།"
                        ],
                        "transformative_goal": "འདོད་པའི་ཆགས་ཡུལ་གཙོ་བོ་རྣམས་ཀྱི་རང་བཞིན་ལ་གཏིང་ཟབ་པའི་དཔྱད་པ་བཏང་ནས། དེ་དག་ལ་ཆགས་པའི་རྣམ་རྟོག་རྩད་ནས་བཅད་དེ་སེམས་ཞི་བར་གནས་པར་བྱེད་པ།",
                        "function_in_hierarchy": "འདི་ནི་བསམ་གཏན་གྱི་འགལ་རྐྱེན་རྣམ་རྟོག་དོར་བའི་ཐབས་ལམ་གྱི་སྙིང་པོ་སྟེ། འདོད་ཆགས་ཀྱི་གཉེན་པོ་མི་སྡུག་པ་བསྒོམ་པའི་ཉམས་ལེན་ཞིབ་ཕྲ་བསྟན་པའི་སྐབས་ཡིན།",
                        "inter_node_relationships": [
                          {
                            "related_node_id": "subsubsection-leaf-8.2.2.2.1",
                            "relationship_type": "is_elaboration_of",
                            "conceptual_bridge": "འདིས་གོང་གི་མདོར་བསྟན་གྱི་དོན་ཏེ་འདོད་པས་ཕུང་ཁྲོལ་བསྐྱེད་ཚུལ་དེ་རྒྱུ་མཚན་དང་དཔྱད་པ་ཞིབ་མོས་གཏན་ལ་འབེབས།"
                          }
                        ],
                        "implicit_concepts": [
                          "འཁྲུལ་ཤེས།",
                          "དངོས་པོའི་གནས་ལུགས།"
                        ],
                        "pedagogical_strategy": "རྒྱུ་、ངོ་བོ།、འབྲས་བུ་གསུམ་གྱི་སྒོ་ནས་དབྱེ་ཞིབ་བྱེད་པ། (Analysis by cause, nature, and effect) སྐྱུག་བྲོ་བ་དང་ཡིད་འབྱུང་བ་སྐྱེད་པའི་ཐབས་ལམ་དྲག་པོ་སྤྱོད་པ།",
                        "intended_impact_on_reader": "འདོད་པའི་ཆགས་ཡུལ་རྣམས་ལ་བློ་ལོག་སྟེ་དེ་དག་མཐོང་ཐོས་དྲན་པ་ཙམ་གྱིས་ཀྱང་ཆགས་པ་མི་སྐྱེ་བར་ཡིད་འབྱུང་བའི་བསམ་པ་བརྟན་པོ་སྐྱེད་པ།",
                        "audience_assumptions": "ཀློག་པ་པོ་ལ་འདོད་ཆགས་ཀྱི་གོམས་གཤིས་ཤིན་ཏུ་བརྟན་པས། དེ་སྤོང་བ་ལ་རྒྱུ་མཚན་དྲག་པོ་དང་སེམས་འགུལ་ཐེབས་ངེས་ཀྱི་གདམས་ངག་དགོས་པར་ཆ་འཇོག་བྱེད།"
                      },
                      "children": [
                        {
                          "level": "leaf-node",
                          "title": "ནང་བུད་མེད་ལ་སྲེད་པ་སྤོང་བར་བྱ་བ། - Abandoning Craving for Women",
                          "verses_span": "42-80",
                          "summary": {
                            "content_summary": "ས་བཅད་འདིས་རྣམ་རྟོག་གི་རྩ་བ་བུད་མེད་ལ་སྲེད་པའི་ཆགས་པ་སྤོང་བའི་ཐབས་རྒྱས་པར་སྟོན། དེའང་རྒྱུ་བསྒྲུབ་དཀའ་ཞིང་ཉེས་པ་མང་བ། ངོ་བོ་ཤ་ཁྲག་རུས་པ་དང་མི་གཙང་བའི་རྫས་སྣ་ཚོགས་ཀྱི་ཕུང་པོ་ཡིན་པ། འབྲས་བུ་ཚེ་འདིར་འཐབ་རྩོད་དང་ཕྱི་མར་ངན་སོང་གི་སྡུག་བསྔལ་བསྐྱེད་པ་སོགས་རྒྱུ་མཚན་དུ་མའི་སྒོ་ནས་བསྒྲུབས། དེར་བརྟེན་དེ་ལ་ཆགས་པ་ནི་ཕྱིན་ཅི་ལོག་གི་བློ་ཡིན་པས་སྤང་དགོས་པར་ནན་ཏན་དུ་གདམས།",
                            "key_concepts": [
                              "མི་སྡུག་པ་བསྒོམ་པ།",
                              "ལུས་ཀྱི་མི་གཙང་བ།",
                              "ཆགས་པའི་ཉེས་དམིགས།",
                              "ཕྱིན་ཅི་ལོག"
                            ],
                            "transformative_goal": "བུད་མེད་ཀྱི་ལུས་ལ་མཛེས་ཤིང་སྡུག་པར་འཛིན་པའི་འཁྲུལ་བའི་བློ་ལྡོག་སྟེ། དེའི་རང་བཞིན་མི་གཙང་བར་རྟོགས་ནས་འདོད་ཆགས་ཀྱི་རྩ་བ་གཅོད་པ།",
                            "function_in_hierarchy": "འདི་ནི་འདོད་ཆགས་སྤོང་བའི་གཉེན་པོ་གཙོ་བོ་སྟེ་མི་སྡུག་པ་བསྒོམ་པའི་ཉམས་ལེན་དངོས་ཡིན། འདིས་རྣམ་རྟོག་གི་རྩ་བ་ཤུགས་ཆེ་ཤོས་ཤིག་ལ་དམིགས་ཏེ་གཉེན་པོ་བསྟེན།",
                            "inter_node_relationships": [
                              {
                                "related_node_id": "leaf-node 8.2.2.2.2",
                                "relationship_type": "is_part_of",
                                "conceptual_bridge": "བུད་མེད་ལ་སྲེད་པ་སྤོང་བ་འདི་ནི་འདོད་ཡོན་གྱི་རྣམ་རྟོག་དོར་བའི་ནང་གི་དཔེ་མཚོན་གཙོ་བོ་དང་གནད་འགག་ཆེ་ཤོས་ཡིན།"
                              }
                            ],
                            "implicit_concepts": [
                              "དངོས་པོའི་གཤིས་ལུགས།",
                              "བདེན་འཛིན།"
                            ],
                            "pedagogical_strategy": "དཔྱད་སྒོམ། དངོས་པོའི་རང་བཞིན་ལ་རྒྱུ་、ངོ་བོ།、འབྲས་བུ་གསུམ་གྱི་སྒོ་ནས་ཞིབ་ཏུ་དཔྱད་དེ་དེའི་སྐྱོན་མཐོང་ནས་ཞེན་པ་ལྡོག་པར་བྱེད་པའི་ཐབས་ལམ་སྤྱོད་པ།",
                            "intended_impact_on_reader": "བུད་མེད་ཀྱི་ལུས་ལ་ཆགས་སེམས་སྐྱེས་ཚེ་དེའི་རང་བཞིན་མི་གཙང་བ་དང་སྡུག་བསྔལ་གྱི་རྒྱུ་ཡིན་པ་དྲན་ནས། ཆགས་སེམས་དེ་ཉིད་རང་སར་གྲོལ་བའི་ནུས་པ་ཐོབ་པ།",
                            "audience_assumptions": "ཀློག་པ་པོ་ནི་འདོད་ཆགས་ཀྱི་ནང་ནས་ཀྱང་བུད་མེད་ལ་ཆགས་པའི་ཞེན་པ་ཤུགས་ཆེ་བས། དེ་ལ་དམིགས་བསལ་གྱི་གཉེན་པོ་རྒྱས་པར་བསྟན་དགོས་པར་ཆ་འཇོག་བྱེད།"
                          },
                          "children": [
                            {
                              "level": "leaf-node",
                              "title": "རྒྱུ་བསྒྲུབ་དཀའ་བ། - The Difficulty in Acquiring the Cause",
                              "verses_span": "42-44",
                              "summary": {
                                "content_summary": "ས་བཅད་འདིས་འདོད་པའི་ཡུལ་ཏེ་བུད་མེད་བསྒྲུབ་པའི་རྒྱུ་རྐྱེན་རྣམས་ཤིན་ཏུ་དཀའ་ཚེགས་ཆེ་བའི་ཚུལ་སྟོན། བུད་མེད་ཅིག་གི་དོན་དུ་སྡིག་པ་དང་མི་སྙན་པའི་གྲགས་པ་ལ་མི་འཛེམས་པ། འཇིགས་པ་དང་དུ་ལེན་པ། ནོར་རྫས་ཟད་པར་གཏོང་བ་སོགས་དཀའ་སྤྱད་མང་པོ་བྱས་ཀྱང་མཐར་ཐོབ་པ་ནི་རུས་གོང་ཙམ་ལས་མེད་པས། དོན་མེད་པའི་ངལ་བ་འདི་ལ་ཅིའི་ཕྱིར་བརྩོན་ཞེས་སྲེད་པ་ལྡོག་པར་གདམས།",
                                "key_concepts": [
                                  "དཀའ་སྤྱད།",
                                  "སྡིག་པ།",
                                  "འཇིགས་པ།",
                                  "ནོར་རྫས་ཟད་པ།",
                                  "ཀེང་རུས།"
                                ],
                                "transformative_goal": "འདོད་ཡོན་བསྒྲུབ་པའི་ཆེད་དུ་ངལ་བ་དང་དཀའ་བ་དཔག་མེད་བྱེད་པ་ནི་སྙིང་པོ་མེད་པའི་བྱ་བ་ཡིན་པར་རྟོགས་ནས། བརྩོན་འགྲུས་དེ་དམ་པའི་ཆོས་སྒྲུབ་པའི་ཕྱོགས་སུ་བསྒྱུར་བ།",
                                "function_in_hierarchy": "འདི་ནི་བུད་མེད་ལ་སྲེད་པ་སྤོང་བའི་རྒྱུ་མཚན་དང་པོ་སྟེ། འདོད་ཡུལ་དེ་བསྒྲུབ་པའི་དཀའ་ཚེགས་བསྟན་ནས་དེ་ལ་ཞེན་པའི་བློ་འགོག་པའི་ཐབས་དང་པོ་ཡིན།",
                                "inter_node_relationships": [
                                  {
                                    "related_node_id": "leaf-node 45-71",
                                    "relationship_type": "precedes",
                                    "conceptual_bridge": "རྒྱུ་བསྒྲུབ་དཀའ་བ་བསྟན་པའི་རྗེས་སུ་དེ་ལྟར་བསྒྲུབས་པའི་འབྲས་བུའམ་ཡུལ་དེའི་ངོ་བོ་ཉིད་ཀྱང་མི་གཙང་བ་ཡིན་པར་བསྟན་ནས་དགག་པ་གཏིང་ཟབ་ཏུ་གཏོང་།"
                                  }
                                ],
                                "implicit_concepts": [
                                  "ངལ་བ་དོན་མེད།",
                                  "རྒྱུ་འབྲས་མི་མཚུངས་པ།"
                                ],
                                "pedagogical_strategy": "ཁེ་གྱོང་གི་དཔྱད་པ། (Cost-benefit analysis) བསྒྲུབ་བྱ་དེ་སྒྲུབ་བྱེད་ཀྱི་དཀའ་ཚེགས་དང་བསྡུར་ནས་དེའི་དོན་མེད་པའི་རང་བཞིན་གསལ་སྟོན་བྱེད།",
                                "intended_impact_on_reader": "འཇིག་རྟེན་གྱི་དོན་དུ་ངལ་བ་བྱེད་པ་ལ་ཡིད་སྐྱོ་བ་བསྐྱེད་ནས། དེ་ལས་དོན་ཆེ་བའི་བྱང་ཆུབ་སྒྲུབ་པ་ལ་བརྩོན་འདོད་ཀྱི་བསམ་པ་སྐྱེད་པ།",
                                "audience_assumptions": "ཀློག་པ་པོས་འདོད་ཡོན་གྱི་བདེ་བ་ནི་རིན་ཐང་ཆེ་བས་དེའི་ཆེད་དུ་དཀའ་བ་སྤྱད་འོས་པར་འཛིན་པས། དཀའ་སྤྱད་དེ་ཉིད་དོན་མེད་ཡིན་པར་བསྒྲུབ་དགོས་པར་ཆ་འཇོག་བྱེད།"
                              },
                              "children": []
                            },
                            {
                              "level": "leaf-node",
                              "title": "ངོ་བོ་མི་གཙང་བ་ཡིན་པར་བསམ་པ། - Contemplating the Impure Nature",
                              "verses_span": "45-71",
                              "summary": {
                                "content_summary": "ས་བཅད་འདིས་ཆགས་ཡུལ་གྱི་ལུས་དེའི་ངོ་བོ་ཉིད་མི་གཙང་བའི་རང་བཞིན་ཡིན་པ་རྒྱུ་མཚན་དུ་མའི་སྒོ་ནས་གཏན་ལ་འབེབས། གསོན་པའི་ཚེ་ཡང་དེའི་ལུས་ནི་རུས་པའི་གཟེབ་ལ་ཤ་ཁྲག་གི་འདམ་གྱིས་བྱུགས་པ་ཙམ་དང་། ནང་དུ་བཤང་གཅི་སོགས་མི་གཙང་བས་གང་བ། ཕྱི་ནས་དྲི་ཞིམ་བྱུགས་ཀྱང་རང་བཞིན་གྱི་དྲི་ང་བ་མི་འགྱུར་བ་སོགས་བསྟན། དེ་བཞིན་དུ་དུར་ཁྲོད་དུ་བོར་བའི་རོ་དང་བསྡུར་ནས་དེའི་མི་སྡུག་པའི་རང་བཞིན་ལ་བསམ་ནས་ཆགས་པ་ལྡོག་དགོས་པར་ནན་གྱིས་གདམས།",
                                "key_concepts": [
                                  "མི་གཙང་བ།",
                                  "ལུས་ཀྱི་རང་བཞིན།",
                                  "དུར་ཁྲོད་ཀྱི་བསྒོམ་པ།",
                                  "རེག་བྱ།",
                                  "ཁ་དོག",
                                  "དྲི་མ།"
                                ],
                                "transformative_goal": "མཛེས་སྡུག་ཏུ་སྣང་བའི་ཕྱི་ལྤགས་ཀྱི་འཁྲུལ་སྣང་ལས་བརྒལ་ཏེ། ལུས་ཀྱི་གནས་ལུགས་ངོ་མ་སྟེ་མི་གཙང་བའི་རང་བཞིན་མངོན་སུམ་དུ་མཐོང་ནས་འདོད་ཆགས་ཀྱི་ཞེན་པ་རྩད་ནས་སྤོང་བ།",
                                "function_in_hierarchy": "འདི་ནི་མི་སྡུག་པ་བསྒོམ་པའི་གནད་འགག་གཙོ་བོ་སྟེ། ཆགས་ཡུལ་དངོས་ཀྱི་རང་བཞིན་ལ་དཔྱད་པ་བཏང་ནས་ཆགས་པའི་རྩ་བ་གཅོད་པའི་ཐབས་གཙོ་བོ་ཡིན།",
                                "inter_node_relationships": [
                                  {
                                    "related_node_id": "leaf-node 42-44",
                                    "relationship_type": "deepens_argument_of",
                                    "conceptual_bridge": "རྒྱུ་བསྒྲུབ་དཀའ་བ་ཙམ་དུ་མ་ཟད། དཀའ་བས་བསྒྲུབས་པའི་འབྲས་བུ་དེ་ཉིད་ཀྱང་ངོ་བོ་མི་གཙང་བ་ཡིན་པར་བསྟན་པས། སྔོན་གྱི་དགག་པ་དེ་ཤུགས་ཆེ་རུ་གཏོང་།"
                                  },
                                  {
                                    "related_node_id": "leaf-node 72-80",
                                    "relationship_type": "is_cause_of",
                                    "conceptual_bridge": "ངོ་བོ་མི་གཙང་བ་འདི་ལ་ཆགས་པའི་འབྲས་བུར་ཚེ་འདི་དང་ཕྱི་མར་གནོད་པ་དང་སྡུག་བསྔལ་འབྱུང་ཚུལ་ས་བཅད་རྗེས་མས་སྟོན།"
                                  }
                                ],
                                "implicit_concepts": [
                                  "ཀུན་རྫོབ་བདེན་པའི་རང་བཞིན།",
                                  "བློའི་འཁྲུལ་ཚུལ།"
                                ],
                                "pedagogical_strategy": "དབྱེ་ཞིབ་དང་དཔྱད་སྒོམ། ལུས་ཀྱི་གྲུབ་ཆ་དང་། དེའི་རྒྱུ། དེའི་དྲི་དང་རེག་བྱ་སོགས་ཆ་ཤས་སོ་སོར་ཕྱེ་ནས་དེ་དག་གི་རང་བཞིན་ལ་དཔྱད་དུ་བཅུག་སྟེ་གཏན་ཚིགས་འགོད་པ།",
                                "intended_impact_on_reader": "ཆགས་ཡུལ་གྱི་ལུས་དེ་མཐོང་བ་ན་དེའི་མི་གཙང་བའི་རང་བཞིན་དྲན་ནས་ཆགས་སེམས་ཀྱི་ཚབ་ཏུ་ཡིད་འབྱུང་དང་སྐྱུག་བྲོ་བའི་ཚོར་བ་སྐྱེད་པ།",
                                "audience_assumptions": "ཀློག་པ་པོས་ལུས་ཀྱི་ཕྱི་ཡི་མཛེས་སྡུག་ལ་བརྟེན་ནས་ཆགས་པ་སྐྱེད་ཀྱི་དེའི་ནང་གི་རང་བཞིན་ལ་དཔྱད་པ་བཏང་མྱོང་མེད་པར་ཆ་འཇོག་བྱེད།"
                              },
                              "children": []
                            },
                            {
                              "level": "leaf-node",
                              "title": "འབྲས་བུ་གནོད་པ་མང་བར་བསམ་པ། - Contemplating the Many Harmful Results",
                              "verses_span": "72-80",
                              "summary": {
                                "content_summary": "ས་བཅད་འདིས་མི་གཙང་བའི་ལུས་ལ་ཆགས་པའི་འབྲས་བུར་ཚེ་འདི་དང་ཕྱི་མར་གནོད་པ་དང་སྡུག་བསྔལ་མང་པོ་འབྱུང་ཚུལ་སྟོན། དེའི་དོན་དུ་ནོར་བསྒྲུབ་དཀའ་ཞིང་། དཀའ་བས་བསྒྲུབས་ཀྱང་ལས་ངལ་གྱི་སྡུག་བསྔལ་དང་། གཞན་ཡུལ་དུ་འགྲོ་དགོས་པ། བྲན་དུ་འགྱུར་བ། ཐ་ན་སྲོག་ལ་བབས་པའི་གཡུལ་དུ་འཇུག་པ་སོགས་འཇིག་རྟེན་གྱི་སྡུག་བསྔལ་མཐའ་དག་གི་རྒྱུར་འགྱུར་བས་དེ་ལ་ཆགས་པ་སྤང་དགོས་པར་གདམས།",
                                "key_concepts": [
                                  "འབྲས་བུའི་ཉེས་དམིགས།",
                                  "འཚོ་བའི་སྡུག་བསྔལ།",
                                  "ལས་ཀྱི་དཀའ་སྤྱད།",
                                  "སྲོག་གི་འཇིགས་པ།"
                                ],
                                "transformative_goal": "འདོད་ཆགས་ནི་བདེ་བའི་རྒྱུ་མ་ཡིན་པར་ཚེ་འདིའི་སྡུག་བསྔལ་མཐའ་དག་གི་རྩ་བ་ཡིན་པར་གཏིང་ནས་རྟོགས་ཏེ། དེ་ལ་ཡིད་ཆེས་དང་རེ་བ་རྩད་ནས་གཅོད་པ།",
                                "function_in_hierarchy": "འདི་ནི་བུད་མེད་ལ་སྲེད་པ་སྤོང་བའི་རྒྱུ་མཚན་གསུམ་པ་སྟེ། རྒྱུ་བསྒྲུབ་དཀའ་བ་དང་ངོ་བོ་མི་གཙང་བ་བསྟན་པའི་མཇུག་ཏུ། དེ་ལ་བརྟེན་པའི་འབྲས་བུ་ཡང་སྡུག་བསྔལ་ཁོ་ན་ཡིན་པར་བསྟན་ནས་དགག་པ་མཐར་ཕྱིན་པར་བྱེད།",
                                "inter_node_relationships": [
                                  {
                                    "related_node_id": "leaf-node 45-71",
                                    "relationship_type": "is_result_of",
                                    "conceptual_bridge": "ས་བཅད་སྔོན་མར་བསྟན་པའི་ངོ་བོ་མི་གཙང་བ་དེ་ལ་ཆགས་པའི་རྣམ་སྨིན་ནམ་འབྲས་བུ་ནི་འདིར་བསྟན་པའི་གནོད་པ་དང་སྡུག་བསྔལ་རྣམས་ཡིན།"
                                  }
                                ],
                                "implicit_concepts": [
                                  "འཁོར་བའི་སྡུག་བསྔལ།",
                                  "རྒྱུ་འབྲས་ཀྱི་རྣམ་གཞག"
                                ],
                                "pedagogical_strategy": "དངོས་ཡོད་ཀྱི་དཔེ་རྗོད་པ། འཇིག་རྟེན་མི་རྣམས་ཀྱི་འཚོ་བའི་ནང་གི་དཀའ་ངལ་དང་སྡུག་བསྔལ་དངོས་རྣམས་དཔེར་བཀོད་ནས་དེ་དག་གི་རྒྱུ་འདོད་ཆགས་ལ་ཐུག་ཡོད་པར་སྟོན་པ།",
                                "intended_impact_on_reader": "འཇིག་རྟེན་གྱི་འཚོ་བ་སྒྲུབ་པའི་བྱ་བ་རྣམས་ལ་སྙིང་རྗེ་དང་ཆབས་ཅིག་ཡིད་སྐྱོ་བ་བསྐྱེད་ནས། དེ་ལས་ལྡོག་སྟེ་ཐར་པའི་ལམ་ལ་བརྩོན་པའི་འདུན་པ་བསྐྱེད་པ།",
                                "audience_assumptions": "ཀློག་པ་པོས་འཚོ་བའི་ཆེད་དུ་དཀའ་ལས་བྱེད་པ་ནི་སྤྱིར་བཏང་དང་དགོས་ངེས་ཅན་ཞིག་ཏུ་ལྟ་བས། དེ་དག་གི་རྒྱབ་ཀྱི་སྡུག་བསྔལ་གྱི་རང་བཞིན་གསལ་སྟོན་བྱེད་དགོས་པར་ཆ་འཇོག་བྱེད།"
                              },
                              "children": []
                            }
                          ]
                        },
                        {
                          "level": "leaf-node",
                          "title": "ཕྱི་རྙེད་སོགས་ལ་སྲེད་པ་སྤོང་བར་བྱ་བ། - Abandoning Craving for External Possessions",
                          "verses_span": "81-86",
                          "summary": {
                            "content_summary": "ས་བཅད་འདིས་ཕྱིའི་ནོར་རྫས་དང་ལོངས་སྤྱོད་ལ་སྲེད་པའི་ཉེས་དམིགས་རྣམས་སྟོན། ནོར་ནི་བསགས་པ་དང་། བསྲུང་བ། བརླག་པ་བཅས་དུས་གསུམ་ཀར་གདུང་བ་དང་སྡུག་བསྔལ་གྱི་རྒྱུ་ཡིན་པར་བསྟན། དེ་ལས་བྱུང་བའི་བདེ་བ་ནི་མནོག་ཆུང་ལ་ཉེས་དམིགས་ཤིན་ཏུ་ཆེ་བས། དེའི་ཆེད་དུ་རྙེད་དཀའི་དལ་འབྱོར་ཆུད་ཟོས་སུ་གཏོང་བ་ནི་ཤིན་ཏུ་མི་རིགས་པར་བསྟན། འདོད་ཡོན་གྱི་ཆེད་དུ་བསྒྲུབས་པའི་དཀའ་སྤྱད་ཀྱི་ཆ་ཤས་ཙམ་གྱིས་སངས་རྒྱས་ཀྱང་འགྲུབ་ནུས་པར་གསུངས་ནས་དེའི་དོན་མེད་པའི་རང་བཞིན་ནན་ཏན་དུ་བསྟན།",
                            "key_concepts": [
                              "ནོར་གྱི་ཉེས་དམིགས།",
                              "བསགས་བསྲུང་བརླག་པའི་སྡུག་བསྔལ།",
                              "མནོག་ཆུང་བ།",
                              "དལ་འབྱོར་དོན་ཆེན་པོ།"
                            ],
                            "transformative_goal": "ནོར་དང་ལོངས་སྤྱོད་ལ་བདེ་བའི་རྟེན་དུ་འཛིན་པའི་བློ་ལྡོག་སྟེ། དེ་དག་ནི་འཁོར་བར་འཆིང་བྱེད་དང་སྡུག་བསྔལ་གྱི་རྒྱུ་ཡིན་པར་རྟོགས་ནས་དེ་ལ་ཆོག་ཤེས་བསྟེན་པ།",
                            "function_in_hierarchy": "འདི་ནི་རྣམ་རྟོག་དོར་བའི་ནང་ཚན་གཉིས་པ་སྟེ། བུད་མེད་ལ་ཆགས་པ་སྤངས་པའི་རྗེས་སུ་ཆགས་ཡུལ་གཞན་ཏེ་ནོར་ལོངས་སྤྱོད་ལ་ཆགས་པ་སྤོང་བའི་ཐབས་སྟོན།",
                            "inter_node_relationships": [
                              {
                                "related_node_id": "leaf-node 42-80",
                                "relationship_type": "complements",
                                "conceptual_bridge": "ས་བཅད་སྔོན་མས་ནང་གི་ཆགས་ཡུལ་སྤོང་ཚུལ་དང་། འདིས་ཕྱིའི་ཆགས་ཡུལ་སྤོང་ཚུལ་བསྟན་པས། འདོད་པའི་ཡུལ་གཉིས་ཀ་ལ་གཉེན་པོ་ཆ་ཚང་བར་སྟོན།"
                              }
                            ],
                            "implicit_concepts": [
                              "ཆོག་ཤེས།",
                              "སྙིང་པོ་ལེན་པའི་བློ།"
                            ],
                            "pedagogical_strategy": "གཤིབ་བསྡུར་དང་ཁེ་གྱོང་གི་དཔྱད་པ། འཇིག་རྟེན་གྱི་དོན་དུ་བྱས་པའི་དཀའ་སྤྱད་དང་ཆོས་ཀྱི་དོན་དུ་བྱས་པའི་དཀའ་སྤྱད་གཉིས་བསྡུར་ནས་འཇིག་རྟེན་གྱི་བྱ་བའི་དོན་མེད་པའི་རང་བཞིན་གསལ་པོར་བྱེད།",
                            "intended_impact_on_reader": "ནོར་བསགས་པ་དང་སྲུང་བ་ལ་བརྩོན་པའི་བློ་ཞི་ནས། རང་གི་ནུས་ཤུགས་དང་དུས་ཚོད་རྣམས་དོན་ཆེན་དམ་པའི་ཆོས་སྒྲུབ་པ་ལ་བཀོལ་འདོད་ཀྱི་བསམ་པ་བསྐྱེད་པ།",
                            "audience_assumptions": "ཀློག་པ་པོས་ནོར་དང་ལོངས་སྤྱོད་ནི་འཚོ་བའི་རྟེན་དང་བདེ་སྐྱིད་ཀྱི་གཞི་མ་ཡིན་པར་འཛིན་པས། དེ་དག་གི་ཉེས་པ་དང་སྡུག་བསྔལ་གྱི་རང་བཞིན་གསལ་བཤད་བྱེད་དགོས་པར་ཆ་འཇོག་བྱེད།"
                          },
                          "children": []
                        },
                        {
                          "level": "leaf-node",
                          "title": "དབེན་པའི་ཡོན་ཏན་དྲན་པ། - Remembering the Qualities of Solitude",
                          "verses_span": "87-89",
                          "summary": {
                            "content_summary": "ས་བཅད་འདིས་འདོད་ཡོན་ལ་སྐྱོ་བ་བསྐྱེད་པའི་འབྲས་བུར་དབེན་པའི་ཡོན་ཏན་ལ་དགའ་བ་ཇི་ལྟར་བསྐྱེད་དགོས་པའི་ཚུལ་སྟོན། དབེན་པའི་གནས་ནི་རྩོད་པ་དང་ཉོན་མོངས་ཀྱིས་སྟོང་ཞིང་། གནས་ཉམས་དགའ་བ། རང་དབང་ཆེ་བ། ཆོག་ཤེས་ཀྱི་བདེ་བ་དང་ལྡན་པ་སོགས་ཡོན་ཏན་དུ་མ་དང་ལྡན་པས། དེ་ནི་ལྷའི་དབང་པོས་ཀྱང་རྙེད་པར་དཀའ་བའི་བདེ་སྐྱིད་ཅིག་ཡིན་པར་བསྟན་ནས་དེ་ལ་ཡིད་སྨོན་བསྐྱེད་དུ་འཇུག",
                            "key_concepts": [
                              "དབེན་པའི་ཡོན་ཏན།",
                              "ཆོག་ཤེས།",
                              "རང་དབང་གི་བདེ་བ།",
                              "ཞི་བ།"
                            ],
                            "transformative_goal": "འཇིག་རྟེན་གྱི་འདུ་འཛི་ལས་ཡིད་རྦད་དེ་ལོག་ནས། ནང་སེམས་ཀྱི་ཞི་བདེ་དང་རང་དབང་ལྡན་པའི་དབེན་པའི་གནས་ལ་སྙིང་ཐག་པ་ནས་དགའ་ཞེན་བསྐྱེད་པ།",
                            "function_in_hierarchy": "འདི་ནི་རྣམ་རྟོག་དོར་བའི་ས་བཅད་ཀྱི་མཇུག་བསྡུ་བ་སྟེ། སྤང་བྱ་འདོད་ཡོན་གྱི་ཉེས་དམིགས་བསྟན་པའི་རྗེས་སུ་བླང་བྱ་དབེན་པའི་ཕན་ཡོན་བསྟན་ནས་ཉམས་ལེན་གྱི་ཁ་ཕྱོགས་གསལ་པོར་སྟོན།",
                            "inter_node_relationships": [
                              {
                                "related_node_id": "leaf-node 81-86",
                                "relationship_type": "is_antidote_to",
                                "conceptual_bridge": "དབེན་པའི་ཡོན་ཏན་འདི་དག་ནི་ས་བཅད་སྔོན་མར་བསྟན་པའི་ནོར་ལ་སྲེད་པའི་སྡུག་བསྔལ་གྱི་གཉེན་པོ་དངོས་ཡིན།"
                              }
                            ],
                            "implicit_concepts": [
                              "ནང་གི་བདེ་སྐྱིད།",
                              "སាមញ្ញ་འཚོ་བ། (Simple living)"
                            ],
                            "pedagogical_strategy": "སྙན་ངག་གི་ཉམས་དང་ལྡན་པའི་སྒོ་ནས་དབེན་པའི་མཛེས་སྡུག་དང་བདེ་སྐྱིད་བརྗོད་པ། འཇིག་རྟེན་གྱི་འབྱོར་པ་དང་བསྡུར་ནས་དབེན་པའི་ཁྱད་འཕགས་ཀྱི་ཡོན་ཏན་གསལ་སྟོན་བྱེད་པ།",
                            "intended_impact_on_reader": "སེམས་ནང་དུ་དབེན་པའི་གནས་ལ་སྤྲོ་བ་དང་དགའ་བ་དྲག་པོ་སྐྱེད་དུ་བཅུག་ནས། ཏིང་ངེ་འཛིན་སྒྲུབ་པའི་མཐུན་རྐྱེན་བཟང་ཤོས་དེ་ལ་སྙིང་ནས་འཇུག་པའི་བློ་བསྐྱེད་པ།",
                            "audience_assumptions": "ཀློག་པ་པོས་འདོད་ཡོན་སྤངས་པའི་རྗེས་སུ་ཅི་ཞིག་བྱེད་དགོས་པ་དང་དེའི་བདེ་བ་གང་ཡིན་མི་ཤེས་པས། དབེན་པའི་གནས་ཀྱི་བདེ་སྐྱིད་ཀྱི་རྣམ་པ་གསལ་པོར་བསྟན་དགོས་པར་ཆ་འཇོག་བྱེད།"
                          },
                          "children": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "level": "section-8.3",
          "title": "བསམ་གཏན་བསྒོམ་པ་དངོས། - The Actual Meditation of Dhyana",
          "verses_span": "90-187",
          "summary": {
            "content_summary": "ས་བཅད་འདིས་སྔོན་འགྲོ་དབེན་པ་བསྟེན་པའི་རྗེས་སུ་བསམ་གཏན་དངོས་ཏེ་ཀུན་རྫོབ་བྱང་ཆུབ་ཀྱི་སེམས་ཇི་ལྟར་བསྒོམ་པའི་ཚུལ་རྒྱས་པར་སྟོན། དེའང་ཐོག་མར་བདག་གཞན་མཉམ་པའི་བསམ་པ་བསྒོམ་ཚུལ་རྒྱུ་མཚན་དང་བཅས་ཏེ་བསྟན། དེ་ནས་དེ་ལས་ཀྱང་གཏིང་ཟབ་པའི་བདག་གཞན་བརྗེ་བའི་ཉམས་ལེན་གྱི་གནད་རྣམས་ཞིབ་ཏུ་བཤད། དེ་ཡང་བདག་གཅེས་འཛིན་གྱི་ཉེས་དམིགས་དང་གཞན་གཅེས་འཛིན་གྱི་ཕན་ཡོན་གསལ་པོར་བསྟན་ནས། རང་དོན་ཡིད་བྱེད་ཀྱི་སེམས་དེ་དགྲ་བཞིན་དུ་བལྟས་ནས་བཀག་སྡོམ་དང་ཚར་གཅོད་བྱེད་དགོས་པར་ནན་གྱིས་གདམས། མཐར་ཏིང་ངེ་འཛིན་གྱི་སྒྲིབ་པ་རྣམས་བཟློག་སྟེ་མཉམ་པར་བཞག་དགོས་པས་ལེའུ་མཇུག་བསྡུས།",
            "key_concepts": [
              "བྱང་ཆུབ་སེམས་བསྒོམ་པ།",
              "བདག་གཞན་མཉམ་པ།",
              "བདག་གཞན་བརྗེ་བ།",
              "བདག་གཅེས་འཛིན་གྱི་ཉེས་དམིགས།",
              "གཞན་གཅེས་འཛིན་གྱི་ཕན་ཡོན།",
              "ཏིང་ངེ་འཛིན་གྱི་སྒྲིབ་པ།"
            ],
            "transformative_goal": "རང་གཅེས་འཛིན་གྱི་བློ་ངན་རྩད་ནས་སྤངས་ཏེ། གཞན་གཅེས་འཛིན་གྱི་བྱང་ཆུབ་ཀྱི་སེམས་རིན་པོ་ཆེ་རྒྱུད་ལ་བརྟན་པོར་སྐྱེད་ཅིང་། དེའི་ངང་ནས་སེམས་དམིགས་པ་ལ་མཉམ་པར་འཇོག་པའི་ནུས་པ་ཐོབ་པ།",
            "function_in_hierarchy": "འདི་ནི་ལེའུ་ཡོངས་ཀྱི་སྙིང་པོ་སྟེ། སྔོན་འགྲོ་རྣམས་གྲུབ་པའི་རྗེས་སུ་བསམ་གཏན་གྱི་ཉམས་ལེན་དངོས་ཏེ་ཐེག་པ་ཆེན་པོའི་སེམས་བསྐྱེད་བསྒོམ་པའི་ཚུལ་གཏན་ལ་འབེབས་པའི་སྐབས་ཡིན།",
            "inter_node_relationships": [
              {
                "related_node_id": "section-8.2",
                "relationship_type": "is_application_of",
                "conceptual_bridge": "ས་བཅད་སྔོན་མས་དབེན་པ་བསྟེན་པའི་རྗེས་སུ་ཅི་ཞིག་བསྒོམ་དགོས་ཞེ་ན། འདིར་བསྟན་པའི་བྱང་ཆུབ་ཀྱི་སེམས་བསྒོམ་དགོས་པར་བསྟན་པས། སྔོན་འགྲོ་དང་དངོས་གཞིའི་འབྲེལ་བ་གསལ་པོར་སྟོན།"
              }
            ],
            "implicit_concepts": [
              "ཀུན་རྫོབ་བྱང་ཆུབ་ཀྱི་སེམས།",
              "སྙིང་རྗེ་ཆེན་པོ།",
              "ཐབས་དང་ཤེས་རབ།"
            ],
            "pedagogical_strategy": "རིམ་ཅན་གྱི་ཁྲིད་ལུགས། དང་པོ་མཉམ་པ་ནས་དེ་ནས་བརྗེ་བའི་བློ་སྦྱོང་སྟེ་རིམ་པས་གཏིང་ཟབ་ཏུ་འགྲོ་བ། རྒྱུ་མཚན་དང་། གཉེན་པོ། ཉམས་ལེན་དངོས་བཅས་ཀྱི་སྒོ་ནས་གདམས་པ།",
            "intended_impact_on_reader": "བདག་གཅེས་འཛིན་ནི་དགྲ་ངོ་མ་ཡིན་པར་ངོས་ཟིན་པ་དང་། གཞན་གཅེས་འཛིན་ནི་བདེ་སྐྱིད་ཐམས་ཅད་ཀྱི་འབྱུང་ཁུངས་ཡིན་པར་ཡིད་ཆེས་བརྟན་པོ་ཐོབ་སྟེ། བདག་གཞན་བརྗེ་བའི་ཉམས་ལེན་ལ་སྙིང་ཐག་པ་ནས་འཇུག་པའི་བློ་བསྐྱེད་པ།",
            "audience_assumptions": "ཀློག་པ་པོ་ནི་བསམ་གཏན་དངོས་ལ་འཇུག་པར་སྤྲོ་བ་ཡོད་ལ། དེའི་ནང་ནས་ཀྱང་ཐེག་པ་ཆེན་པོའི་སེམས་བསྐྱེད་ཀྱི་ཉམས་ལེན་ཟབ་མོ་ལ་སློབ་པའི་སྣོད་དུ་རུང་བར་ཆ་འཇོག་བྱེད།"
          },
          "children": [
            {
              "level": "subsection-8.3.1",
              "title": "མཚམས་སྦྱར་ཏེ་མདོར་བསྟན་པ། - Introduced and Briefly Shown",
              "verses_span": "90-90",
              "summary": {
                "content_summary": "ཤོ་ལོ་ཀ་འདིས་བསམ་གཏན་དངོས་ཀྱི་སྐབས་ལ་འཇུག་པའི་སྒོ་འབྱེད་པར་མཛད། དབེན་པའི་ཡོན་ཏན་ལ་བསམས་ནས་ནང་གི་རྣམ་རྟོག་ཞི་བར་བྱས་པའི་རྗེས་སུ། བསྒོམ་བྱའི་སྙིང་པོ་ནི་བྱང་ཆུབ་ཀྱི་སེམས་ཡིན་པར་མདོར་བསྡུས་ནས་བསྟན།",
                "key_concepts": [
                  "དབེན་པའི་ཡོན་ཏན།",
                  "རྣམ་རྟོག་ཞི་བ།",
                  "བྱང་ཆུབ་སེམས་བསྒོམ་པ།"
                ],
                "transformative_goal": "སྔོན་འགྲོའི་ཉམས་ལེན་གྱི་དམིགས་ཡུལ་ནི་བྱང་ཆུབ་ཀྱི་སེམས་བསྒོམ་པའི་ཆེད་དུ་ཡིན་པ་ངོས་བཟུང་ནས། ཉམས་ལེན་དངོས་ལ་འཇུག་པའི་བློ་བསྐྱེད་པ།",
                "function_in_hierarchy": "ས་བཅད་སྔ་མ་སྔོན་འགྲོ་དང་རྗེས་མ་དངོས་གཞི་གཉིས་ཀྱི་བར་དུ་འབྲེལ་མཚམས་ཀྱི་ཟམ་པ་ལྟ་བུར་གྱུར།",
                "inter_node_relationships": [
                  {
                    "related_node_id": "section-8.2",
                    "relationship_type": "is_result_of",
                    "conceptual_bridge": "ས་བཅད་སྔོན་མར་བསྟན་པའི་དབེན་པ་བསྟེན་པའི་འབྲས་བུར་རྣམ་རྟོག་ཞི་ནས་བྱང་སེམས་བསྒོམ་པའི་གོ་སྐབས་འབྱུང་།"
                  },
                  {
                    "related_node_id": "subsection-8.3.2",
                    "relationship_type": "introduces",
                    "conceptual_bridge": "འདིར་བསྟན་པའི་ “བྱང་ཆུབ་སེམས་ནི་བསྒོམ་པར་བྱ།” ཞེས་པའི་དོན་དེ་ས་བཅད་རྗེས་མས་རྒྱས་པར་འགྲེལ་བཤད་བྱེད།"
                  }
                ],
                "implicit_concepts": [
                  "ཐབས་དང་ཤེས་རབ།"
                ],
                "pedagogical_strategy": "མཚམས་སྦྱོར་བའི་ཚུལ་གྱིས་མདོར་བསྟན་པ།",
                "intended_impact_on_reader": "སྔོན་འགྲོའི་ཉམས་ལེན་རྣམས་ཀྱི་དགོས་པ་མཐར་ཐུག་ཤེས་ཏེ། བསྒོམ་བྱའི་སྙིང་པོ་ལ་སློབ་པའི་དང་བ་བརྟན་པོ་སྐྱེད་པ།",
                "audience_assumptions": "ཀློག་པ་པོས་དབེན་པ་བསྟེན་པའི་དགོས་པ་ཤེས་ཟིན་པས། ད་ནི་དེར་ཅི་ཞིག་བསྒོམ་དགོས་པ་ཤེས་འདོད་ཡོད་པར་ཆ་འཇོག་བྱེད།"
              },
              "children": []
            },
            {
              "level": "subsection-8.3.2",
              "title": "བསམ་གཏན་བསྒོམ་ཚུལ་རྒྱས་པར་བཤད་པ། - Detailed Explanation of How to Meditate",
              "verses_span": "91-184",
              "summary": {
                "content_summary": "ས་བཅད་འདིས་བྱང་ཆུབ་ཀྱི་སེམས་བསྒོམ་པའི་ཚུལ་རྒྱས་པར་སྟོན་ལ། དེ་ལ་ཡང་རིམ་པ་གཉིས་ཡོད། དང་པོ་ནི་བདག་དང་གཞན་བདེ་བ་འདོད་པ་དང་སྡུག་བསྔལ་མི་འདོད་པ་ལ་ཁྱད་པར་མེད་པས་མཉམ་པར་བསྒོམ་ཚུལ་རྒྱུ་མཚན་དང་བཅས་ཏེ་བསྟན། གཉིས་པ་ནི་དེ་ལས་ཀྱང་ཁྱད་པར་དུ་འཕགས་པའི་བདག་གཞན་བརྗེ་བའི་ཉམས་ལེན་ཏེ། བདག་གཅེས་འཛིན་གྱི་སྐྱོན་དང་གཞན་གཅེས་འཛིན་གྱི་ཡོན་ཏན་ལ་བསམས་ནས་བདག་འཛིན་དགྲར་བལྟས་ཏེ་བསྒོམ་པའི་ཚུལ་རྣམས་གཏིང་ཟབ་ཅིང་ཞིབ་ཕྲ་བའི་སྒོ་ནས་གཏན་ལ་ཕབ།",
                "key_concepts": [
                  "བདག་གཞན་མཉམ་པ།",
                  "བདག་གཞན་བརྗེ་བ།",
                  "བདག་འཛིན།",
                  "གཞན་གཅེས་འཛིན།",
                  "སྙིང་རྗེ།",
                  "བློ་སྦྱོང་།"
                ],
                "transformative_goal": "གང་ཟག་གི་བདག་འཛིན་གྱི་ཞེན་པ་རྩད་ནས་བསྒྱུར་ཏེ། རང་དོན་ཡིད་བྱེད་ཀྱི་བློ་དོར་ནས་གཞན་དོན་སྒྲུབ་པ་ཁོ་ན་ལ་གཅིག་ཏུ་འབད་པའི་བྱང་ཆུབ་སེམས་དཔའི་བསམ་སྦྱོར་ངོ་མ་རྒྱུད་ལ་སྐྱེད་པ།",
                "function_in_hierarchy": "འདི་ནི་བསམ་གཏན་གྱི་ལེའུའི་ནང་གི་ཉམས་ལེན་གྱི་སྙིང་པོ་དང་རྩ་བ་ལྟ་བུ་ཡིན། འདིས་ཀུན་རྫོབ་བྱང་ཆུབ་སེམས་ཀྱི་ཉམས་ལེན་གྱི་གནད་འགག་ཐམས་ཅད་མ་ཚང་བ་མེད་པར་སྟོན།",
                "inter_node_relationships": [
                  {
                    "related_node_id": "subsection-8.3.1",
                    "relationship_type": "is_elaboration_of",
                    "conceptual_bridge": "འདིས་གོང་དུ་ “བྱང་ཆུབ་སེམས་ནི་བསྒོམ་པར་བྱ།” ཞེས་བསྟན་པ་དེ་ཇི་ལྟར་བསྒོམ་པའི་ཚུལ་རྒྱས་པར་འཆད།"
                  }
                ],
                "implicit_concepts": [
                  "བདག་མེད་རྟོགས་པའི་ཤེས་རབ།",
                  "ཐབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ།"
                ],
                "pedagogical_strategy": "རིམ་པ་གཉིས་ལྡན་གྱི་ཁྲིད་ལུགས། དང་པོ་གཞི་མཉམ་པ་ཉིད་བསྒོམ་པ་དང་། དེའི་སྟེང་དུ་ཁྱད་པར་བརྗེ་བའི་ཉམས་ལེན་བསྟན་པས་གོ་སླ་བ་ནས་དཀའ་བའི་རིམ་པར་འཁྲིད་པ།",
                "intended_impact_on_reader": "རང་གཅེས་འཛིན་གྱི་བློ་ལ་ངོ་ཚ་བ་དང་། དེ་སྤོང་འདོད་ཀྱི་བསམ་པ་དྲག་པོ་སྐྱེད་པ། གཞན་གཅེས་འཛིན་གྱི་བསམ་པ་ལ་དགའ་བ་དང་མོས་པ་བརྟན་པོ་ཐོབ་པ།",
                "audience_assumptions": "ཀློག་པ་པོ་ནི་རང་གཅེས་འཛིན་གྱི་བག་ཆགས་ཤིན་ཏུ་ཟབ་པས། དེ་ལྡོག་བྱེད་དུ་རིགས་པ་དང་། ལུང་། མན་ངག་བཅས་ཀྱི་གདམས་པ་ཟབ་མོ་དགོས་པར་ཆ་འཇོག་བྱེད།"
              },
              "children": [
                {
                  "level": "subsubsection-8.3.2.1",
                  "title": "བདག་གཞན་མཉམ་པ་བསྒོམ་ཚུལ། - How to Meditate on the Equality of Self and Other",
                  "verses_span": "91-110",
                  "summary": {
                    "content_summary": "ས་བཅད་འདིས་བདག་དང་གཞན་བདེ་བ་འདོད་པ་དང་སྡུག་བསྔལ་མི་འདོད་པ་ལ་ཁྱད་མེད་པས་མཉམ་པ་ཉིད་དུ་བསྒོམ་དགོས་པའི་ཚུལ་སྟོན། དེ་ཡང་བདག་གི་ལུས་ཀྱི་ཡན་ལག་རྣམས་ཐ་དད་ཀྱང་བསྲུང་བྱའི་ལུས་གཅིག་ཏུ་འཛིན་པ་ལྟར། འགྲོ་བ་རྣམས་ཀྱང་བདེ་སྡུག་གི་བློ་ལ་གཅིག་པས་བདག་བཞིན་བསྲུང་དགོས་པར་བསྟན། དེ་ལ་བདག་གཞན་དངོས་སུ་ཐ་དད་པས་སྡུག་བསྔལ་གྱིས་ཕན་ཚུན་མི་གནོད་ཅེས་པའི་རྩོད་པ་རྣམས་རྒྱུ་མཚན་གྱིས་སུན་ཕྱུང་། མཐར་དེ་ལྟར་གོམས་པས་གཞན་དོན་དུ་དམྱལ་བར་ཡང་སྤྲོ་བས་འཇུག་ནུས་པར་བསྟན།",
                    "key_concepts": [
                      "བདག་གཞན་མཉམ་པ།",
                      "བདེ་བ་འདོད་པ།",
                      "སྡུག་བསྔལ་མི་འདོད་པ།",
                      "བདག་ཏུ་འཛིན་པ།",
                      "རྒྱུད་དང་ཚོགས།"
                    ],
                    "transformative_goal": "རང་དང་གཞན་ཞེས་ཐ་དད་དུ་འཛིན་པའི་བློ་སྦུབས་དོག་པོ་ལས་གྲོལ་ཏེ། སེམས་ཅན་ཐམས་ཅད་རང་དང་འདྲ་བར་བདེ་བ་འདོད་ཅིང་སྡུག་བསྔལ་མི་འདོད་པ་ཤེས་ནས་སྙིང་རྗེ་དང་བྱམས་པའི་བསམ་པ་ཡོངས་ཁྱབ་ཏུ་བསྐྱེད་པ།",
                    "function_in_hierarchy": "འདི་ནི་བདག་གཞན་བརྗེ་བའི་བསྒོམ་པ་ཟབ་མོའི་སྔོན་འགྲོའམ་རྨང་གཞི་ལྟ་བུ་ཡིན། བདག་གཞན་མཉམ་པའི་བློ་མ་སྐྱེས་ན་དེ་གཉིས་བརྗེ་བའི་ཉམས་ལེན་འབྱུང་མི་སྲིད།",
                    "inter_node_relationships": [
                      {
                        "related_node_id": "subsubsection-8.3.2.2",
                        "relationship_type": "is_foundation_for",
                        "conceptual_bridge": "བདག་དང་གཞན་མཉམ་པར་རྟོགས་པ་འདིས་གཞན་གཅེས་པར་འཛིན་པ་དང་བདག་དོར་བའི་བློ་སྟེ་བརྗེ་བའི་ཉམས་ལེན་ལ་འཇུག་པའི་སྒོ་འབྱེད།"
                      }
                    ],
                    "implicit_concepts": [
                      "གང་ཟག་གི་བདག་མེད།",
                      "ཚད་མེད་བཞི།"
                    ],
                    "pedagogical_strategy": "རིགས་པའི་སྒོ་ནས་བསྒྲུབ་པ། དཔེ་དང་དོན་སྦྱར་ནས་གོ་བ་བསྐྱེད་པ། རྩོད་པ་སྤོང་བའི་ཚུལ་གྱིས་གཏན་ལ་འབེབས་པ།",
                    "intended_impact_on_reader": "རང་གཅེས་འཛིན་གྱི་བློ་དེ་རྒྱུ་མཚན་མེད་པའི་བློ་ཞིག་ཡིན་པར་ངོས་ཟིན་པ་དང་། གཞན་སེམས་ཅན་རྣམས་ལ་རང་དང་འདྲ་བའི་སྙིང་རྗེ་དང་གཅེས་སེམས་བསྐྱེད་པའི་འདུན་པ་སློང་བ།",
                    "audience_assumptions": "ཀློག་པ་པོས་བདག་དང་གཞན་གཉིས་ཐ་དད་དུ་བཟུང་ནས་རང་གཅེས་པར་འཛིན་པ་ནི་རང་བཞིན་ལྷན་སྐྱེས་ཤིག་ཏུ་འཛིན་པས། དེའི་རྒྱུ་མཚན་མེད་ཚུལ་རིགས་པས་བསྒྲུབ་དགོས་པར་ཆ་འཇོག་བྱེད།"
                  },
                  "children": [
                    {
                      "level": "leaf-node",
                      "title": "མདོར་བསྟན། - Brief Explanation",
                      "verses_span": "91-91",
                      "summary": {
                        "content_summary": "ཤོ་ལོ་ཀ་འདིས་བདག་གཞན་མཉམ་པ་བསྒོམ་པའི་གནད་འགག་མདོར་བསྡུས་ནས་སྟོན། དེ་ཡང་ཐོག་མར་བདག་དང་གཞན་གཉིས་བདེ་བ་འདོད་པ་དང་སྡུག་བསྔལ་མི་འདོད་པ་ལ་མཉམ་པས་ན། སེམས་ཅན་ཐམས་ཅད་བདག་རང་ཉིད་བཞིན་དུ་བསྲུང་དགོས་པར་གདམས།",
                        "key_concepts": [
                          "བདག་གཞན་མཉམ་པ།",
                          "བདེ་སྡུག་མཉམ་པ།",
                          "བདག་བཞིན་བསྲུང་བ།"
                        ],
                        "transformative_goal": "རང་གཅེས་འཛིན་གྱི་བློ་དོག་པོ་ལས་བརྒལ་ཏེ། གཞན་སེམས་ཅན་རྣམས་ཀྱང་རང་དང་འདྲ་བར་གཅེས་པར་འཛིན་པའི་བསམ་པའི་རྨང་གཞི་འདིང་བ།",
                        "function_in_hierarchy": "འདི་ནི་བདག་གཞན་མཉམ་པའི་བསྒོམ་བྱའི་རྩ་བའི་གདམས་ངག་སྟེ། རྗེས་ཀྱི་རྒྱས་བཤད་དང་རྩོད་སྤོང་ཐམས་ཅད་ཀྱི་རྩ་བ་ལྟ་བུར་གྱུར།",
                        "inter_node_relationships": [
                          {
                            "related_node_id": "leaf-node 92-107",
                            "relationship_type": "is_summary_of",
                            "conceptual_bridge": "འདིར་བསྟན་པའི་གདམས་ངག་དེ་ཤོ་ལོ་ཀ་རྗེས་མ་རྣམས་ཀྱིས་རྒྱུ་མཚན་དང་དཔེ་དོན་གྱིས་རྒྱས་པར་འགྲེལ།"
                          }
                        ],
                        "implicit_concepts": [
                          "བྱམས་པ་དང་སྙིང་རྗེའི་རྩ་བ།"
                        ],
                        "pedagogical_strategy": "རྩ་བའི་ལྟ་བ་ཐད་ཀར་སྟོན་པ། (Direct statement of the core principle)",
                        "intended_impact_on_reader": "བདག་གཞན་མཉམ་པར་བསྒོམ་པའི་ཉམས་ལེན་གྱི་སྙིང་པོ་ངོས་བཟུང་ནས། དེ་ལ་བརྟེན་ནས་བསྒོམ་པའི་འདུན་པ་བསྐྱེད་པ།",
                        "audience_assumptions": "ཀློག་པ་པོས་ཉམས་ལེན་གྱི་གནད་གང་ཡིན་ཤེས་འདོད་ཡོད་པར་ཆ་འཇོག་བྱེད།"
                      },
                      "children": []
                    },
                    {
                      "level": "leaf-node",
                      "title": "རྒྱས་བཤད། - Detailed Explanation",
                      "verses_span": "92-107",
                      "summary": {
                        "content_summary": "ས་བཅད་འདིས་བདག་གཞན་མཉམ་པའི་དོན་རྒྱུ་མཚན་དང་དཔེ་ཡི་སྒོ་ནས་རྒྱས་པར་འགྲེལ། དཔེར་ན་ལུས་ཀྱི་ཡན་ལག་རྣམས་ཐ་དད་ཀྱང་གཅིག་ཏུ་བསྲུང་བ་བཞིན་དུ་འགྲོ་བ་ཀུན་ཀྱང་བདེ་བ་འདོད་པ་ལ་གཅིག་པས་བསྲུང་དགོས་པར་བསྟན། དེ་ལ་བདག་གཞན་ཐ་དད་པས་སྡུག་བསྔལ་གྱིས་མི་གནོད་ཅེས་པའི་རྩོད་པ་དང་། བདག་འཛིན་གོམས་པས་ཡིན་ཞེས་པའི་རྩོད་པ་རྣམས་རྒྱུད་དང་ཚོགས་པ་བརྫུན་པར་བསྒྲུབས་ནས་སུན་ཕྱུང་། མཐར་སྡུག་བསྔལ་ནི་བདག་པོ་མེད་པས་གང་ཡིན་ཡང་བསལ་བྱ་ཡིན་པ་དང་། སྙིང་རྗེའི་སྡུག་བསྔལ་ནི་སྡུག་བསྔལ་ཆེན་པོ་སེལ་བྱེད་ཡིན་པས་དང་དུ་བླང་བྱ་ཡིན་པར་བསྟན།",
                        "key_concepts": [
                          "བདག་ཏུ་ཞེན་པ།",
                          "རྒྱུད་དང་ཚོགས།",
                          "བདག་པོ་མེད་པའི་སྡུག་བསྔལ།",
                          "སྙིང་རྗེའི་སྡུག་བསྔལ།"
                        ],
                        "transformative_goal": "རང་གཅེས་འཛིན་དང་གཞན་སྣང་ཆུང་བའི་བློ་དེ་རྒྱུ་མཚན་མེད་པའི་འཁྲུལ་བ་ཡིན་པར་རིགས་པས་གཏིང་ཚུགས་པར་ཤེས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་རང་གི་ལྟར་བསལ་འདོད་ཀྱི་བསམ་པ་བསྐྱེད་པ།",
                        "function_in_hierarchy": "འདི་ནི་བདག་གཞན་མཉམ་པའི་ལྟ་བ་དེ་རིགས་པའི་ལམ་ནས་གཏན་ལ་འབེབས་པའི་སྐབས་ཡིན། འདིས་ལྟ་བ་དེ་ལ་ཡིད་ཆེས་བརྟན་པོ་བསྐྱེད་པར་བྱེད།",
                        "inter_node_relationships": [
                          {
                            "related_node_id": "leaf-node 91-91",
                            "relationship_type": "provides_reasoning_for",
                            "conceptual_bridge": "འདིས་ཤོ་ལོ་ཀ་སྔོན་མར་བསྟན་པའི་ “ཐམས་ཅད་བདག་བཞིན་བསྲུང་བར་བྱ།” ཞེས་པའི་དོན་དེ་ཅིའི་ཕྱིར་དེ་ལྟར་ཡིན་པའི་རྒྱུ་མཚན་དང་རིགས་པ་རྣམས་རྒྱས་པར་སྟོན།"
                          }
                        ],
                        "implicit_concepts": [
                          "གང་ཟག་གི་བདག་མེད།",
                          "རྟེན་འབྲེལ་གྱི་ལྟ་བ།"
                        ],
                        "pedagogical_strategy": "རིགས་པས་དགག་སྒྲུབ་བྱེད་པ། དཔེ་དང་གཏན་ཚིགས་བཀོད་ནས་རྩོད་པ་སྤོང་བའི་ཚུལ་གྱིས་གདམས་པ།",
                        "intended_impact_on_reader": "རང་གཞན་གྱི་དབྱེ་བ་འབྱེད་པའི་བློ་དེ་རིགས་པས་དཔྱད་ན་མི་བཟོད་པར་ཤེས་ཏེ། སེམས་ཅན་ཀུན་ལ་སྙིང་རྗེ་ཁྱད་མེད་དུ་སྐྱེ་བའི་རྒྱུ་བསྐྲུན་པ།",
                        "audience_assumptions": "ཀློག་པ་པོ་ནི་རྒྱུ་མཚན་དང་རིགས་པ་ལ་དགའ་ཞིང་། དེ་ལ་བརྟེན་ནས་ངེས་ཤེས་སྐྱེད་པའི་བློ་དང་ལྡན་པར་ཆ་འཇོག་བྱེད།"
                      },
                      "children": [
                        {
                          "level": "leaf-node",
                          "title": "མཉམ་པ་ཇི་ལྟར་བསྒོམ་ཚུལ། - How to Meditate on Equality",
                          "verses_span": "92-99",
                          "summary": {
                            "content_summary": "ས་བཅད་འདིས་བདག་གཞན་མཉམ་པ་བསྒོམ་པའི་ཐབས་དངོས་སྟོན། དཔེར་ན་ལུས་ཀྱི་ཡན་ལག་རྣམས་ཐ་དད་ཀྱང་གཅིག་ཏུ་བསྲུང་བ་ལྟར། འགྲོ་བ་ཀུན་ཀྱང་བདེ་བ་འདོད་པ་ལ་ཁྱད་མེད་པས་བདག་བཞིན་དུ་བསྲུང་དགོས་པར་བསྟན། བདག་ཏུ་ཞེན་པས་རང་གི་སྡུག་བསྔལ་མི་བཟོད་པ་ལྟར། གཞན་ལ་བདག་ཏུ་ཞེན་ན་གཞན་གྱི་སྡུག་བསྔལ་ཡང་མི་བཟོད་པར་འགྱུར་བ་དང་། བདག་གཞན་གཉིས་བདེ་སྡུག་གི་བློ་ལ་ཁྱད་མེད་པས། རང་གཅིག་པུ་བདེ་བར་བརྩོན་པ་དང་རང་གཅིག་པུ་སྡུག་བསྔལ་ལས་སྲུང་བ་ནི་རིགས་པ་མེད་པར་བསྟན།",
                            "key_concepts": [
                              "ཡན་ལག་དང་ལུས།",
                              "བདག་ཏུ་ཞེན་པ།",
                              "བདེ་སྡུག་ལ་མཉམ་པ།",
                              "ཁྱད་པར་མེད་པ།"
                            ],
                            "transformative_goal": "རང་གཞན་གྱི་དབྱེ་འབྱེད་དམ་རང་ཕྱོགས་སུ་ལྷུང་བའི་བློ་དེ་རིགས་པ་མེད་པ་དང་དོན་མེད་པར་རྟོགས་ཏེ། གཞན་ལ་རང་དང་འདྲ་བའི་བརྩེ་བ་བསྐྱེད་པའི་གཞི་འཛུགས་པ།",
                            "function_in_hierarchy": "འདི་ནི་བདག་གཞན་མཉམ་པའི་ལྟ་བ་བསྒྲུབ་བྱེད་ཀྱི་རྒྱུ་མཚན་དང་དཔེ་དོན་གཙོ་བོ་རྣམས་བཀོད་པའི་ས་བཅད་ཡིན།",
                            "inter_node_relationships": [
                              {
                                "related_node_id": "leaf-node 100-107",
                                "relationship_type": "is_refuted_by",
                                "conceptual_bridge": "འདིར་བསྟན་པའི་ལྟ་བ་དེ་ལ་འབྱུང་སྲིད་པའི་རྩོད་པ་རྣམས་ས་བཅད་རྗེས་མས་སེལ་བར་བྱེད།"
                              }
                            ],
                            "implicit_concepts": [
                              "ལྟོས་གྲུབ།",
                              "སེམས་ཅན་ཐམས་ཅད་རང་གི་ཕ་མར་གྱུར་པའི་བསམ་པ།"
                            ],
                            "pedagogical_strategy": "དཔེ་དང་རྒྱུ་མཚན་གྱི་སྒོ་ནས་འཆད་པ། དྲི་བ་དྲིས་ལན་གྱི་ཚུལ་གྱིས་བློ་སྐྱེད་པ།",
                            "intended_impact_on_reader": "རང་གཅེས་འཛིན་གྱི་བསམ་བློ་དེ་དོན་དངོས་དང་མི་མཐུན་པའི་འཁྲུལ་བ་ཞིག་ཡིན་པར་ཤེས་ཏེ། གཞན་ལ་སྙིང་རྗེ་བསྒོམ་པའི་རིགས་པ་ལ་ངེས་ཤེས་སྐྱེད་པ།",
                            "audience_assumptions": "ཀློག་པ་པོས་རང་གི་སྡུག་བསྔལ་གྱིས་རང་ལ་གནོད་པ་དང་གཞན་གྱི་སྡུག་བསྔལ་གྱིས་རང་ལ་མི་གནོད་པ་ནི་རྒྱུ་མཚན་ཆེན་པོ་ཞིག་ཏུ་བརྩི་བར་ཆ་འཇོག་བྱེད།"
                          },
                          "children": []
                        },
                        {
                          "level": "leaf-node",
                          "title": "དེ་ལ་རྩོད་པ་སྤང་བ། - Dispelling Arguments Against It",
                          "verses_span": "100-107",
                          "summary": {
                            "content_summary": "ས་བཅད་འདིས་བདག་གཞན་མཉམ་པར་བསྒོམ་པ་ལ་འབྱུང་སྲིད་པའི་རྩོད་པ་རྣམས་སེལ་བར་བྱེད། རྐང་པའི་སྡུག་བསྔལ་ལག་པས་སེལ་བ་ནི་བདག་ཏུ་འཛིན་པས་ཡིན་ཞེ་ན། བདག་གཞན་དུ་འཛིན་པའང་འཁྲུལ་བ་ཡིན་པས་སྤང་བྱ་ཡིན་པར་བསྟན། རྒྱུད་དང་ཚོགས་པ་ཞེས་པ་བརྫུན་པ་ཡིན་པས་སྡུག་བསྔལ་ལ་བདག་པོ་མེད་པར་བསྟན། དེས་ན་སྡུག་བསྔལ་ཡིན་ཕྱིན་ཆད་ཐམས་ཅད་བསལ་དགོས་པ་དང་། གཞན་དོན་དུ་སྙིང་རྗེའི་སྡུག་བསྔལ་དང་དུ་ལེན་པ་ནི་སྡུག་བསྔལ་ཆེན་པོ་སེལ་བའི་ཐབས་ཡིན་པས་བླང་བྱ་ཡིན་པར་བསྒྲུབས།",
                            "key_concepts": [
                              "བདག་ཏུ་འཛིན་པ།",
                              "རྒྱུད་དང་ཚོགས།",
                              "སྡུག་བསྔལ་བདག་མེད།",
                              "སྙིང་རྗེའི་སྡུག་བསྔལ།"
                            ],
                            "transformative_goal": "བདག་གཞན་མཉམ་པའི་ལྟ་བ་ལ་ཡིད་གཉིས་དང་ཐེ་ཚོམ་རྣམས་རིགས་པས་རྩད་ནས་བཅད་དེ། དེ་ལ་ཡིད་ཆེས་བརྟན་པོ་ཐོབ་ནས་ཉམས་ལེན་ལ་གདེང་ཚོད་རྙེད་པ།",
                            "function_in_hierarchy": "འདི་ནི་ལྟ་བ་སྒྲུབ་པའི་ཡན་ལག་སྟེ། ལྟ་བ་བསྟན་པའི་རྗེས་སུ་དེ་ལ་རྒོལ་བའི་རྩོད་པ་རྣམས་སུན་ཕྱུང་ནས་ལྟ་བ་དེ་ཉིད་བརྟན་པོར་བྱེད་པའི་གནད་འགག་ཅན་གྱི་ས་བཅད་ཡིན།",
                            "inter_node_relationships": [
                              {
                                "related_node_id": "leaf-node 92-99",
                                "relationship_type": "defends_argument_of",
                                "conceptual_bridge": "ས་བཅད་འདིས་སྔོན་མའི་ལྟ་བ་དེ་ལ་འགོག་རྐྱེན་བྱེད་པའི་རྩོད་པ་དང་ལོག་རྟོག་རྣམས་སེལ་བར་བྱས་ཏེ་ལྟ་བ་དེ་བརྟན་པོར་བྱེད།"
                              }
                            ],
                            "implicit_concepts": [
                              "གང་ཟག་གི་བདག་མེད།",
                              "ཆོས་ཀྱི་བདག་མེད།",
                              "ཐབས་མཁས།"
                            ],
                            "pedagogical_strategy": "རྩོད་པ་སྤང་བ། (Refutation of objections) ཐལ་འགྱུར་གྱི་རིགས་པ་བཀོལ་ནས་ལོག་རྟོག་སུན་འབྱིན་པ།",
                            "intended_impact_on_reader": "བདག་གཞན་མཉམ་པར་བསྒོམ་པ་ལ་རིགས་པའི་གདེང་ཚོད་བརྟན་པོ་སྐྱེད་པ་དང་། སྙིང་རྗེས་གཞན་གྱི་སྡུག་བསྔལ་དང་དུ་ལེན་པ་ལ་སྤྲོ་བ་བསྐྱེད་པ།",
                            "audience_assumptions": "ཀློག་པ་པོ་ནི་བློ་རྣོ་ཞིང་དཔྱད་པ་གཏོང་རྒྱུར་དགའ་བས། ལྟ་བ་བསྟན་པ་ཙམ་གྱིས་མི་ཆོག་པར་དེ་ལ་འབྱུང་སྲིད་པའི་རྩོད་པ་རྣམས་ཀྱང་སེལ་དགོས་པར་ཆ་འཇོག་བྱེད།"
                          },
                          "children": []
                        }
                      ]
                    },
                    {
                      "level": "leaf-node",
                      "title": "དོན་བསྡུ་བ། - Concluding the Point",
                      "verses_span": "108-110",
                      "summary": {
                        "content_summary": "ས་བཅད་འདིས་བདག་གཞན་མཉམ་པ་བསྒོམས་པའི་ཕན་ཡོན་དང་དོན་སྙིང་པོ་མཇུག་བསྡུ་བའི་ཚུལ་དུ་སྟོན། དེ་ལྟར་གོམས་པས་གཞན་གྱི་སྡུག་བསྔལ་སེལ་བ་ལ་དགའ་ནས་དམྱལ་བར་ཡང་སྤྲོ་བས་འཇུག་ནུས་པ་དང་། སེམས་ཅན་གྲོལ་བའི་དགའ་བ་དེ་ཉིད་ཀྱིས་ཆོག་པས། རང་ཉིད་གཅིག་པུའི་ཐར་པ་ལ་དོན་མེད་པ། དེས་ན་གཞན་དོན་བྱས་ཀྱང་རློམ་སེམས་དང་རྣམ་སྨིན་གྱི་རེ་བ་མེད་པར་འགྱུར་བར་གདམས།",
                        "key_concepts": [
                          "གོམས་པའི་མཐུ།",
                          "གཞན་དོན་ལ་དགའ་བ།",
                          "རློམ་སེམས་མེད་པ།",
          "རྣམ་སྨིན་ལ་མི་རེ་བ།"
                        ],
                        "transformative_goal": "གཞན་དོན་སྒྲུབ་པ་དེ་རང་གི་བདེ་སྐྱིད་མཐར་ཐུག་ཏུ་རྟོགས་ཏེ། དེ་ལ་བརྟེན་པའི་རློམ་སེམས་དང་རེ་དོགས་ཀྱི་འཆིང་བ་ལས་གྲོལ་བའི་བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་རྣམ་དག་བསྐྱེད་པ།",
                        "function_in_hierarchy": "འདི་ནི་བདག་གཞན་མཉམ་པའི་བསྒོམ་པའི་ས་བཅད་ཀྱི་མཇུག་བསྡུ་བ་དང་འབྲས་བུ་བསྟན་པའི་སྐབས་ཡིན། འདིས་ཉམས་ལེན་དེའི་དགོས་པ་མཐར་ཐུག་གསལ་བར་བྱེད།",
                        "inter_node_relationships": [
                          {
                            "related_node_id": "subsubsection-8.3.2.1",
                            "relationship_type": "concludes",
                            "conceptual_bridge": "འདིས་བདག་གཞན་མཉམ་པ་བསྒོམ་པའི་དམིགས་ཡུལ་དང་འབྲས་བུ་མཐར་ཐུག་བསྟན་ནས་ས་བཅད་དེ་ཡོངས་སུ་རྫོགས་པར་བྱེད།"
                          }
                        ],
                        "implicit_concepts": [
                          "བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ།",
                          "དགའ་བ་ཚད་མེད་པ།"
                        ],
        "pedagogical_strategy": "འབྲས་བུ་བསྟན་ནས་ཡིད་སྤྲོ་བ་བསྐྱེད་པ། ཉམས་ལེན་གྱི་མཐར་ཐུག་གི་དམིགས་ཡུལ་གསལ་བར་བསྟན་ནས་དེ་ལ་བརྩོན་པར་བསྐུལ་བ།",
                        "intended_impact_on_reader": "བདག་གཞན་མཉམ་པའི་ཉམས་ལེན་ལ་དགོས་པ་དང་ཡོན་ཏན་ཆེན་པོ་ཡོད་པར་ཡིད་ཆེས་ཏེ། དེ་ཉིད་སྙིང་ཐག་པ་ནས་ཉམས་སུ་ལེན་པའི་སྤོབས་པ་བསྐྱེད་པ།",
                        "audience_assumptions": "ཀློག་པ་པོས་ཉམས་ལེན་བྱས་པའི་འབྲས་བུ་དང་ཕན་ཡོན་གང་ཡིན་ཤེས་འདོད་ཡོད་པར་ཆ་འཇོག་བྱེད།"
                      },
                      "children": []
                    }
                  ]
                },
                {
                  "level": "subsubsection-8.3.2.2",
                  "title": "བདག་གཞན་བརྗེ་བ་བསྒོམ་ཚུལ། - How to Meditate on Exchanging Self and Other",
                  "verses_span": "111-184",
                  "summary": {
                    "content_summary": "ས་བཅད་འདིས་བདག་གཞན་མཉམ་པའི་ལྟ་བ་ལས་ཀྱང་ཁྱད་པར་དུ་འཕགས་པའི་བདག་གཞན་བརྗེ་བའི་ཉམས་ལེན་རྒྱས་པར་སྟོན། ཐོག་མར་དེ་ལྟར་བརྗེ་རུང་བའི་རྒྱུ་མཚན་བསྟན། དེ་ནས་བརྗེ་ཚུལ་དངོས་ལ་བདག་གཅེས་འཛིན་ནི་ཉེས་པ་ཀུན་གྱི་རྩ་བ་དང་གཞན་གཅེས་འཛིན་ནི་ཕུན་ཚོགས་ཀུན་གྱི་འབྱུང་ཁུངས་ཡིན་པར་རྒྱུ་མཚན་དུ་མས་བསྒྲུབས། མཐར་རང་གི་སེམས་དེ་བདག་གཞན་བརྗེས་པའི་གནས་སུ་བཞག་སྟེ། རང་ལས་དམན་པ་དང་། མཉམ་པ། ལྷག་པ་བཅས་ལ་ཕྲག་དོག་དང་། འགྲན་སེམས། ང་རྒྱལ་བཅས་ཀྱི་གཉེན་པོ་བསྒོམ་ཚུལ་དང་། རང་གཅེས་འཛིན་གྱི་བློ་དེ་དགྲ་བཞིན་བལྟས་ནས་ཚར་གཅོད་དགོས་པར་གདམས།",
                    "key_concepts": [
                      "བདག་གཞན་བརྗེ་བ།",
                      "གཅེས་འཛིན།",
                      "བདག་འཛིན་གྱི་ཉེས་དམིགས།",
                      "གཞན་གཅེས་འཛིན་གྱི་ཕན་ཡོན།",
                      "ཕྲག་དོག",
                      "འགྲན་སེམས།",
                      "ང་རྒྱལ།"
                    ],
                    "transformative_goal": "རང་གཅེས་འཛིན་གྱི་བག་ཆགས་ཟབ་མོ་རྩད་ནས་སྤངས་ཏེ། གཞན་གཅེས་པར་འཛིན་པའི་བྱང་ཆུབ་ཀྱི་སེམས་དེ་རང་གི་རང་བཞིན་ལྟ་བུར་གོམས་པར་བྱེད་པ།",
                    "function_in_hierarchy": "འདི་ནི་ཀུན་རྫོབ་བྱང་ཆུབ་སེམས་བསྒོམ་པའི་ཉམས་ལེན་གྱི་རྩེ་མོ་དང་སྙིང་པོ་ཡིན། འདིས་ཐེག་པ་ཆེན་པོའི་སེམས་བསྐྱེད་ཀྱི་གནད་འགག་མཐར་ཐུག་སྟོན།",
                    "inter_node_relationships": [
                      {
                        "related_node_id": "subsubsection-8.3.2.1",
                        "relationship_type": "is_advanced_form_of",
                        "conceptual_bridge": "བདག་གཞན་མཉམ་པའི་བསམ་པ་བརྟན་པོར་གྱུར་པའི་རྨང་གཞིའི་སྟེང་དུ། དེ་ལས་ཀྱང་གཏིང་ཟབ་པའི་བདག་གཞན་བརྗེ་བའི་ཉམས་ལེན་འདི་སྤེལ་བར་བྱེད།"
                      }
                    ],
                    "implicit_concepts": [
                      "བློ་སྦྱོང་གི་གདམས་ངག",
                      "སྟོང་པ་ཉིད་དང་སྙིང་རྗེ་ཟུང་འཇུག"
                    ],
                    "pedagogical_strategy": "རིགས་པ་དང་མན་ངག་ཟུང་དུ་སྦྲེལ་བ། བདག་གཞན་བརྗེས་པའི་སྒོ་ནས་ནང་ tâm གྱི་བསམ་བློ་གཏོང་བའི་ཐབས་ལམ་དམིགས་བསལ་ཅན་སྤྱོད་པ།",
                    "intended_impact_on_reader": "རང་གཅེས་འཛིན་གྱི་བློ་ནི་རང་གི་དགྲ་བོ་ཆེ་ཤོས་དང་གཞན་གཅེས་འཛིན་གྱི་བློ་ནི་གྲོགས་པོ་དམ་པ་ཡིན་པར་ངེས་ཤེས་བརྟན་པོ་སྐྱེད་ནས། ཉིན་མཚན་ཀུན་ཏུ་བདག་གཞན་བརྗེ་བའི་ཉམས་ལེན་ལ་བརྩོན་པའི་སྤོབས་པ་བསྐྱེད་པ།",
                    "audience_assumptions": "ཀློག་པ་པོ་ནི་བདག་གཞན་མཉམ་པའི་བློ་སྦྱངས་ཟིན་ཞིང་། དེ་ལས་ཀྱང་གཏིང་ཟབ་པའི་ཐེག་ཆེན་གྱི་ཉམས་ལེན་ལ་སློབ་པའི་འདུན་པ་དང་བློ་གྲོས་གཉིས་ཀ་ཡོད་པར་ཆ་འཇོག་བྱེད།"
                  },
                  "children": [
                    {
                      "level": "leaf-node",
                      "title": "རྒྱུ་མཚན་བརྗོད་པས་མདོར་བསྟན་པ། - Brief Explanation with Reasons",
                      "verses_span": "111-113",
                      "summary": {
                        "content_summary": "ས་བཅད་འདིས་བདག་གཞན་བརྗེ་བ་ཅིའི་ཕྱིར་བསྒོམ་དགོས་པ་དང་བསྒོམ་རུང་བའི་རྒྱུ་མཚན་མདོར་བསྡུས་ནས་སྟོན། བདག་གཞན་གཉིས་ལ་ཁྱད་པར་མེད་པས་གཞན་ལ་རང་བཞིན་དུ་བསྲུང་དགོས་པ་དང་། གོམས་པའི་སྟོབས་ཀྱིས་བདག་མེད་པའི་ཕུང་པོ་ལ་བདག་གི་བློ་སྐྱེ་བ་ལྟར། གཞན་གྱི་ལུས་ལའང་བདག་གི་བློ་བསྐྱེད་རུང་བས་ན་བདག་གཞན་བརྗེ་བ་ནི་སྒྲུབ་རུང་བའི་ཉམས་ལེན་ཞིག་ཡིན་པར་བསྟན།",
                        "key_concepts": [
                          "གོམས་པའི་མཐུ།",
                          "བདག་གི་བློ།",
                          "བརྗེ་རུང་བ།"
                        ],
        "transformative_goal": "བདག་གཞན་བརྗེ་བའི་ཉམས་ལེན་ནི་བྱར་མི་རུང་བའམ་བྱ་མི་ནུས་པའི་བྱ་བ་ཞིག་མ་ཡིན་པར། གོམས་པའི་སྟོབས་ཀྱིས་འགྲུབ་ཐུབ་པའི་ཉམས་ལེན་ཞིག་ཡིན་པར་ཡིད་ཆེས་བསྐྱེད་པ།",
                        "function_in_hierarchy": "འདི་ནི་བདག་གཞན་བརྗེ་བའི་བསྒོམ་པའི་སྐབས་ཀྱི་སྒོ་འབྱེད་དེ། ཉམས་ལེན་དེའི་རུང་དོན་དང་རྒྱུ་མཚན་བསྟན་ནས་ཉམས་ལེན་པ་རྣམས་ཀྱི་ཐེ་ཚོམ་སེལ་བར་བྱེད།",
                        "inter_node_relationships": [
                          {
                            "related_node_id": "leaf-node 114-184",
                            "relationship_type": "is_premise_for",
                            "conceptual_bridge": "འདིར་བདག་གཞན་བརྗེ་རུང་བར་བསྒྲུབས་པའི་རྒྱུ་མཚན་དེ་ལ་བརྟེན་ནས། ས་བཅད་རྗེས་མས་ཇི་ལྟར་བརྗེ་བའི་ཚུལ་རྒྱས་པར་འཆད།"
                          }
                        ],
                        "implicit_concepts": [
                          "སེམས་ཀྱི་ནུས་པ།",
                          "བདག་ཏུ་འཛིན་པ་བློས་བཏགས་ཙམ།"
                        ],
                        "pedagogical_strategy": "དཔེ་དང་རྒྱུ་མཚན་སྦྱར་ནས་གཏན་ལ་འབེབས་པ། གོམས་པའི་ནུས་པ་དཔེའི་སྒོ་ནས་བསྟན་ནས་ཡིད་ཆེས་བསྐྱེད་པ།",
                        "intended_impact_on_reader": "བདག་གཞན་བརྗེ་བ་ནི་བསྒོམ་ཐུབ་པའི་ཆོས་ཤིག་ཡིན་པར་ངེས་པ་རྙེད་ནས། དེ་ལ་ཉམས་ལེན་བྱེད་འདོད་ཀྱི་སྤྲོ་བ་བསྐྱེད་པ།",
                        "audience_assumptions": "ཀློག་པ་པོས་བདག་གཞན་བརྗེ་བ་ནི་བློའི་ཡུལ་ལས་འདས་པའི་བྱ་བ་ཞིག་ཏུ་སེམས་སྲིད་པས། ཐོག་མར་དེ་སྒྲུབ་རུང་བའི་རྒྱུ་མཚན་བསྟན་དགོས་པར་ཆ་འཇོག་བྱེད།"
                      },
                      "children": []
                    },
                    {
                      "level": "leaf-node",
                      "title": "བརྗེ་ཚུལ་རྒྱས་པར་བཤད་པ། - Detailed Explanation of How to Exchange",
                      "verses_span": "114-184",
                      "summary": {
                        "content_summary": "ས་བཅད་འདིས་བདག་གཞན་བརྗེ་བའི་ཉམས་ལེན་དངོས་རྒྱས་པར་སྟོན། ཐོག་མར་བདག་གཅེས་འཛིན་གྱི་སྐྱོན་དང་གཞན་གཅེས་འཛིན་གྱི་ཡོན་ཏན་བསྟན་ནས་བརྗེ་དགོས་པའི་རྒྱུ་མཚན་ནན་ཏན་དུ་བཤད། དེ་ནས་བརྗེ་ཚུལ་དངོས་ལ་རང་ལས་དམན་པ་དང་། མཉམ་པ། ལྷག་པ་བཅས་དང་རང་གི་གནས་བརྗེས་ནས། སོ་སོའི་གཉེན་པོ་ཕྲག་དོག་དང་། འགྲན་སེམས། ང་རྒྱལ་བཅས་བསྒོམ་པའི་ཐབས་ལམ་ཁྱད་པར་ཅན་བསྟན། མཐར་རང་གཅེས་འཛིན་གྱི་བློ་དེ་ལ་ཡིད་ཅེས་བརྗོད་ནས་བཀའ་བཀྱོན་དང་ཚར་གཅོད་བྱེད་ཚུལ། དེ་བཞིན་དུ་ལུས་ལ་ཆགས་པ་སྤོང་ཚུལ་བཅས་ཞིབ་རྒྱས་སུ་གདམས།",
                        "key_concepts": [
                          "བདག་འཛིན་དོར་བ།",
                          "གཞན་བླང་བ།",
                          "བདག་གཅེས་འཛིན་གྱི་ཉེས་པ།",
                          "གཞན་གཅེས་འཛིན་གྱི་ཡོན་ཏན།",
                          "བློ་སྦྱོང་།",
                          "ཡིད་ལ་ཚར་གཅོད་པ།"
                        ],
                        "transformative_goal": "རང་གཅེས་འཛིན་གྱི་བསམ་བློ་དེ་རྩ་བ་ནས་བསྒྱུར་ཏེ། གཞན་གྱི་དོན་དུ་རང་གི་ལུས་དང་ལོངས་སྤྱོད་ཐམས་ཅད་འདོར་ཕོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྙིང་སྟོབས་དང་སྤྱོད་པ་རྒྱུད་ལ་སྐྱེད་པ།",
                        "function_in_hierarchy": "འདི་ནི་བདག་གཞན་བརྗེ་བའི་ཉམས་ལེན་གྱི་ལག་ལེན་དངོས་དང་ཐབས་ལམ་ཞིབ་ཕྲ་གཏན་ལ་འབེབས་པའི་ས་བཅད་གཙོ་བོ་ཡིན།",
                        "inter_node_relationships": [
                          {
                            "related_node_id": "leaf-node 111-113",
                            "relationship_type": "is_application_of",
                            "conceptual_bridge": "ས་བཅད་སྔོན་མས་བརྗེ་རུང་བར་བསྒྲུབས་པའི་རྗེས་སུ། འདིས་ཇི་ལྟར་བརྗེ་དགོས་པའི་ཐབས་ལམ་དངོས་སྟོན།"
                          }
                        ],
                        "implicit_concepts": [
                          "གཏོང་ལེན་གྱི་ཉམས་ལེན།",
                          "སེམས་དཔའི་སྨོན་ལམ།"
                        ],
                        "pedagogical_strategy": "ནང་སེམས་ཀྱི་གླེང་མོལ། (Internal dialogue) རང་གི་སེམས་ལ་ཁ་བརྡ་བྱེད་པའི་ཚུལ་གྱིས་བློ་སྦྱོང་གི་གདམས་ངག་ཟབ་མོ་སྟོན་པ། རྣོ་ལ་དྲག་པའི་གདམས་ ngag སྤྱོད་པ།",
                        "intended_impact_on_reader": "རང་གཅེས་འཛིན་གྱི་བློ་དེ་ལ་སྙིང་ནས་ཞེན་པ་ལོག་སྟེ། དེ་ནི་དགྲ་ངོ་མ་ཡིན་པར་མཐོང་ནས་དེ་ལ་གཉེན་པོ་བསྟེན་པའི་སྤོབས་པ་དང་ནུས་པ་ཐོབ་པ།",
                        "audience_assumptions": "ཀློག་པ་པོ་ནི་ཉམས་ལེན་གྱི་གནད་ལ་གོམས་པ་ཡོད་ཅིང་། རང་གི་སེམས་ལ་དཔྱད་པ་གཏོང་བ་དང་བཀོད་འདོམས་བྱེད་ནུས་པའི་གང་ཟག་ཞིག་ཡིན་པར་ཆ་འཇོག་བྱེད།"
                      },
                      "children": [
                        {
                          "level": "leaf-node",
                          "title": "བརྗེ་ཚུལ་སྤྱིར་བསྟན་པ། - General Explanation of How to Exchange",
                          "verses_span": "114-128",
                          "summary": {
                            "content_summary": "ས་བཅད་འདིས་བདག་གཞན་བརྗེ་བའི་རྩ་བའི་ལྟ་བ་དང་སྤྱོད་པ་སྤྱིར་བསྟན་པར་བྱེད། དེ་ཡང་བདག་འཛིན་གྱི་སྐྱོན་དང་གཞན་བླང་བའི་ཡོན་ཏན་ཤེས་ནས་དེ་ལྟར་བསྒོམ་དགོས་པ་དང་། གོམས་པའི་སྟོབས་ཀྱིས་གཞན་ལ་བདག་གི་བློ་སྐྱེ་རུང་བ། དེ་ལྟར་བྱས་ན་གཞན་དོན་ལ་རློṁསེམས་དང་རེ་བ་མེད་པར་འགྱུར་བ། ལྷག་པར་དུ་བདག་གི་ལུས་འདི་ནི་འཇིགས་པ་དང་སྡིག་པའི་རྟེན་ཡིན་པས་དགྲ་བཞིན་དུ་བལྟ་དགོས་པ། མཐར་བདག་དོན་སེམས་པ་ནི་འདྲེའི་ཆོས་དང་གཞན་དོན་སེམས་པ་ནི་ལྷའི་ཆོས་ཡིན་པར་བསྟན་ནས་བརྗེ་བའི་དགོས་པ་ནན་ཏན་དུ་བཤད།",
                            "key_concepts": [
                              "བདག་འཛིན་དོར་བ།",
                              "གཞན་བླང་བ།",
                              "གོམས་པའི་མཐུ།",
                              "ལུས་ལ་ཆགས་པའི་ཉེས་པ།",
                              "འདྲེའི་ཆོས་དང་ལྷའི་ཆོས།"
                            ],
                            "transformative_goal": "བདག་གཞན་བརྗེ་བའི་ལྟ་བའི་རྨང་གཞི་བརྟན་པོ་བཙུགས་ནས། རང་གཅེས་འཛིན་ལ་སྡང་བ་དང་གཞན་གཅེས་འཛིན་ལ་དགའ་བའི་བློ་བསྐྱེད་པ།",
                            "function_in_hierarchy": "འདི་ནི་བརྗེ་བ་བསྒོམ་པའི་ས་བཅད་ཀྱི་ནང་གི་རྩ་བའི་ལྟ་བ་དང་སྤྱོད་པ་གཏན་ལ་འབེབས་པའི་སྐབས་ཡིན།",
                            "inter_node_relationships": [
                              {
                                "related_node_id": "leaf-node 129-150",
                                "relationship_type": "is_premise_for",
                                "conceptual_bridge": "འདིར་བསྟན་པའི་བདག་གཞན་བརྗེ་བའི་དགོས་པ་དང་རྩ་བའི་ལྟ་བ་དེ་ལ་བརྟེན་ནས། ས་བཅད་རྗེས་མས་དེའི་ཁྱད་པར་གྱི་ཉེས་དམིགས་དང་ཕན་ཡོན་ཞིབ་ཏུ་འཆད།"
                              }
                            ],
                            "implicit_concepts": [
                              "ལྟ་བ་སྒོམ་པ་སྤྱོད་པ་གསུམ།"
                            ],
                            "pedagogical_strategy": "རྒྱུ་མཚན་དང་དཔེ་དོན་སྦྱར་ནས་འཆད་པ། གཤིབ་བསྡུར་གྱི་ཐབས་ལམ་སྤྱོད་པ། (Contrastive analysis)",
                            "intended_impact_on_reader": "བདག་གཅེས་འཛིན་གྱི་བསམ་པ་ནི་རང་གི་དགྲ་ངོ་མ་ཡིན་པ་དང་། གཞན་གཅེས་འཛིན་ནི་ཕན་བདེའི་འབྱུང་ཁུངས་ཡིན་པར་ངེས་ཤེས་བརྟན་པོ་སྐྱེད་པ།",
                            "audience_assumptions": "ཀློག་པ་པོས་བདག་གཞན་བརྗེ་བའི་ལག་ལེན་ལ་འཇུག་པར་སྤྲོ་བ་ཡོད་ཀྱང་། དེའི་རྒྱུ་མཚན་དང་དགོས་པ་གསལ་པོ་མི་ཤེས་པར་ཆ་འཇོག་བྱེད།"
                          },
                          "children": []
                        },
                        {
                          "level": "leaf-node",
                          "title": "གཉེན་པོའི་ཁྱད་པར་བྱེ་བྲག་ཏུ་བསྒོམ་པ། - Meditating Specifically on the Antidote",
                          "verses_span": "129-150",
                          "summary": {
                            "content_summary": "ས་བཅད་འདིས་བདག་གཞན་བརྗེ་བའི་ཁྱད་པར་གྱི་ཕན་ཡོན་དང་མ་བརྗེས་པའི་ཉེས་དམིགས་བྱེ་བྲག་ཏུ་བཤད། བདག་དོན་གྱིས་གཞན་ལ་གནོད་ན་ངན་སོང་དུ་ལྟུང་བ་དང་། གཞན་དོན་དུ་བདག་ལ་གནོད་ན་ཕུན་ཚོགས་འཐོབ་པ། བདག་མཐོ་བར་འདོད་ན་ངན་འགྲོར་འགྲོ་བ་དང་། གཞན་མཐོ་བར་འདོད་ན་བདེ་འགྲོར་སྐྱེ་བ་སོགས་བདག་གཅེས་འཛིན་དང་གཞན་གཅེས་འཛིན་གྱི་འབྲས་བུ་ཐད་ཀར་འགལ་བ་རྣམས་གསལ་པོར་བསྟན། མཐར་འཇིག་རྟེན་གྱི་བདེ་སྡུག་ཐམས་ཅད་གཞན་བདེ་འདོད་དང་རང་བདེ་འདོད་ལས་བྱུང་བར་བསྒྲུབས་ནས། བདག་འཛིན་ནི་ཉེས་པ་ཀུན་གྱི་རྩ་བ་ཡིན་པས་ངེས་པར་དུ་སྤང་དགོས་པར་ནན་གྱིས་གདམས།",
                            "key_concepts": [
                              "རང་དོན།",
                              "གཞན་དོན།",
                              "བདེ་སྡུག་གི་འབྱུང་ཁུངས།",
                              "བྱིས་པ་དང་ཐུབ་པའི་ཁྱད་པར།",
                              "བདག་འཛིན་ནི་འདྲེ་ཆེན།"
                            ],
                            "transformative_goal": "རང་གཅེས་འཛིན་ནི་སྡུག་བསྔལ་ཀུན་གྱི་སྒོ་དང་གཞན་གཅེས་འཛིན་ནི་བདེ་ལེགས་ཀུན་གྱི་གཞི་མ་ཡིན་པར་ཐེ་ཚོམ་མེད་པའི་ངེས་ཤེས་བརྟན་པོ་སྐྱེད་དེ། བློ་རྩ་བ་ནས་བསྒྱུར་བ།",
                            "function_in_hierarchy": "འདི་ནི་བདག་གཞན་བརྗེ་དགོས་པའི་རྒྱུ་མཚན་ཤུགས་ཆེ་ཤོས་དང་གནད་འགག་ཆེ་ཤོས་རྣམས་བསྟན་པའི་སྐབས་ཡིན། འདིས་ལྟ་བ་དེ་ལ་རིགས་པའི་རྒྱབ་རྟེན་བརྟན་པོ་སྦྱིན།",
                            "inter_node_relationships": [
                              {
                                "related_node_id": "leaf-node 114-128",
                                "relationship_type": "provides_evidence_for",
                                "conceptual_bridge": "ས་བཅད་སྔོན་མར་བདག་གཞན་བརྗེ་དགོས་པར་སྤྱིར་བསྟན་པ་ལ། འདིས་དེའི་རྒྱུ་མཚན་བྱེ་བྲག་པ་དང་བསླུ་མེད་ཀྱི་ལས་འབྲས་ཀྱི་རྣམ་གཞག་བཀོད་ནས་བསྒྲུབས།"
                              }
                            ],
                            "implicit_concepts": [
                              "ལས་རྒྱུ་འབྲས།",
                              "སེམས་བསྐྱེད་ཀྱི་སྟོབས།"
                            ],
                            "pedagogical_strategy": "གཤིབ་བསྡུར་དང་རྒྱུ་འབྲས་དབྱེ་ཞིབ། རང་དོན་དང་གཞན་དོན་གྱི་འབྲས་བུ་ཐད་ཀར་འགལ་བ་རྣམས་གཤིབ་བསྡུར་བྱས་ནས་གདམ་ང་གསལ་པོ་སྟོན་པ།",
                            "intended_impact_on_reader": "བདག་གཅེས་འཛིན་ལ་སྙིང་ནས་འཇིགས་པ་དང་ཞེན་པ་ལོག་སྟེ། དེ་ནི་དུག་དང་འདྲ་བར་ངོས་བཟུང་ནས་སྤོང་བའི་སྙིང་སྟོབས་བསྐྱེད་པ།",
                            "audience_assumptions": "ཀློག་པ་པོས་བདག་གཅེས་འཛིན་ནི་རང་སྲུང་གི་ཐབས་མཆོག་ཏུ་འཛིན་སྲིད་པས། དེ་ནི་རང་ཉིད་འཕུང་བྱེད་ཀྱི་དགྲ་བོ་ཡིན་པར་རྒྱུ་མཚན་དྲག་པོས་བསྒྲུབ་དགོས་པར་ཆ་འཇོག་བྱེད།"
                          },
                          "children": []
                        },
                        {
                          "level": "leaf-node",
                          "title": "བརྗེས་ནས་ཇི་ལྟར་བསྒྲུབ་པ། - How to Accomplish After Exchanging",
                          "verses_span": "151-184",
                          "summary": {
                            "content_summary": "ས་བཅད་འདིས་བདག་གཞན་བརྗེས་ནས་དེ་ཉམས་ལེན་དུ་ཇི་ལྟར་བསྒྲུབ་དགོས་པའི་ཚུལ་གསལ་པོར་སྟོན། དེ་ཡང་བདག་ཉིད་གཞན་དུ་བཟུང་ནས་དེ་ལ་ཕྲག་དོག་བྱེད་པ་དང་། གཞན་དེ་བདག་ཏུ་བཟུང་ནས་རང་ལ་བརྙས་བཅོས་བྱེད་པ་སོགས་བསམ་བློའི་ནང་དུ་སྦྱོང་བརྡར་བྱེད་ཚུལ་ཞིབ་ཏུ་བསྟན། རང་དོན་ཡིད་བྱེད་ཀྱི་སེམས་དེ་ལ་དགྲ་བོ་ལྟར་བཀའ་བཀྱོན་དང་ཚར་གཅོད་བྱེད་དགོས་པ། རང་གི་ལུས་དེ་ཡང་གཞན་དོན་སྒྲུབ་པའི་ལས་ཀྱི་སྤྱད་དུ་བཟུང་དགོས་པ་ལས་དེ་ལ་ཆགས་པར་མི་བྱ་བའི་ཚུལ་བཅས་གདམས་ངག་ཟབ་མོ་རྣམས་གསལ་བར་བཀོད།",
                            "key_concepts": [
                              "ཕྲག་དོག་བསྒོམ་པ།",
                              "འགྲན་སེམས་བསྒོམ་པ།",
                              "ང་རྒྱལ་བསྒོམ་པ།",
                              "ཡིད་ལ་ཚར་གཅོད་པ།",
                              "ལུས་ལ་མི་ཆགས་པ།"
                            ],
                            "transformative_goal": "རང་གཅེས་འཛིན་གྱི་བག་ཆགས་ཟབ་མོ་རྣམས་གཉེན་པོའི་སྟོབས་ཀྱིས་རྩད་ནས་བཅོམ་སྟེ། གཞན་གཅེས་འཛིན་གྱི་བློ་དེ་ཉིད་ལག་ལེན་དངོས་ཀྱི་ནང་དུ་འཁྱེར་ནུས་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གོམས་པར་བྱེད་པ།",
                            "function_in_hierarchy": "འདི་ནི་བདག་གཞན་བརྗེ་བའི་ཉམས་ལེན་གྱི་ལག་ལེན་དངོས་དང་ཐབས་ལམ་ཞིབ་ཕྲའི་སྐབས་ཡིན། འདིས་ལྟ་བ་དེ་སྒོམ་པའམ་ཉམས་ལེན་དུ་ཇི་ལྟར་འགྱུར་བའི་ཚུལ་སྟོན།",
                            "inter_node_relationships": [
                              {
                                "related_node_id": "leaf-node 129-150",
                                "relationship_type": "is_application_of",
                                "conceptual_bridge": "ས་བཅད་སྔོན་མས་བདག་གཞན་བརྗེ་དགོས་པའི་རྒྱུ་མཚན་བསྒྲུབས་པའི་རྗེས་སུ། འདིས་དེ་ཉིད་ལག་ལེན་དུ་ཇི་ལྟར་བསྟར་བའི་ཐབས་ལམ་ཞིབ་མོ་སྟོན།"
                              }
                            ],
                            "implicit_concepts": [
                              "རྟོག་པའི་རྩལ་སྦྱོང་།",
                              "བདག་འཛིན་གྱི་དགྲ་བཅོམ་པ།"
                            ],
                            "pedagogical_strategy": "ནང་སེམས་ཀྱི་བགྲོ་གླེང་དང་བཀའ་བཀྱོན། (Internal debate and admonishment) རང་གི་སེམས་དང་ལུས་ལ་གང་ཟག་གཞན་ཞིག་ཏུ་བལྟས་ནས་བཀོད་འདོམས་བྱེད་པའི་ཐབས་ལམ་དམིགས་བསལ་ཅན་སྤྱོད་པ།",
                            "intended_impact_on_reader": "རང་གཅེས་འཛིན་གྱི་བློ་སྐྱེས་ཚེ་དེ་ནི་དགྲ་བོ་ཡིན་པར་ངོས་ཟིན་ནས་དེ་ལ་གཉེན་པོ་བསྟེན་པའི་ནུས་པ་དང་སྤོབས་པ་ཐོབ་པ། གཞན་དོན་སྒྲུབ་པ་ལ་དཀའ་སྤྱད་དང་དུ་ལེན་པའི་སྙིང་སྟོབས་སྐྱེད་པ།",
                            "audience_assumptions": "ཀློག་པ་པོ་ནི་རང་གི་སེམས་ལ་ཞིབ་ཏུ་བརྟག་ཅིང་དེ་ལ་བཀོད་འདོམས་བྱེད་པའི་ནུས་པ་ཡོད་པའི་ཉམས་ལེན་པ་ཞིག་ཡིན་པར་ཆ་འཇོག་བྱེད།"
                          },
                          "children": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "level": "subsection-8.3.3",
              "title": "ཏིང་ངེ་འཛིན་འགྲུབ་པའི་ཐབས་ལ་གདམས་པ། - Instructions on the Method for Accomplishing Samadhi",
              "verses_span": "185-187",
              "summary": {
                "content_summary": "ས་བཅད་འདིས་ལེའུ་ཡོངས་ཀྱི་དོན་མཇུག་བསྡུ་བའི་ཚུལ་དུ་ཏིང་ངེ་འཛིན་འགྲུབ་པའི་ཐབས་ལ་བསྐྱར་དུ་གདམས། དེ་ཡང་བྱིས་པའི་སྤྱོད་པ་སྤངས་ནས་མཁས་པའི་རྗེས་སུ་འབྲང་སྟེ། བག་ཡོད་དྲན་ཤེས་བསྟེན་ནས་སྒྲིབ་པ་ལྔ་སྟེ་གཉིད་རྨུགས་སོགས་བཟློག་དགོས་པ་དང་། རྒྱལ་སྲས་རྣམས་ལྟར་སྙིང་སྟོབས་བསྐྱེད་དེ་ཉིན་མཚན་དུ་འབད་དགོས་པ། མཐར་སྒྲིབ་པ་བསལ་བའི་ཕྱིར་དུ་ཡང་དག་པའི་དམིགས་པ་ལ་སེམས་རྟག་ཏུ་མཉམ་པར་བཞག་དགོས་པར་བསྐུལ་མ་མཛད།",
                "key_concepts": [
                  "བག་ཡོད།",
                  "སྒྲིབ་པ་བསལ་བ།",
                  "གཉིད་རྨུགས་བཟློག་པ།",
                  "མཉམ་པར་བཞག་པ།",
                  "ཡང་དག་པའི་དམིགས་པ།"
                ],
                "transformative_goal": "ཏིང་ངེ་འཛིན་སྒྲུབ་པའི་ཐབས་ལམ་གྱི་སྙིང་པོ་རྣམས་ཕྱོགས་གཅིག་ཏུ་བསྡུས་ནས་དྲན་པར་བྱས་ཏེ། ཉམས་ལེན་རྒྱུན་མ་ཆད་པར་བརྩོན་པའི་སྙིང་སྟོབས་དང་སྤོབས་པ་བསྐྱེད་པ།",
                "function_in_hierarchy": "འདི་ནི་བསམ་གཏན་གྱི་ལེའུའི་མཇུག་བསྡུ་བ་སྟེ། གཞུང་དོན་ཐམས་ཅད་ཀྱི་དགོངས་པ་ཉམས་ལེན་དངོས་ལ་ཇི་ལྟར་སྦྱོར་བའི་ཚུལ་གྱི་གདམས་ངག་སྙིང་པོར་དྲིལ་ནས་བསྟན་པའི་སྐབས་ཡིན།",
                "inter_node_relationships": [
                  {
                    "related_node_id": "section-8.3",
                    "relationship_type": "summarizes_and_concludes",
                    "conceptual_bridge": "བསམ་གཏན་བསྒོམ་ཚུལ་རྒྱས་པར་བཤད་པའི་མཐར། དེ་ཉིད་འགྲུབ་པར་བྱེད་པའི་ཐབས་ལམ་གྱི་སྙིང་པོ་རྣམས་ཕྱོགས་བསྡོམས་ཀྱི་ཚུལ་དུ་བསྟན།"
                  }
                ],
                "implicit_concepts": [
                  "ཉམས་ལེན་རྒྱུན་སྐྱོང་།",
                  "ཤེས་བཞིན།"
                ],
                "pedagogical_strategy": "བསྐུལ་མ་དང་གདམས་ངག་གི་ཚུལ་དུ་འཆད་པ། ཉམས་ལེན་གྱི་གནད་རྣམས་བསྐྱར་ཟློས་ཀྱིས་ནན་ཏན་དུ་བསྟན་པ།",
                "intended_impact_on_reader": "བསམ་གཏན་གྱི་ལེའུ་ལས་བྱུང་བའི་ཤེས་རབ་དང་གདམས་ངག་རྣམས་ཉམས་ལེན་དངོས་ཀྱི་ནང་དུ་བསྡུ་ནུས་པ་དང་། དེ་ལ་བརྩོན་པ་རྒྱུན་མི་འཆད་པར་བྱེད་པའི་སེམས་ཤུགས་ཐོབ་པ།",
                "audience_assumptions": "ཀློག་པ་པོས་ལེའུ་ཧྲིལ་པོའི་གཞུང་དོན་སྦྱངས་ཟིན་པས། མཐའ་མཇུག་ཏུ་དེ་དག་གི་སྙིང་པོ་བསྡུས་པའི་གདམས་ངག་ལ་བརྟེན་ནས་ཉམས་ལེན་ལ་འཇུག་པར་འདོད་ཡོད་པར་ཆ་འཇོག་བྱེད།"
              },
              "children": []
            }
          ]
        }
      ]
    }
  ]