[
  {
    "level": "8",
    "title": "བསམ་གཏན་བསྟན་པའི་ལེའུ།",
    "lines_span": "1-665",
    "children": [
      {
        "level": "8.1",
        "title": "མཚམས་སྦྱར་བའི་སྒོ་ནས་མདོར་བསྟན་པ།",
        "lines_span": "1-4",
        "line_text_excerpt": "དེ་ལྟར་བརྩོན་འགྲུས་བསྐྱེད་ནས་ནི། །\nཡིད་ནི་ཏིང་ངེ་འཛིན་ལ་བཞག །\nསེམས་ནི་རྣམ་པར་གཡེངས་པའི་མི། །\nཉོན་མོངས་མཆི་བའི་ཕྲག་ན་གནས། །",
        "children": []
      },
      {
        "level": "8.2",
        "title": "བསམ་གཏན་འགྲུབ་པའི་རྒྱུ་ཚོགས་བཤད་པ།",
        "lines_span": "5-320",
        "children": [
          {
            "level": "8.2.1",
            "title": "མདོར་བསྟན་པ།",
            "lines_span": "5-8",
            "line_text_excerpt": "ལུས་དང་སེམས་ནི་དབེན་པ་ཡིས། །\nརྣམ་པར་གཡེང་བ་མི་འབྱུང་ངོ་། །\nདེ་བས་འཇིག་རྟེན་སྤང་བྱ་ཞིང་། །\nརྣམ་པར་རྟོག་པ་ཡོངས་སུ་དོར། །",
            "children": []
          },
          {
            "level": "8.2.2",
            "title": "རྒྱས་པ་བཤད་པ།",
            "lines_span": "9-320",
            "children": [
              {
                "level": "8.2.2.1",
                "title": "འཇིག་རྟེན་སྤང་བ།",
                "lines_span": "9-152",
                "children": [
                  {
                    "level": "8.2.2.1.1",
                    "title": "འཇིག་རྟེན་སྤང་དགོས་པའི་རྒྱུ་མཚན་བཤད་པ།",
                    "lines_span": "9-16",
                    "line_text_excerpt": "ཆགས་པའི་ཕྱིར་དང་རྙེད་སོགས་ལ། །\nསྲེད་པས་འཇིག་རྟེན་མི་སྤོང་སྟེ། །\nདེ་བས་འདི་དག་ཡོངས་སྤོངས་ལ། །\nམཁས་པས་འདི་ལྟར་དཔྱད་པར་བྱ། །\nཞི་གནས་རབ་ཏུ་ལྡན་པའི་ལྷག་མཐོང་གིས། །\nཉོན་མོངས་རྣམ་པར་འཇོམས་པར་ཤེས་བྱས་ནས། །\nཐོག་མར་ཞི་གནས་བཙལ་བྱ་དེ་ཡང་ནི། །\nའཇིག་རྟེན་ཆགས་པ་མེད་ལ་མངོན་དགས་འགྲུབ། །",
                    "children": []
                  },
                  {
                    "level": "8.2.2.1.2",
                    "title": "ནང་སེམས་ཅན་གྱི་འཇིག་རྟེན་ལ་སྲེད་པ་སྤོང་བར་བྱ་བ།",
                    "lines_span": "17-64",
                    "line_text_excerpt": "མི་རྟག་སུ་ཞིག་མི་རྟག་ལ། །\nཡང་དག་ཆགས་པར་བྱེད་པ་ཡོད། །\nདེས་ནི་ཚེ་རབས་སྟོང་ཕྲག་ཏུ། །\nསྡུག་པ་མཐོང་བར་ཡོང་མི་འགྱུར། །\nམ་མཐོང་ན་ནི་དགར་མི་འགྱུར། །\nཡིད་ཀྱང་མཉམ་འཇོག་མི་འགྱུར་ལ། །\nམཐོང་ཡང་ངོམས་པར་མི་འགྱུར་བས། །\nསྔར་བཞིན་སྲེད་པས་གདུང་བར་འགྱུར། །\nསེམས་ཅན་རྣམས་ལ་ཆགས་བྱས་ན། །\nཡང་དག་ཉིད་ལ་ཀུན་ནས་སྒྲིབ། །\nསྐྱོ་བའི་སེམས་ཀྱང་འཇིག་པར་བྱེད། །\nཐ་མར་མྱ་ངན་གདུང་བར་འགྱུར། །\nདེ་ལ་སེམས་པ་འབའ་ཞིག་གིས། །\nཚེ་འདི་དོན་མེད་འདའ་བར་འགྱུར། །\nརྟག་པ་མེད་པའི་མཛའ་བཤེས་ཀྱིས། །\nགཡུང་དྲུང་ཆོས་ཀྱང་འཇིག་པར་འགྱུར། །\nབྱིས་དང་སྐལ་བ་མཉམ་སྤྱོད་ན། །\nངེས་པར་ངན་འགྲོར་འགྲོ་འགྱུར་ཏེ། །\nསྐལ་མི་མཉམ་པར་ཁྲིད་བྱེད་ན། །\nབྱིས་པ་བསྟེན་པས་ཅི་ཞིག་བྱ། །\nསྐད་ཅིག་གཅིག་གིས་མཛའ་འགྱུར་ལ། །\nཡུད་ཙམ་གྱིས་ནི་དགྲར་ཡང་འགྱུར། །\nདགའ་བའི་གནས་ལ་ཁྲོ་བྱེད་པས། །\nསོ་སོའི་སྐྱེ་བོ་མགུ་བར་དཀའ། །\nཕན་པར་སྨྲས་ན་ཁྲོ་བར་བྱེད། །\nབདག་ཀྱང་ཕན་ལས་བཟློག་པར་བྱེད། །\nདེ་དག་ངག་ནི་མ་མཉན་ན། །\nཁྲོ་བས་ངན་འགྲོར་འགྲོ་བར་འགྱུར། །\nམཐོ་ལ་ཕྲག་དོག་མཉམ་དང་འགྲན། །\nདམའ་ལ་ང་རྒྱལ་བསྟོད་ན་དྲེགས། །\nམི་སྙན་བརྗོད་ན་ཁོང་ཁྲོ་སྐྱེ། །\nནམ་ཞིག་བྱིས་ལས་ཕན་པ་ཐོབ། །\nབྱིས་དང་འགྲོགས་ན་བྱིས་པ་ལ། །\nབདག་བསྟོད་གཞན་ལ་སྨོད་པ་དང་། །\nའཁོར་བར་དགའ་བའི་གཏམ་ལ་སོགས། །\nམི་དགེ་ཅིས་ཀྱང་ངེས་པར་འབྱུང་། །\nདེ་ལྟར་བདག་དང་གཞན་བསྟེན་པ། །\nདེས་ནི་ཕུང་བར་འགྱུར་བར་ཟད། །\nདེས་ཀྱང་བདག་དོན་མ་བྱས་ལ། །\nབདག་ཀྱང་དེ་དོན་མི་འགྱུར་བས། །\nབྱིས་ལས་ཐག་རིང་བྱོལ་བར་བྱ། །\nཕྲད་ན་དགའ་བས་མགུ་བྱས་ཏེ། །\nའདྲིས་ཆེན་ཉིད་དུ་མི་འགྱུར་བར། །\nཐ་མལ་པ་ཙམ་ལེགས་པར་བྱ། །\nབུང་བས་མེ་ཏོག་སྦྲང་རྩི་བཞིན། །\nཆོས་ཀྱི་དོན་ཙམ་བླངས་ནས་ནི། །\nཀུན་ལ་སྔོན་ཆད་མ་མཐོང་བཞིན། །\nའདྲིས་པ་མེད་པར་གནས་པར་བྱ། །",
                    "children": []
                  },
                  {
                    "level": "8.2.2.1.3",
                    "title": "ཕྱི་རྙེད་སོགས་ཀྱི་འཇིག་རྟེན་ལ་སྲེད་པ་སྤོང་བར་བྱ་བ།",
                    "lines_span": "65-92",
                    "line_text_excerpt": "བདག་ནི་རྙེད་མང་བཀུར་སྟི་བཅས། །\nབདག་ལ་མང་པོ་དགའ་འོ་ཞེས། །\nདེ་འདྲའི་སྙེམས་པ་འཆང་གྱུར་ན། །\nཤི་བའི་འོག་ཏུ་འཇིགས་པ་སྐྱེ། །\nདེ་བས་རྣམ་པར་རྨོངས་པའི་ཡིད། །\nགང་དང་གང་ལ་ཆགས་གྱུར་པ། །\nདེ་དང་དེ་བསྡོངས་སྟོང་འགྱུར་དུ། །\nསྡུག་བསྔལ་ཉིད་དུ་འགྱུར་ཞིང་ལྡང་། །\nདེ་བས་མཁས་པས་ཆགས་མི་བྱ། །\nཆགས་པ་ལས་ནི་འཇིགས་པ་སྐྱེ། །\nའདི་དག་རང་བཞིན་འདོར་འགྱུར་བས། །\nབརྟན་པར་གྱིས་ཏེ་རབ་ཏུ་རྟོགས། །\nརྙེད་པ་དག་ནི་མང་བྱུང་ཞིང་། །\nགྲགས་དང་སྙན་པ་བྱུང་གྱུར་ཀྱང་། །\nརྙེད་དང་གྲགས་པའི་ཚོགས་བཅས་ཏེ། །\nགང་དུ་འདོང་བའི་གཏོལ་མེད་དོ། །\nབདག་ལ་སྨོད་པ་གཞན་ཡོད་ན། །\nབསྟོད་པས་བདག་དགར་ཅི་ཞིག་ཡོད། །\nབདག་ལ་བསྟོད་པ་གཞན་ཡོད་ན། །\nསྨད་པས་མི་དགར་ཅི་ཞིག་ཡོད། །\nསེམས་ཅན་མོས་པ་སྣ་ཚོགས་པ། །\nརྒྱལ་བས་ཀྱང་ནི་མི་མགུ་ན། །\nབདག་འདྲ་ངན་པས་སྨོས་ཅི་དགོས། །\nདེ་བས་འཇིག་རྟེན་བསམ་པ་བཏང་། །\nསེམས་ཅན་རྙེད་པ་མེད་ལ་སྨོད། །\nརྙེད་པ་ཅན་ལ་མི་སྙན་བརྗོད། །\nརང་བཞིན་འགྲོགས་དཀའ་དེ་དག་གིས། །\nདགའ་བ་ཇི་ལྟར་སྐྱེ་བར་འགྱུར། །\nགང་ཕྱིར་བྱིས་པ་རང་དོན་ནི། །\nམེད་པར་དགའ་བ་མི་འབྱུང་བས། །\nབྱིས་པ་འགའ་ཡང་བཤེས་མིན་ཞེས། །\nདེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་གསུངས། །",
                    "children": []
                  },
                  {
                    "level": "8.2.2.1.4",
                    "title": "སྤངས་ནས་དབེན་པའི་ཡོན་ཏན་བརྟེན་ཚུལ།",
                    "lines_span": "93-152",
                    "line_text_excerpt": "ནགས་ན་རི་དྭགས་བྱ་རྣམས་དང་། །\nཤིང་རྣམས་མི་སྙན་རྗོད་མི་བྱེད། །\nའགྲོགས་ན་བདེ་བ་དེ་དག་དང་། །\nནམ་ཞིག་ལྷན་ཅིག་བདག་གནས་འགྱུར། །\nཕུག་གམ་ལྷ་ཁང་སྟེང་པའམ། །\nལྗོན་ཤིང་དྲུང་དུ་གནས་བཅས་ཏེ། །\nནམ་ཞིག་རྒྱབ་ཏུ་མི་ལྟ་ཞིང་། །\nཆགས་པ་མེད་པར་འགྱུར་ཞིག་གུ། །\nས་ཕྱོགས་བདག་གིར་བཟུང་མེད་པ། །\nརང་བཞིན་གྱིས་ནི་ཡངས་རྣམས་སུ། །\nརང་དབང་སྤྱོད་ཅིང་ཆགས་མེད་པར། །\nནམ་ཞིག་བདག་ནི་གནས་པར་འགྱུར། །\nལྷུང་བཟེད་ལ་སོགས་ཉི་ཚེ་དང་། །\nཀུན་ལ་མི་མཁོའི་གོས་འཆང་ཞིང་། །\nལུས་འདི་སྦ་བ་མ་བྱས་ཀྱང་། །\nའཇིགས་མེད་གནས་པར་ནམ་ཞིག་འགྱུར། །\nདུར་ཁྲོད་སོང་ནས་གཞན་དག་གི། །\nརུས་གོང་དག་དང་བདག་གི་ལུས། །\nའཇིག་པའི་ཆོས་ཅན་དག་ཏུ་ནི། །\nནམ་ཞིག་མགོ་སྙོམས་བྱེད་པར་འགྱུར། །\nབདག་གི་ལུས་ནི་འདི་ཉིད་ཀྱང་། །\nགང་གི་དྲི་ཡིས་ཝ་དག་ཀྱང་། །\nདྲུང་དུ་ཉེར་འགྲོ་མི་འགྱུར་བ། །\nདེ་ལྟ་བུར་ནི་འགྱུར་བར་འོང་། །\nལུས་འདི་གཅིག་པུ་བྱུང་བ་ཡང་། །\nལྷན་ཅིག་སྐྱེས་པའི་ཤ་རུས་དག །\nཞིག་སྟེ་སོ་སོར་འགྱེས་འགྱུར་ན། །\nམཛའ་བ་གཞན་དག་ཅི་ཞིག་སྨོས། །\nསྐྱེ་ན་གཅིག་པུ་སྐྱེ་འགྱུར་ཞིང་། །\nའཆི་ནའང་དེ་ཉིད་གཅིག་འཆི་སྟེ། །\nསྡུག་བསྔལ་སྐལ་གཞན་མི་ལེན་ན། །\nགེགས་བྱེད་མཛའ་བས་ཅི་ཞིག་བྱ། །\nལམ་དག་ཏུ་ནི་ཞུགས་པ་རྣམས། །\nཇི་ལྟར་གནས་ནི་འཛིན་བྱེད་ལྟར། །\nདེ་བཞིན་སྲིད་པའི་ལམ་ཞུགས་པའང་། །\nསྐྱེ་བའི་གནས་ནི་ཡོངས་སུ་འཛིན། །\nའཇིག་རྟེན་ཀུན་ནས་གདུང་བཞིན་དུ། །\nཇི་སྲིད་སྐྱེས་བུ་བཞི་ཡིས་ནི། །\nདེ་ལས་དེ་ནི་མ་བཏེག་པ། །\nདེ་སྲིད་དུ་ནི་ནགས་སུ་སོང་། །\nབཤེས་མེད་འཁོན་པའང་མེད་བྱས་ནས། །\nལུས་འདི་གཅིག་པུ་དབེན་གནས་ཏེ། །\nསྔ་ནས་ཤི་དང་འདྲར་བརྩིས་ནས། །\nཤི་ནའང་མྱ་ངན་བྱེད་པ་མེད། །\nདྲུང་ན་འཁོད་པ་སུ་དག་ཀྱང་། །\nམྱ་ངན་གནོད་པ་བྱེད་མེད་པས། །\nའདི་ཡིས་སངས་རྒྱས་རྗེས་དྲན་སོགས། །\nསུས་ཀྱང་གཡེངས་པར་འགྱུར་བ་མེད། །\nདེ་བས་ཤིན་ཏུ་མདངས་དགའ་བའི། །\nནགས་ཚལ་ཚེགས་ཆུང་བདེ་སྐྱིད་ཅིང་། །\nགཡེང་བ་ཐམས་ཅད་ཞི་བྱེད་པར། །\nབདག་ཉིད་གཅིག་པུ་གནས་པར་བྱ། །\nབསམ་པ་གཞན་ནི་ཀུན་བཏང་སྟེ། །\nབདག་ལ་སེམས་པ་གཅིག་པུ་ཡིས། །\nསེམས་ནི་མཉམ་པར་གཞག་ཕྱིར་དང་། །\nདུལ་བར་བྱ་ཕྱིར་བརྩོན་ཏེ་བྱ། །",
                    "children": []
                  }
                ]
              },
              {
                "level": "8.2.2.2",
                "title": "རྣམ་རྟོག་དོར་བ།",
                "lines_span": "153-320",
                "children": [
                  {
                    "level": "8.2.2.2.1",
                    "title": "མདོར་བསྟན་པ།",
                    "lines_span": "153-156",
                    "line_text_excerpt": "འཇིག་རྟེན་འདི་དང་ཕ་རོལ་དུའང་། །\nའདོད་པ་རྣམས་ནི་ཕུང་ཁྲོལ་བསྐྱེད། །\nའདིར་ནི་བསད་དང་བཅིང་དང་གཅོད། །\nཕ་རོལ་དུ་ནི་དམྱལ་སོགས་སྒྲུབ། །",
                    "children": []
                  },
                  {
                    "level": "8.2.2.2.2",
                    "title": "རྒྱས་པར་བཤད་པ།",
                    "lines_span": "157-320",
                    "children": [
                      {
                        "level": "8.2.2.2.2.1",
                        "title": "ནང་བུད་མེད་ལ་སྲེད་པ་སྤོང་བར་བྱ་བ།",
                        "lines_span": "157-280",
                        "children": [
                          {
                            "level": "8.2.2.2.2.1.1",
                            "title": "རྒྱུ་བསྒྲུབ་དཀའ་བ།",
                            "lines_span": "157-168",
                            "line_text_excerpt": "ཕོ་ཉ་ཕོ་ཉ་མོ་ཡིས་སྔོན། །\nགང་ཕྱིར་དུ་མར་གསོལ་བཏབ་ཅིང་། །\nསྡིག་པ་རྣམས་སམ་གྲགས་མིན་ལའང་། །\nགང་གི་དོན་དུ་མ་འཛེམས་པར། །\nའཇིགས་པ་ལ་ཡང་བདག་ཞུགས་ཤིང་། །\nརྫས་ཀྱང་ཟད་པར་བྱས་གྱུར་ཏེ། །\nགང་ལ་ཡོངས་སུ་འཁྱུད་པས་ན། །\nམཆོག་ཏུ་དགའ་འགྱུར་དེ་དག་ཉིད། །\nཀེང་རུས་ཉིད་ཡིན་གཞན་མིན་ན། །\nརང་དབང་དང་ནི་བདག་མིན་ལ། །\nརབ་ཏུ་འདོད་ཅིང་ཡོངས་ཞེན་ནས། །\nཅི་ཕྱིར་མྱ་ངན་འདས་མི་འགྲོ། །",
                            "children": []
                          },
                          {
                            "level": "8.2.2.2.2.1.2",
                            "title": "ངོ་བོ་མི་གཙང་བ་ཡིན་པར་བསམ་པ།",
                            "lines_span": "169-244",
                            "line_text_excerpt": "གང་ཞིག་དང་པོ་འབད་དེ་བཏེག །\nདྲངས་ཀྱང་ངོ་ཚས་འོག་ཏུ་ལྟ། །\nསྔོན་ནི་མཐོང་ངམ་མ་མཐོང་ཡང་། །\nགོས་ཀྱིས་གདོང་ནི་གཡོགས་པར་གྱུར། །\nཁྱོད་ཉོན་མོངས་པའི་གདོང་དེ་ནི། །\nད་ལྟ་མངོན་སུམ་གྱུར་པ་བཞིན། །\nབྱ་རྒོད་ཀྱིས་བསལ་བྱས་མཐོང་ནས། །\nད་ལྟ་ཅི་ཕྱིར་འབྱེར་བར་བྱེད། །\nགཞན་རྣམས་མིག་གིས་བལྟ་ན་ཡང་། །\nགང་ཞིག་ཡོངས་སུ་བསྲུང་གྱུར་པ། །\nཇི་སྲིད་དེ་ནི་དེས་ཟ་ན། །\nསེར་སྣ་ཅན་ཁྱོད་ཅིས་མི་བསྲུང་། །\nཤ་ཡི་ཕུང་པོ་འདི་མཐོང་ནས། །\nབྱ་རྒོད་དང་གཞན་ཟ་བྱེད་ན། །\nགཞན་གྱི་ཟས་ལ་མེ་ཏོག་གི །\nཕྲེང་བ་ཙནྡན་རྒྱན་གྱིས་མཆོད། །\nརུས་གོང་ཉིད་དུ་མཐོང་ནས་ནི། །\nམི་འགུལ་ཡང་ནི་ཁྱོད་སྐྲག་ན། །\nརོ་ལངས་བཞིན་དུ་འགའ་ཡིས་ཀྱང་། །\nབསྐྱོད་པར་གྱུར་ན་ཅིས་མི་འཇིགས། །\nགང་ལ་གཡོགས་ཀྱང་འདི་ཆགས་པ། །\nདེ་མ་གཡོགས་ན་ཅིས་མི་འདོད། །\nདེ་ལ་དགོས་པ་མེད་ན་ནི། །\nགཡོགས་པ་ལ་ནི་ཅི་ཕྱིར་འཁྱུད། །\nཟས་ནི་གཅིག་པུ་ཉིད་ལས་ནི། །\nབཤང་དང་ཁ་ཆུ་བྱུང་གྱུར་ན། །\nདེ་ལས་བཤང་ལ་མི་དགའ་ཞིང་། །\nཁ་ཆུ་ལ་ཁྱོད་ཅི་ཕྱིར་དགའ། །\nཤིང་བལ་རེག་ན་འཇམ་པ་ཡི། །\nསྔས་ལ་དགའ་བར་མི་བྱེད་པར། །\nདྲི་ང་འཛག་པ་མ་ཡིན་ཞེས། །\nའདོད་ལྡན་མི་གཙང་བ་ལ་རྨོངས། །\nའདོད་ལྡན་ངན་པ་རྨོངས་པ་རྣམས། །\nཤིང་བལ་རེག་ན་འཇམ་པ་ལའང་། །\nཉལ་པོ་བྱ་བར་མི་ནུས་ཞེས། །\nདེ་ལ་ཁྲོ་བ་དག་ཏུ་བྱེད། །\nགལ་ཏེ་མི་གཙང་ཆགས་མེད་ན། །\nརུས་གཟེབ་རྒྱུས་པས་སྦྲེལ་བ་ལ། །\nཤ་ཡི་འདམ་གྱིས་ཞལ་ཞལ་བྱས། །\nགཞན་ཁྱོད་ཅི་ཕྱིར་པང་དུ་འཁྱུད། །\nཁྱོད་ཉིད་མི་གཙང་མང་ཡོད་པ། །\nདེ་ཉིད་ལ་ཁྱོད་གཏན་སྤྱོད་ཅིང་། །\nམི་གཙང་རྐྱལ་པ་གཞན་དག་ལའང་། །\nམི་གཙང་བརྐམ་པས་འདོད་པར་བྱེད། །\nབདག་ནི་ཤ་འདི་ལ་དགའ་ཞེས། །\nརེག་དང་བལྟ་བར་འདོད་ན་ཀོ། །\nསེམས་མེད་པ་ཡི་རང་བཞིན་གྱི། །\nཤ་ནི་ཁྱོད་ཀོ་ཇི་ལྟར་འདོད། །\nའདོད་པའི་སེམས་གང་ཡིན་པ་དེ། །\nརེག་དང་བལྟ་བར་མི་ནུས་ལ། །\nགང་ཞིག་ནུས་དེ་ཤེས་པ་མིན། །\nདོན་མེད་འཁྱུད་དེས་ཅི་ཞིག་བྱ། །\nམི་གཙང་རང་བཞིན་གཞན་གྱི་ལུས། །\nམི་རྟོགས་ངོ་མཚར་མི་ཆེ་ཡི། །\nརང་ཉིད་མི་གཙང་ཉིད་ཡིན་པར། །\nརྟོགས་པར་མི་འགྱུར་ངོ་མཚར་ཆེ། །\nསྤྲིན་བྲལ་ཉི་ཟེར་གྱིས་ཕྱེ་བའི། །\nཔདྨ་གཞོན་ནུ་སྤངས་ནས་ནི། །\nམི་གཙང་ཞེན་པའི་སེམས་ཀྱིས་ནི། །\nམི་གཙང་གཟེབ་ལ་ཅི་ཕྱིར་དགའ། །\nས་ཕྱོགས་མི་གཙང་གིས་གོས་པ། །\nགལ་ཏེ་རེག་པར་མི་འདོད་ན། །\nགང་ལས་དེ་ནི་བྱུང་བ་ཡི། །\nལུས་ལ་ཇི་ལྟར་ཁྱོད་རེག་འདོད། །\nགལ་ཏེ་མི་གཙང་ཆགས་མེད་ན། །\nམི་གཙང་ཞིང་ལས་བྱུང་གྱུར་ཅིང་། །\nདེ་ཡི་ས་བོན་དེས་བསྐྱེད་པ། །\nགཞན་ཁྱོད་ཅི་ཕྱིར་པང་དུ་འཁྱུད། །\nམི་གཙང་ལས་བྱུང་མི་གཙང་སྲིན། །\nཆུང་ངུའང་ཁྱོད་འདོད་མི་བྱེད་ལ། །\nམི་གཙང་མང་གི་རང་བཞིན་ལུས། །\nམི་གཙང་སྐྱེས་པའང་འདོད་པར་བྱེད། \nཁྱོད་ནི་རང་ཉིད་མི་གཙང་ལ། །\nསྨོད་མི་བྱེད་པར་མ་ཟད་ཀྱི། །\nམི་གཙང་རྐྱལ་པ་མི་གཙང་ལ། །\nབརྐམ་པས་གཞན་ཡང་འདོད་པར་བྱེད། །\nག་པུར་ལ་སོགས་ཡིད་འོང་དང་། །\nའབྲས་ཆན་དག་གམ་ཚོད་མའང་རུང་། །\nཁར་བཅུག་ཕྱིར་ཕྱུང་བོར་བ་ཡིས། །\nས་ཡང་མི་གཙང་བཙོག་པར་འགྱུར། །\nགལ་ཏེ་མི་གཙང་འདི་འདྲ་བ། །\nམངོན་སུམ་གྱུར་ཀྱང་ཐེ་ཚོམ་ན། །\nདུར་ཁྲོད་དག་ཏུ་བོར་བའི་ལུས། །\nམི་གཙང་གཞན་ཡང་བལྟ་བར་གྱིས། །\nགང་ལས་པགས་པའི་ཁ་ཕྱེ་ན། །\nའཇིགས་པ་ཆེན་པོ་སྐྱེ་འགྱུར་བར། །\nཤེས་ཀྱང་ཇི་ལྟར་དེ་ཉིད་ལ། །\nཕྱིར་ཞིང་དགའ་བ་སྐྱེ་བར་འགྱུར། །\nལུས་ལ་བསྐུས་པའི་དྲི་དེ་ཡང་། །\nཙནྡན་སོགས་ཡིན་གཞན་མ་ཡིན། །\nགཞན་གྱི་དྲི་དེས་གཞན་དག་ལ། །\nཅི་ཡི་ཕྱིར་ན་ཆགས་པར་བྱེད། །\nགལ་ཏེ་རང་བཞིན་དྲི་ང་བས། །\nའདི་ལ་མ་ཆགས་ལེགས་མིན་ནམ། །\nའཇིག་རྟེན་དོན་མེད་སྲེག་པ་དག །\nཇི་སྟེ་དེ་ལ་དྲི་ཞིམ་སྐུད། །\nའོན་ཏེ་དྲི་ཞིམ་ཙནྡན་ནི། །\nལུས་ལ་འདིར་ནི་ཅི་ཞིག་བྱུང་། །\nགཞན་གྱི་དྲི་ཡིས་གཞན་དག་ལ། །\nཅི་ཡི་ཕྱིར་ན་ཆགས་པར་བྱེད། །\nགལ་ཏེ་སྐྲ་སེན་རིང་བ་དང་། །\nསོ་སྐྱ་དྲིར་བཅས་འདམ་གྱི་དྲིས། །\nབསྒོས་པས་ལུས་ཀྱི་རང་བཞིན་ནི། །\nགཅེར་བུ་འཇིགས་པ་ཉིད་ཡིན་ན། །\nརང་ལ་གནོད་པའི་མཚོན་བཞིན་དུ། །\nདེ་འབད་ཅི་ཕྱིར་བྱི་དོར་བྱེད། །\nབདག་ལ་རྨོངས་པའི་འབད་པ་ཡིས། །\nསྨྱོས་པས་ས་འདི་ཀུན་ཏུ་འཁྲུགས། །\nརུས་གོང་འབའ་ཞིག་མཐོང་ནས་ནི། །\nདུར་ཁྲོད་དུ་ནི་ཡིད་འབྱུང་ན། །\nགཡོ་བའི་རུས་གོང་གིས་ཁྱབ་པའི། །\nགྲོང་གི་དུར་ཁྲོད་ལ་དགའ་འམ། །",
                            "children": []
                          },
                          {
                            "level": "8.2.2.2.2.1.3",
                            "title": "འབྲས་བུ་གནོད་པ་མང་བར་བསམ་པ།",
                            "lines_span": "245-280",
                            "line_text_excerpt": "དེ་ལྟར་མི་གཙང་གྱུར་པ་དེ། །\nརིན་མེད་པར་ནི་མི་རྙེད་དོ། །\nདེ་དོན་བསྒྲུབས་པས་ཤ་ཐང་དང་། །\nདམྱལ་ལ་སོགས་པའི་གནོད་པར་འགྱུར། །\nབྱིས་པ་ནོར་སྤེལ་མི་ནུས་པས། །\nདར་ལ་བབ་ན་འདི་ཅི་བདེ། །\nནོར་སོགས་པ་ཡིས་ཚེ་གཏུགས་ན། །\nརྒས་ནས་འདོད་པས་ཅི་ཞིག་བྱ། །\nའདོད་ལྡན་ངན་པ་ཁ་ཅིག་ནི། །\nཉིན་རངས་ལས་ཀྱིས་ཡོངས་དུབ་སྟེ། །\nཁྱིམ་དུ་འོངས་ནས་ཆད་པའི་ལུས། །\nརོ་དང་འདྲ་བར་ཉལ་བར་བྱེད། །\nཁ་ཅིག་བྱེས་བགྲོད་ཉོན་མོངས་དང་། །\nརིང་དུ་སོང་བའི་སྡུག་བསྔལ་ཅན། །\nབུ་སྨད་འདོད་བཞིན་བུ་སྨད་རྣམས། །\nཁྱུད་ཁོར་ལོས་ཀྱང་མཐོང་མི་འགྱུར། །\nབདག་ལ་ཕན་འདོད་རྣམ་རྨོངས་པས། །\nགང་དོན་ཉིད་དུ་བཙོང་བ་ཡང་། །\nདེ་མ་ཐོབ་པར་དོན་མེད་པའི། །\nགཞན་གྱི་ལས་ཀྱི་རླུང་གིས་བདས། །\nལ་ལ་རང་གི་ལུས་བཙོང་ཞིང་། །\nདབང་མེད་གཞན་གྱིས་བཀོལ་གྱུར་ཏེ། །\nཆུང་མ་དག་ཀྱང་བུ་བྱུང་ན། །\nཤིང་དྲུང་དགོན་པར་བབ་བབ་འབྱུང་། །\nའདོད་པས་བསླུས་པའི་གླེན་པ་དག །\nའཚོ་འདོད་འཚོ་བར་བྱའོ་ཞེས། །\nསྲོག་སྟོར་དོགས་བཞིན་གཡུལ་དུ་འཇུག །\nཁེ་ཕྱིར་བྲན་དུ་འགྲོ་བར་བྱེད། །\nའདོད་ལྡན་ལ་ལ་ལུས་ཀྱང་བཅད། །\nཁ་ཅིག་གསལ་ཤིང་རྩེ་ལ་བཙུགས། །\nཁ་ཅིག་མདུང་ཐུང་དག་གིས་བསྣུན། །\nཁ་ཅིག་བསྲེགས་པ་དག་ཀྱང་སྣང་། །",
                            "children": []
                          }
                        ]
                      },
                      {
                        "level": "8.2.2.2.2.2",
                        "title": "ཕྱི་རྙེད་སོགས་ལ་སྲེད་པ་སྤོང་བར་བྱ་བ།",
                        "lines_span": "281-304",
                        "line_text_excerpt": "བསགས་དང་བསྲུང་དང་བརླག་པའི་གདུང་བ་ཡིས། །\nནོར་ནི་ཕུང་ཁྲོལ་མཐའ་ཡས་ཤེས་པར་བྱ། །\nནོར་ལ་ཆགས་པས་གཡེངས་པར་གྱུར་པ་རྣམས། །\nསྲིད་པའི་སྡུག་བསྔལ་ལས་གྲོལ་སྐབས་མེད་དོ། །\nའདོད་ལྡན་རྣམས་ལ་དེ་ལ་སོགས། །\nཉེས་དམིགས་མང་ལ་མནོག་ཆུང་སྟེ། །\nཤིང་རྟ་འདྲེན་པའི་ཕྱུགས་དག་གིས། །\nརྩྭ་ནི་ཁམ་འགའ་ཟོས་པ་བཞིན། །\nཕྱུགས་ཀྱིས་བསྒྲུབས་ནའང་མི་དཀོན་པའི། །\nམནོག་ཆུང་གང་ཡིན་དེ་དོན་དུ། །\nདལ་འབྱོར་ཕུན་སུམ་རྙེད་དཀའ་འདི། །\nལས་ཀྱིས་མནར་བ་རྣམས་ཀྱིས་བཅོམ། །\nའདོད་པ་ངེས་པར་འཇིག་འགྱུར་ཞིང་། །\nདམྱལ་ལ་སོགས་པར་ལྟུང་བྱེད་པ། །\nཆེན་པོ་མིན་ཕྱིར་དུས་ཀུན་དུ། །\nདུབ་པའི་ཚེགས་བྱུང་གང་ཡིན་པ། །\nདེ་ཡི་བྱེ་བའི་ཆ་ཙམ་གྱི། །\nཚེགས་ཀྱིས་སངས་རྒྱས་ཉིད་འགྲུབ་ན། །\nའདོད་ལྡན་བྱང་ཆུབ་སྤྱོད་པ་བས། །\nསྡུག་བསྔལ་ཆེ་ལ་བྱང་ཆུབ་མེད། །\nདམྱལ་སོགས་སྡུག་བསྔལ་བསམ་བྱས་ན། །\nའདོད་པ་རྣམས་ལ་མཚོན་དང་ནི། །\nདུག་དང་མེ་དང་གཡང་ས་དང་། །\nདགྲ་རྣམས་ཀྱིས་ཀྱང་དཔེར་མི་ཕོད། །",
                        "children": []
                      },
                      {
                        "level": "8.2.2.2.2.3",
                        "title": "དབེན་པའི་ཡོན་ཏན་དྲན་པ།",
                        "lines_span": "305-320",
                        "line_text_excerpt": "དེ་ལྟར་འདོད་ལ་སྐྱོ་བྱས་ཏེ། །\nདབེན་པ་ལ་ནི་དགའ་བ་བསྐྱེད། །\nརྩོད་དང་ཉོན་མོངས་ཀྱིས་སྟོང་པ། །\nཞི་བའི་ནགས་ཀྱི་ནང་དག་ཏུ། །\nསྐལ་ལྡན་ཟླ་འོད་ཙནྡན་གྱིས་བསིལ་བའི། །\nཡངས་པའི་རྡོ་ལེབ་ཁང་བཟང་ཉམས་དགའ་བར། །\nསྒྲ་མེད་ཞི་བའི་ནགས་རླུང་གཡོ་བ་ཡིས། །\nགཞན་ལ་ཕན་དོན་སེམས་ཤིང་འཆག་པར་བྱེད། །\nཁང་སྟོང་ཤིང་དྲུང་ཕུག་དག་ཏུ། །\nགང་དུ་ཇི་སྲིད་འདོད་གནས་ཤིང་། །\nཡོངས་འཛིན་བསྲུང་བའི་སྡུག་བསྔལ་སྤངས། །\nལྟོས་པ་མེད་པར་བག་ཡངས་སྤྱོད། །\nརང་དབང་སྤྱོད་ཅིང་ཆགས་མེད་ལ། །\nགང་དང་ཡང་ནི་འབྲེལ་མེད་པ། །\nཆོག་ཤེས་བདེ་སྤྱོད་གང་ཡིན་པ། །\nདབང་པོས་ཀྱང་ནི་དེ་རྙེད་དཀའ། །",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "level": "8.3",
        "title": "བསམ་གཏན་བསྒོམ་པ་དངོས།",
        "lines_span": "321-664",
        "children": [
          {
            "level": "8.3.1",
            "title": "མཚམས་སྦྱར་ཏེ་མདོར་བསྟན་པ།",
            "lines_span": "321-324",
            "line_text_excerpt": "དེ་ལ་སོགས་པའི་རྣམ་པ་ཡིས། །\nདབེན་པའི་ཡོན་ཏན་བསམ་བྱས་ནས། །\nརྣམ་རྟོག་ཉེ་བར་ཞི་བ་དང་། །\nབྱང་ཆུབ་སེམས་ནི་བསྒོམ་པར་བྱ། །",
            "children": []
          },
          {
            "level": "8.3.2",
            "title": "བསམ་གཏན་བསྒོམ་ཚུལ་རྒྱས་པར་བཤད་པ།",
            "lines_span": "325-652",
            "children": [
              {
                "level": "8.3.2.1",
                "title": "བདག་གཞན་མཉམ་པ་བསྒོམ་ཚུལ།",
                "lines_span": "325-384",
                "children": [
                  {
                    "level": "8.3.2.1.1",
                    "title": "མདོར་བསྟན།",
                    "lines_span": "325-328",
                    "line_text_excerpt": "བདག་དང་གཞན་དུ་མཉམ་པ་ནི། །\nདང་པོ་ཉིད་དུ་འབད་དེ་བསྒོམ། །\nབདེ་དང་སྡུག་བསྔལ་མཉམ་པས་ན། །\nཐམས་ཅད་བདག་བཞིན་བསྲུང་བར་བྱ། །",
                    "children": []
                  },
                  {
                    "level": "8.3.2.1.2",
                    "title": "རྒྱས་བཤད།",
                    "lines_span": "329-380",
                    "children": [
                      {
                        "level": "8.3.2.1.2.1",
                        "title": "མཉམ་པ་ཇི་ལྟར་བསྒོམ་ཚུལ།",
                        "lines_span": "329-352",
                        "line_text_excerpt": "ལག་པ་ལ་སོགས་དབྱེ་བ་རྣམ་མང་ཡང་། །\nཡོངས་སུ་བསྲུང་བྱའི་ལུས་སུ་གཅིག་པ་ལྟར། །\nདེ་བཞིན་འགྲོ་བ་ཐ་དད་བདེ་སྡུག་དག །\nཐམས་ཅད་བདག་བཞིན་བདེ་བ་འདོད་མཉམ་གཅིག །\nགལ་ཏེ་བདག་གི་སྡུག་བསྔལ་གྱིས། །\nགཞན་གྱི་ལུས་ལ་མི་གནོད་པ། །\nདེ་ལྟའང་དེ་བདག་སྡུག་བསྔལ་དེ། །\nབདག་ཏུ་ཞེན་པས་མི་བཟོད་ཉིད། །\nདེ་བཞིན་གཞན་གྱི་སྡུག་བསྔལ་དག །\nབདག་ལ་འབབ་པར་མི་འགྱུར་ཡང་། །\nདེ་ལྟའང་དེ་བདག་སྡུག་བསྔལ་དེ། །\nབདག་ཏུ་ཞེན་པས་བཟོད་པར་དཀའ། །\nབདག་གིས་གཞན་གྱི་སྡུག་བསྔལ་བསལ། །\nསྡུག་བསྔལ་ཡིན་ཕྱིར་བདག་སྡུག་བཞིན། །\nབདག་གིས་གཞན་ལ་ཕན་པར་བྱ། །\nསེམས་ཅན་ཡིན་ཕྱིར་བདག་ལུས་བཞིན། །\nགང་ཚེ་བདག་དང་གཞན་གཉི་ག །\nབདེ་བ་འདོད་དུ་མཚུངས་པ་ལ། །\nབདག་དང་ཁྱད་པར་ཅི་ཡོད་ན། །\nགང་ཕྱིར་བདག་གཅིག་བདེ་བར་བརྩོན། །\nགང་ཚེ་བདག་དང་གཞན་གཉི་ག །\nསྡུག་བསྔལ་མི་འདོད་མཚུངས་པ་ལ། །\nབདག་དང་ཁྱད་པར་ཅི་ཡོད་ན། །\nགང་ཕྱིར་གཞན་མིན་བདག་སྲུང་བྱེད། །",
                        "children": []
                      },
                      {
                        "level": "8.3.2.1.2.2",
                        "title": "དེ་ལ་རྩོད་པ་སྤང་བ།",
                        "lines_span": "353-368",
                        "line_text_excerpt": "གལ་ཏེ་དེ་ལ་སྡུག་བསྔལ་བས། །\nབདག་ལ་མི་གནོད་ཕྱིར་མི་བསྲུང་། །\nམ་འོངས་པ་ཡི་སྡུག་བསྔལ་ཡང་། །\nགནོད་མི་བྱེད་ན་དེ་ཅི་བསྲུང་། །\nབདག་གིས་དེ་ནི་མྱོང་སྙམ་པའི། །\nརྣམ་པར་རྟོག་དེ་ལོག་པ་སྟེ། །\nའདི་ལྟར་ཤི་བའང་གཞན་ཉིད་ལ། །\nསྐྱེ་བ་ཡང་ནི་གཞན་ཉིད་ཡིན། །\nགང་ཚེ་གང་གི་སྡུག་བསྔལ་གང་། །\nདེ་ནི་དེ་ཉིད་ཀྱིས་བསྲུང་ན། །\nརྐང་པའི་སྡུག་བསྔལ་ལག་པས་མིན། །\nཅི་ཕྱིར་དེས་ནི་དེ་བསྲུང་བྱ། །\nགལ་ཏེ་རིགས་པ་མིན་ཡང་འདིར། །\nབདག་ཏུ་འཛིན་པས་འཇུག་ཅེ་ན། །\nབདག་གཞན་མི་རིགས་གང་ཡིན་ཏེ། །\nཅི་ནུས་པར་ནི་སྤང་བྱ་ཉིད། །\nརྒྱུད་དང་ཚོགས་ཞེས་བྱ་བ་ནི། །\nཕྲེང་བ་དམག་ལ་སོགས་བཞིན་བརྫུན། །\nསྡུག་བསྔལ་ཅན་གང་དེ་མེད་པ། །\nདེས་འདི་སུ་ཞིག་དབང་བར་འགྱུར། །\nསྡུག་བསྔལ་བདག་པོ་མེད་པར་ནི། །\nཐམས་ཅད་བྱེ་བྲག་མེད་པ་ཉིད། །\nསྡུག་བསྔལ་ཡིན་ཕྱིར་དེ་བསལ་བྱ། །\nངེས་པས་དེར་ནི་ཅི་ཞིག་བྱ། །\nཅི་ཕྱིར་ཀུན་གྱི་སྡུག་བསྔལ་ནི། །\nབཟློག་པར་བྱ་ཞེས་བརྩད་དུ་མེད། །\nགལ་ཏེ་བཟློག་ནའང་ཐམས་ཅད་བཟློག །\nདེ་མིན་བདག་ཀྱང་སེམས་ཅན་བཞིན། །\nསྙིང་རྗེ་སྡུག་བསྔལ་མང་གྱུར་པ། །\nཅི་ཕྱིར་ནན་གྱིས་སྐྱེད་ཅེ་ན། །\nའགྲོ་བའི་སྡུག་བསྔལ་བསམ་བྱས་ན། །\nཇི་ལྟར་སྙིང་རྗེ་སྡུག་བསྔལ་མང་། །\nགལ་ཏེ་སྡུག་བསྔལ་གཅིག་གིས་ནི། །\nསྡུག་བསྔལ་མང་པོ་མེད་འགྱུར་ན། །\nབརྩེ་དང་ལྡན་པས་སྡུག་བསྔལ་དེ། །\nརང་དང་གཞན་ལ་བསྐྱེད་བྱ་ཉིད། །\nདེས་ན་མེ་ཏོག་ཟླ་མཛེས་ཀྱིས། །\nརྒྱལ་པོའི་གནོད་པ་ཤེས་ཀྱང་ནི། །\nབདག་གི་སྡུག་བསྔལ་མ་བསལ་ཏེ། །\nམང་པོའི་སྡུག་བསྔལ་ཟད་འགྱུར་ཕྱིར། །",
                        "children": []
                      },
                      {
                        "level": "8.3.2.1.2.3",
                        "title": "དེ་ལྟར་གོམས་པའི་ཕན་ཡོན།",
                        "lines_span": "369-380",
                        "line_text_excerpt": "དེ་ལྟར་རྒྱུད་ནི་གོམས་གྱུར་པ། །\nགཞན་གྱི་སྡུག་བསྔལ་ཞི་དགའ་བས། །\nཔདྨའི་མཚོ་རུ་ངང་པ་ལྟར། །\nམནར་མེད་པར་ཡང་འཇུག་པར་འགྱུར། །\nསེམས་ཅན་རྣམས་ནི་གྲོལ་བ་ན། །\nདགའ་བའི་རྒྱ་མཚོ་གང་ཡིན་པ། །\nདེ་ཉིད་ཀྱིས་ནི་ཆོག་མིན་ནམ། །\nཐར་པ་འདོད་པས་ཅི་ཞིག་བྱ། །\nདེ་ལྟས་གཞན་གྱི་དོན་བྱས་ཀྱང་། །\nརློམ་སེམས་དང་ནི་ངོ་མཚར་མེད། །\nགཅིག་ཏུ་གཞན་དོན་ལ་དགའ་བས། །\nརྣམ་སྨིན་འབྲས་བུའི་རེ་བ་མེད། །",
                        "children": []
                      }
                    ]
                  },
                  {
                    "level": "8.3.2.1.3",
                    "title": "དོན་བསྡུ་བ།",
                    "lines_span": "381-384",
                    "line_text_excerpt": "དེ་བས་ཇི་ལྟར་ཆུང་ངུ་ན། །\nམི་སྙན་ལས་ཀྱང་བདག་བསྲུང་བ། །\nདེ་བཞིན་གཞན་ལ་བསྲུང་སེམས་དང་། །\nསྙིང་རྗེའི་སེམས་ནི་དེ་ལྟར་བྱ། །",
                    "children": []
                  }
                ]
              },
              {
                "level": "8.3.2.2",
                "title": "བརྗེ་བ་བསྒོམ་ཚུལ།",
                "lines_span": "385-652",
                "children": [
                  {
                    "level": "8.3.2.2.1",
                    "title": "རྒྱུ་མཚན་བརྗོད་པས་མདོར་བསྟན་པ།",
                    "lines_span": "385-396",
                    "line_text_excerpt": "གོམས་པ་ཡིས་ནི་གཞན་དག་གི། །\nཁུ་བ་ཁྲག་གི་ཐིགས་པ་ལ། །\nདངོས་པོ་མེད་པར་གྱུར་ཀྱང་ནི། །\nབདག་གོ་ཞེས་ནི་ཤེས་པ་ལྟར། །\nདེ་བཞིན་གཞན་གྱི་ལུས་ལ་ཡང་། །\nབདག་ཅེས་ཅི་ཡི་ཕྱིར་མི་གཟུང་། །\nབདག་གི་ལུས་ནི་གཞན་དག་ཏུའང་། །\nབཞག་པ་དེ་ལྟར་དཀའ་བ་མེད། །\nབདག་ཉིད་སྐྱོན་བཅས་གཞན་ལ་ཡང་། །\nཡོན་ཏན་རྒྱ་མཚོར་ཤེས་བྱས་ནས། །\nབདག་འཛིན་ཡོངས་སུ་དོར་བ་དང་། །\nགཞན་བླང་བ་ནི་བསྒོམ་པར་བྱ། །",
                    "children": []
                  },
                  {
                    "level": "8.3.2.2.2",
                    "title": "དེ་བསྒོམ་ཚུལ་རྒྱས་པར་བཤད་པ།",
                    "lines_span": "397-652",
                    "children": [
                      {
                        "level": "8.3.2.2.2.1",
                        "title": "བརྗེ་ཚུལ་སྤྱིར་བསྟན་པ།",
                        "lines_span": "397-476",
                        "children": [
                          {
                            "level": "8.3.2.2.2.1.1",
                            "title": "གཞན་དང་དུ་བླང་བ།",
                            "lines_span": "397-416",
                            "line_text_excerpt": "ཇི་ལྟར་ལག་པ་ལ་སོགས་པ། །\nལུས་ཀྱི་ཡན་ལག་ཡིན་འདོད་ལྟར། །\nདེ་བཞིན་འགྲོ་བའི་ཡན་ལག་ཏུ། །\nཅི་ཕྱིར་ལུས་ཅན་རྣམས་མི་འདོད། །\nཇི་ལྟར་བདག་མེད་ལུས་འདི་ལ། །\nགོམས་པས་བདག་གི་བློ་བྱུང་བ། །\nདེ་བཞིན་སེམས་ཅན་གཞན་ལ་ཡང་། །\nགོམས་པས་བདག་བློ་ཅིས་མི་སྐྱེ། །\nདེ་ལྟ་ན་ནི་གཞན་གྱི་དོན། །\nབྱས་ཀྱང་ངོ་མཚར་རློམ་མི་འབྱུང་། །\nབདག་ཉིད་ཀྱིས་ནི་ཟས་ཟོས་ནས། །\nལན་ལ་རེ་བ་མི་འབྱུང་བཞིན། །\nདེ་བས་ཇི་ལྟར་ཆུང་ངུ་ན། །\nམི་སྙན་ལས་ཀྱང་བདག་བསྲུང་བ། །\nདེ་བཞིན་འགྲོ་ལ་བསྲུང་སེམས་དང་། །\nསྙིང་རྗེའི་སེམས་ནི་གོམས་པར་བྱ། །\nདེ་བས་མགོན་པོ་སྤྱན་རས་གཟིགས། །\nཐུགས་རྗེ་ཆེན་པོས་འགྲོ་བ་ཡི། །\nའཁོར་གྱི་འཇིགས་པ་བསལ་བའི་ཕྱིར། །\nརང་གི་མཚན་ཡང་བྱིན་གྱིས་བརླབས། །",
                            "children": []
                          },
                          {
                            "level": "8.3.2.2.2.1.2",
                            "title": "བདག་གཅེས་འཛིན་དོར་བ།",
                            "lines_span": "417-432",
                            "line_text_excerpt": "དཀའ་ལས་ཕྱིར་ལྡོག་མི་བྱ་སྟེ། །\nའདི་ལྟར་གོམས་པའི་མཐུ་ཡིས་ནི། །\nགང་གི་མིང་ཐོས་འཇིགས་པ་ཡང་། །\nདེ་ཉིད་མེད་ན་མི་དགར་འགྱུར། །\nགང་ཞིག་བདག་དང་གཞན་རྣམས་ནི། །\nམྱུར་དུ་བསྐྱབ་པར་འདོད་པ་དེས། །\nབདག་དང་གཞན་དུ་བརྗེ་བྱ་བ། །\nགསང་བའི་དམ་པ་སྤྱད་པར་བྱ། །\nབདག་ལུས་གང་ལ་ཆགས་པ་ཡིས། །\nའཇིགས་གནས་ཆུང་ལ་འཇིགས་སྐྱེ་བ། །\nའཇིགས་པ་སྐྱེ་བའི་ལུས་དེ་ལ། །\nསུ་ཞིག་དགྲ་བཞིན་སྡང་མི་བྱེད། །\nལུས་གང་བཀྲེས་དང་སྐོམ་སོགས་ནད། །\nགསོ་བའི་ཆོ་ག་བྱེད་འདོད་པས། །\nབྱ་དང་ཉ་དང་རི་དྭགས་དག །\nགསོད་པར་བྱེད་ཅིང་ལམ་སྒུགས་བྱེད། །",
                            "children": []
                          },
                          {
                            "level": "8.3.2.2.2.1.3",
                            "title": "བདག་གཞན་གཙོ་བོར་བྱས་པའི་སྐྱོན་ཡོན།",
                            "lines_span": "433-456",
                            "line_text_excerpt": "གང་ཞིག་ཁེ་དང་རིམ་གྲོའི་ཕྱིར། །\nཕ་དང་མ་ཡང་གསོད་བྱེད་ཅིང་། །\nདཀོན་མཆོག་གསུམ་གྱི་དཀོར་བརྐུས་ནས། །\nདེས་ནི་མནར་མེད་བསྲེག་འགྱུར་ན། །\nམཁས་པ་སུ་ཞིག་ལུས་དེ་ལ། །\nའདོད་ཅིང་བསྲུང་དང་མཆོད་བྱེད་ཀྱི། །\nའདི་ལ་སུ་ཞིག་དགྲ་བཞིན་དུ། །\nབལྟ་བར་མི་བྱེད་བརྙས་མི་བྱེད། །\nགལ་ཏེ་བྱིན་ན་ཅི་སྤྱད་ཅེས། །\nབདག་དོན་སེམས་པ་འདྲེ་ཡི་ཚུལ། །\nགལ་ཏེ་སྤྱད་ན་ཅི་སྦྱིན་ཅེས། །\nགཞན་དོན་སེམས་པ་ལྷ་ཡི་ཆོས། །\nབདག་ཕྱིར་གཞན་ལ་གནོད་བྱས་ན། །\nདམྱལ་ལ་སོགས་པར་གདུངས་པར་འགྱུར། །\nགཞན་ཕྱིར་བདག་ལ་གནོད་བྱས་ན། །\nཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་འཐོབ། །\nབདག་ཉིད་མཐོ་བར་འདོད་པ་དེས། །\nངན་འགྲོ་ངན་དང་གླེན་པར་འགྱུར། །\nདེ་ཉིད་གཞན་ལ་སྤོ་བྱས་ན། །\nབདེ་འགྲོ་རིམ་གྲོ་འཐོབ་པར་འགྱུར། །\nབདག་གི་དོན་དུ་གཞན་བཀོལ་ན། །\nབྲན་ལ་སོགས་པ་མྱོང་བར་འགྱུར། །\nགཞན་གྱི་དོན་དུ་བདག་སྤྱད་ན། །\nརྗེ་དཔོན་ཉིད་སོགས་མྱོང་བར་འགྱུར། །\nའཇིག་རྟེན་བདེ་བ་ཇི་སྙེད་པ། །\nདེ་ཀུན་གཞན་བདེ་འདོད་ལས་བྱུང་། །\nའཇིག་རྟེན་སྡུག་བསྔལ་ཇི་སྙེད་པ། །\nདེ་ཀུན་རང་བདེ་འདོད་ལས་བྱུང་། །\nམང་དུ་བཤད་ལྟ་ཅི་ཞིག་དགོས། །\nབྱིས་པ་རང་གི་དོན་བྱེད་དང་། །\nཐུབ་པ་གཞན་གྱི་དོན་མཛད་པ། །\nའདི་གཉིས་ཀྱི་ནི་ཁྱད་པར་ལྟོས། །\nབདག་བདེ་གཞན་གྱི་སྡུག་བསྔལ་དག །\nཡང་དག་བརྗེ་བ་མ་བྱས་ན། །\nསངས་རྒྱས་ཉིད་དུ་མི་འགྲུབ་ཅིང་། །\nའཁོར་བ་ན་ཡང་བདེ་བ་མེད། །",
                            "children": []
                          },
                          {
                            "level": "8.3.2.2.2.1.4",
                            "title": "དེས་ན་ངེས་པར་བརྗེ་དགོས་པར་གདམས་པ་བརྗེ་བ་དངོས།",
                            "lines_span": "457-476",
                            "line_text_excerpt": "འཇིག་རྟེན་ཕ་རོལ་ཕར་ཞོག་གི །\nབྲན་གཡོག་ལས་མི་བྱེད་པ་དང་། །\nརྗེ་དཔོན་རྔན་པ་མི་སྟེར་བའི། །\nཚེ་འདིའི་དོན་ཡང་འགྲུབ་མི་འགྱུར། །\nམཐོང་དང་མ་མཐོང་བདེ་འགྲུབ་པའི། །\nཕུན་སུམ་བདེ་སྐྱིད་ཡོངས་བོར་ཞིང་། །\nགཞན་ལ་སྡུག་བསྔལ་བྱས་པའི་རྒྱུས། །\nརྨོངས་པས་སྡུག་བསྔལ་མི་བཟད་ལེན། །\nའཇིག་རྟེན་དག་ན་འཚེ་བ་གང་ཡོད་དང་། །\nའཇིགས་དང་སྡུག་བསྔལ་ཇི་སྙེད་ཡོད་གྱུར་པ། །\nདེ་ཀུན་བདག་ཏུ་འཛིན་པ་ལས་བྱུང་ན། །\nའདྲེ་ཆེན་དེས་ཀོ་བདག་ལ་ཅི་ཞིག་བྱ། །\nབདག་ཉིད་ཡོངས་སུ་མ་བཏང་ན། །\nསྡུག་བསྔལ་སྤང་བར་མི་ནུས་ཏེ། །\nཇི་ལྟར་མེ་ནི་མ་བཏང་ན། །\nསྲེག་པ་སྤོང་བར་མི་ནུས་བཞིན། །\nདེ་ལྟས་བདག་གནོད་ཞི་བ་དང་། །\nགཞན་གྱི་སྡུག་བསྔལ་ཞི་བྱའི་ཕྱིར། །\nབདག་ཉིད་གཞན་ལ་གཏང་བྱ་དང་། །\nགཞན་རྣམས་བདག་བཞིན་གཟུང་བར་བྱ། །",
                            "children": []
                          }
                        ]
                      },
                      {
                        "level": "8.3.2.2.2.2",
                        "title": "གཉེན་པོའི་ཁྱད་པར་བྱེ་བྲག་ཏུ་བསྒོམས་པ།",
                        "lines_span": "477-544",
                        "children": [
                          {
                            "level": "8.3.2.2.2.2.1",
                            "title": "མདོར་བསྟན་པ།",
                            "lines_span": "477-480",
                            "line_text_excerpt": "དམན་སོགས་བདག་ཏུ་བྱས་པ་དང་། །\nགཞན་ཉིད་དུ་ནི་བདག་བྱས་ནས། །\nརྣམ་རྟོག་མེད་པའི་སེམས་ཀྱིས་སུ། །\nཕྲག་དོག་འགྲན་དང་ང་རྒྱལ་བསྒོམ། །",
                            "children": []
                          },
                          {
                            "level": "8.3.2.2.2.2.2",
                            "title": "རྒྱས་པར་བཤད་པ།",
                            "lines_span": "481-544",
                            "children": [
                              {
                                "level": "8.3.2.2.2.2.2.1",
                                "title": "དམན་པ་ལ་བརྗེས་ནས་ཕྲག་དོག་བསྒོམ་པ།",
                                "lines_span": "481-512",
                                "line_text_excerpt": "འདི་ནི་བཀུར་བྱས་བདག་ནི་མིན། །\nའདི་བཞིན་བདག་གིས་མ་རྙེད་ཅིང་། །\nའདི་ནི་བསྟོད་བྱས་བདག་ལ་སྨོད། །\nའདི་བདེ་བདག་ནི་སྡུག་བསྔལ་ལ། །\nབདག་ནི་ལས་རྣམས་བྱེད་པ་དང་། །\nའདི་ནི་བདེ་བ་ཉིད་དུ་གནས། །\nའདི་ནི་འཇིག་རྟེན་ལ་ཆེ་དང་། །\nབདག་དམན་ཡོན་ཏན་མེད་པར་གྲག །\nཡོན་ཏན་མེད་པས་ཅི་ཞིག་བྱ། །\nབདག་ཀུན་ཡོན་ཏན་ལྡན་པ་ཉིད། །\nགང་བས་འདི་དམན་དེ་ཡོད་ཅིང་། །\nགང་བས་བདག་མཆོག་དེ་ཡང་ཡོད། །\nཚུལ་ཁྲིམས་ལྟ་བ་གུད་སོགས་ནི། །\nཉོན་མོངས་སྟོབས་ཀྱིས་བདག་དབང་མིན། །\nཅི་ནུས་བདག་ནི་གསོ་དགོས་ཏེ། །\nགནོད་པའང་བདག་གིས་དང་དུ་བླང་། །\nའོན་ཏེ་བདག་འདིའི་གསོ་བྱ་མིན། །\nཅི་ཕྱིར་བདག་ལ་བརྙས་པ་བྱེད། །\nབདག་ལ་དེ་ཡི་ཡོན་ཏན་གྱིས། །\nཅི་བྱ་འདི་བདག་ཡོན་ཏན་ཅན། །\nངན་འགྲོ་གདུག་པའི་ཁར་གནས་པ། །\nའགྲོ་ལ་སྙིང་རྗེ་མེད་པར་འདི། །\nཕྱིར་ལ་ཡོན་ཏན་རློམ་པ་ཡིས། །\nམཁས་པ་དག་ལ་བདོ་བར་འདོད། །",
                                "children": []
                              },
                              {
                                "level": "8.3.2.2.2.2.2.2",
                                "title": "མཉམ་པ་ལ་བརྗེས་ནས་འགྲན་སེམས་བསྒོམ་ཚུལ།",
                                "lines_span": "513-528",
                                "line_text_excerpt": "བདག་དང་མཉམ་ལ་བལྟས་ནས་ནི། །\nགང་གིས་རང་ཉིད་ལྷག་བྱའི་ཕྱིར། །\nབདག་གི་རྙེད་དང་བཀུར་སྟི་ནི། །\nརྩོད་པ་ཡིས་ཀྱང་ངེས་པར་བསྒྲུབ། །\nཅི་ནས་བདག་གི་ཡོན་ཏན་ནི། །\nའཇིག་རྟེན་ཀུན་ལ་གསལ་བ་དང་། །\nགཞན་ཡང་འདི་ཡི་ཡོན་ཏན་གང་། །\nསུས་ཀྱང་ཐོས་པར་མི་འགྱུར་བྱ། །\nབདག་གི་སྐྱོན་ཡང་སྦ་བྱ་ཞིང་། །\nབདག་ནི་མཆོད་འགྱུར་འདི་ལ་མིན། །\nབདག་དེང་རྙེད་པ་ལེགས་རྙེད་ཅིང་། །\nབདག་ནི་བཀུར་འགྱུར་འདི་ལ་མིན། །\nའདི་ནི་མ་རུངས་བྱས་པ་ལ། །\nཡུན་རིང་བདག་ནི་དགའ་བས་ལྟ། །\nའགྲོ་བ་ཀུན་གྱི་བཞད་གད་དང་། །\nཕན་ཚུན་སྨོད་པ་དག་ཏུ་བྱ། །",
                                "children": []
                              },
                              {
                                "level": "8.3.2.2.2.2.2.3",
                                "title": "ལྷག་པ་ལ་བརྗེས་ནས་ང་རྒྱལ་བསྒོམ་ཚུལ།",
                                "lines_span": "529-544",
                                "line_text_excerpt": "ཉོན་མོངས་འདི་ཡང་བདག་དང་ནི། །\nལྷན་ཅིག་ཏུ་ནི་འགྲན་ཅེས་གྲག །\nའདི་དག་ཐོས་དང་ཤེས་རབ་བམ། །\nགཟུགས་རིགས་ནོར་གྱིས་མཉམ་མམ་ཅི། །\nདེ་ལྟར་ཀུན་ལ་བསྒྲགས་པ་ཡི། །\nབདག་གི་ཡོན་ཏན་ཐོས་ནས་ནི། །\nསྤུ་ལྡང་དགའ་བ་སྐྱེ་གྱུར་པའི། །\nབདེ་སྐྱིད་ལ་ནི་ཡོངས་སུ་སྤྱོད། །\nཅི་སྟེ་འདི་ལ་རྙེད་ཡོད་ཀྱང་། །\nགལ་ཏེ་ང་ཡི་ལས་བྱེད་ན། །\nའདི་ལ་འཚོ་བ་ཙམ་བྱིན་ནས། །\nབདག་གི་སྟོབས་ཀྱིས་དེ་བླང་བྱ། །\nའདི་ནི་བདེ་ལས་ཉམས་བྱ་ཞིང་། །\nབདག་གི་གནོད་དང་རྟག་སྦྱར་བྱ། །\nའདི་ཡིས་བརྒྱ་ཕྲག་ཐམས་ཅད་དུ། །\nའཁོར་བར་བདག་ལ་གནོད་པ་བྱས། །",
                                "children": []
                              }
                            ]
                          }
                        ]
                      },
                      {
                        "level": "8.3.2.2.2.3",
                        "title": "བརྗེས་ནས་ཇི་ལྟར་བསྒྲུབ་པ།",
                        "lines_span": "545-652",
                        "children": [
                          {
                            "level": "8.3.2.2.2.3.1",
                            "title": "འཇམ་པོའི་སྒོ་ནས་གདམས་པ།",
                            "lines_span": "545-580",
                            "line_text_excerpt": "ཡིད་ཁྱོད་རང་དོན་བྱེད་འདོད་པས། །\nབསྐལ་པ་གྲངས་མེད་འདས་གྱུར་ཀྱང་། །\nངལ་བ་ཆེན་པོ་དེ་ལྟ་བུར། །\nཁྱོད་ཀྱིས་སྡུག་བསྔལ་འབའ་ཞིག་བསྒྲུབས། །\nདེ་ལྟར་ངེས་པར་གཞན་དག་གི །\nདོན་ལ་རབ་ཏུ་འཇུག་གྱིས་དང་། །\nཐུབ་པའི་བཀའ་ནི་མི་སླུ་བས། །\nདེ་ཡི་ཡོན་ཏན་ཕྱིས་མཐོང་འགྱུར། །\nགལ་ཏེ་ཁྱོད་ཀྱིས་སྔ་དུས་སུ། །\nལས་འདི་བྱས་པར་གྱུར་ན་ནི། །\nསངས་རྒྱས་ཕུན་སུམ་བདེ་མིན་པ། །\nགནས་སྐབས་འདི་འདྲར་འགྱུར་མི་སྲིད། །\nདེ་བས་འདི་ལྟར་གཞན་དག་གི །\nཁུ་བ་ཁྲག་གི་ཐིགས་པ་ལ། །\nཁྱོད་ཀྱིས་ངར་འཛིན་བྱས་པ་ལྟར། །\nདེ་བཞིན་གཞན་ལའང་གོམས་པར་གྱིས། །\nགཞན་གྱི་རྟོག་ཆེན་བྱས་ནས་ནི། །\nབདག་གི་ལུས་ལ་ཅི་སྣང་བ། །\nདེ་དང་དེ་ཉིད་ཕྲོགས་བྱས་ནས། །\nཁྱོད་ཀྱིས་གཞན་ལ་ཕན་པ་སྤྱོད། །\nབདག་སྐྱིད་གཞན་ནི་མི་སྐྱིད་ལ། །\nབདག་མཐོ་གཞན་ནི་དམའ་བ་དང་། །\nབདག་ནི་ཕན་བྱེད་གཞན་མིན་ཞེས། །\nབདག་ལ་ཕྲག་དོག་ཅིས་མི་བྱེད། །\nབདག་ནི་བདེ་དང་བྲལ་གྱིས་ཏེ། །\nགཞན་གྱི་སྡུག་བསྔལ་བདག་ལ་སྦྱོར། །\nགང་ཚེ་འདི་ནི་ཅི་བྱེད་ཅེས། །\nབདག་གི་སྐྱོན་ལ་བརྟག་པར་གྱིས། །\nགཞན་གྱིས་ཉེས་པ་བྱས་པ་ཡང་། །\nརང་གི་སྐྱོན་དུ་བསྒྱུར་བྱོས་ལ། །\nབདག་གི་ཉེས་པ་ཆུང་བྱས་ཀྱང་། །\nསྐྱེ་བོ་མང་ལ་རབ་ཏུ་ཤོགས། །\nགཞན་གྱི་གྲགས་པ་ལྷག་བརྗོད་པས། །\nརང་གི་གྲགས་པ་ཟིལ་གྱིས་ནོན། །\nབདག་ནི་བྲན་གྱི་ཐ་མ་ལྟར། །\nདོན་རྣམས་ཀུན་ལ་བཀོལ་བར་གྱིས། །",
                            "children": []
                          },
                          {
                            "level": "8.3.2.2.2.3.2",
                            "title": "རྩུབ་མོའི་སྒོ་ནས་ཚར་བཅད་པ།",
                            "lines_span": "581-652",
                            "children": [
                              {
                                "level": "8.3.2.2.2.3.2.1",
                                "title": "ཡིད་ཚར་བཅད་པ།",
                                "lines_span": "581-612",
                                "line_text_excerpt": "འདི་ནི་གཉའ་དྲག་འགྱུར་ཚུལ་དུ། །\nཤེད་བསྐྱེད་པར་ནི་མི་བྱ་སྟེ། །\nབག་མ་གསར་པའི་ཚུལ་བཞིན་དུ། །\nངོ་ཚ་འཇིགས་དང་བསྡམས་ཏེ་བཞག །\nདེ་བྱ་དེ་ལྟར་གནས་བྱ་ཞིང་། །\nདེ་ལྟར་ཁྱོད་ཀྱིས་མི་བྱ་བ། །\nདེ་ལྟར་འདི་ནི་དབང་བྱ་སྟེ། །\nདེ་ལས་འདས་ན་ཚར་གཅད་བྱ། །\nའོན་ཏེ་དེ་ལྟར་གདམས་ཀྱང་ནི། །\nསེམས་ཁྱོད་དེ་ལྟར་མི་བྱེད་ན། །\nཁྱོད་ལ་ཉེས་པ་ཀུན་བསྟེན་པས། །\nཁྱོད་ཉིད་ཚར་གཅད་བྱ་བར་ཟད། །\nཁྱོད་ཀྱིས་ཁོ་བོ་གར་བརླག་པའི། །\nསྔོན་གྱི་དུས་དེ་གཞན་ཡིན་ཏེ། །\nངས་མཐོང་ད་ཁྱོད་གང་དུ་འགྲོ། །\nཁྱོད་ཀྱི་དྲེགས་པ་ཀུན་གཞོམ་བྱ། །\nད་དུང་བདག་ལ་རང་གི་དོན། །\nཡོད་སྙམ་སེམས་པ་དེ་དོར་ཅིག །\nབདག་གིས་གཞན་ལ་ཁྱོད་བཙོང་གིས། །\nསྐྱོ་བར་མ་སེམས་ཞོ་ཤ་ཕུལ། །\nགལ་ཏེ་བག་མེད་གྱུར་ནས་ཁྱོད། །\nསེམས་ཅན་རྣམས་ལ་མ་བྱིན་ན། །\nཁྱོད་ཀྱིས་ཁོ་བོ་དམྱལ་བ་ཡི། །\nསྲུང་མ་རྣམས་ལ་བྱིན་དུ་ངེས། །\nདེ་ལྟར་ཁྱོད་ཀྱིས་རེ་ལྟ་ཞིག །\nཁོ་བོ་བྱིན་པས་ཡུན་རིང་སྡུག །\nང་ནི་ཁོན་རྣམས་དྲན་བྱས་ཏེ། །\nཁྱོད་ཀྱིས་རང་དོན་སེམས་པ་གཞོམ། །\nདེ་སྟེ་བདག་ནི་དགའ་འདོད་ན། །\nརང་ལ་བདག་གིས་དགར་མི་བྱ། །\nདེ་སྟེ་བདག་ནི་བསྲུང་འདོད་ན། །\nགཞན་དག་རྟག་ཏུ་བསྲུང་བར་བྱ། །",
                                "children": []
                              },
                              {
                                "level": "8.3.2.2.2.3.2.2",
                                "title": "ལུས་ཚར་བཅད་པ།",
                                "lines_span": "613-652",
                                "line_text_excerpt": "ཇི་ལྟ་ཇི་ལྟར་ལུས་འདི་ནི། །\nཡོངས་སུ་སྐྱོང་བར་བྱེད་གྱུར་པ། །\nདེ་ལྟ་དེ་ལྟར་ཤིན་ཏུ་ནི། །\nབཟེ་རེ་ཅན་གྱུར་ཉིད་དུ་ལྟུང་། །\nདེ་ལྟར་ལྷུང་བ་དེ་ཡི་ཡང་། །\nའདོད་པ་ས་འདི་ཐམས་ཅད་ཀྱིས། །\nརྫོགས་པར་ནུས་པ་ཡོད་མིན་ན། །\nདེ་ཡི་འདོད་པ་སུས་བྱེད་ནུས། །\nནུས་མེད་འདོད་པ་ཉོན་མོངས་དང་། །\nབསམ་པ་ཉམས་པའང་སྐྱེ་བར་འགྱུར། །\nགང་ཞིག་ཀུན་ལ་ལྟོས་མེད་པ། །\nདེ་ཡི་ཕུན་ཚོགས་ཟད་མི་ཤེས། །\nདེ་བས་ལུས་ཀྱི་འདོད་པ་ནི། །\nའཕེལ་ཕྱིར་སྐབས་དབྱེ་མི་བྱ་སྟེ། །\nགང་ཞིག་ཡིད་འོང་མི་འཛིན་པ། །\nདེ་ནི་དངོས་པོ་བཟང་པོ་ཡིན། །\nཐ་མར་ཐལ་བའི་མཐར་གཏུགས་ཤིང་། །\nམི་གཡོ་གཞན་གྱིས་བསྐྱོད་བྱ་བ། །\nམི་གཙང་གཟུགས་ནི་མི་བཟད་པ། །\nའདི་ལ་ཅི་ཕྱིར་བདག་ཏུ་འཛིན། །\nགསོན་ནམ་ཡང་ན་ཤི་ཡང་བླའི། །\nབདག་ལ་འཁྲུལ་འཁོར་འདིས་ཅི་བྱ། །\nབོང་སོགས་འདི་ཁྱད་ཅི་ཡོད་ན། །\nཀྱི་ཧུད་ང་རྒྱལ་སེལ་མི་བྱེད། །\nལུས་ཀྱི་ཁ་ཏ་བྱས་པ་ཡིས། །\nདོན་མེད་སྡུག་བསྔལ་ཉེར་བསགས་ནས། །\nརྗེས་སུ་ཆགས་དང་ཁོང་ཁྲོ་བ། །\nཤིང་མཚུངས་འདི་ལ་ཅི་ཞིག་བྱ། །\nབདག་གིས་འདི་ལྟར་བསྐྱངས་པའམ། །\nབྱ་རྒོད་སོགས་ཀྱིས་ཟོས་ཀྱང་རུང་། །\nཆགས་མེད་ཞེ་སྡང་ཡོད་མིན་ན། །\nཅི་སྟེ་དེ་ལ་ཆགས་པར་བྱེད། །\nགང་ཞིག་སྨོད་པས་ཁྲོ་བ་དང་། །\nགང་ཞིག་བསྟོད་པས་མགུ་འགྱུར་བ། །\nགལ་ཏེ་དེ་ཉིད་ཤེས་མེད་ན། །\nབདག་གིས་གང་གི་ངལ་བ་བྱས། །\nགང་ཞིག་ལུས་འདི་འདོད་འགྱུར་བ། །\nདེ་དང་བདག་བཤེས་ཡིན་ཞེ་ན། །\nཐམས་ཅད་རང་གི་ལུས་འདོད་པས། །\nདེ་ལ་བདག་གོ་ཅིས་མི་དགའ། །\nདེ་བས་བདག་གིས་ཆགས་མེད་པར། །\nའགྲོ་ལ་ཕན་ཕྱིར་ལུས་གཏང་བྱ། །\nདེས་ན་འདི་ལ་ཉེས་མང་ཡང་། །\nལས་ཀྱི་སྤྱད་བཞིན་གཟུང་བར་བྱ། །",
                                "children": []
                              }
                            ]
                          }
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "level": "8.3.3",
            "title": "ཏིང་ངེ་འཛིན་འགྲུབ་པའི་ཐབས་ལ་གདམས་པ།",
            "lines_span": "653-664",
            "line_text_excerpt": "དེ་བས་བྱིས་པའི་སྤྱོད་པས་ཆོག །\nབདག་གིས་མཁས་པའི་རྗེས་བསྙགས་ཏེ། །\nབག་ཡོད་གཏམ་ནི་དྲན་བྱས་ནས། །\nགཉིད་དང་རྨུགས་པ་བཟློག་པར་བྱ། །\nརྒྱལ་སྲས་ཐུགས་རྗེ་ཆེ་རྣམས་ལྟར། །\nརིགས་པའི་སྲན་ནི་གཟུགས་བྱ་སྟེ། །\nཉིན་མཚན་ཕྱད་པར་མ་འབད་ན། །\nབདག་གི་སྡུག་བསྔལ་ནམ་མཐར་ཕྱིན། །\nདེ་བས་སྒྲིབ་པ་བསལ་བའི་ཕྱིར། །\nལོག་པའི་ལམ་ལས་སེམས་བླན་ཏེ། །\nཡང་དག་དམིགས་ལ་རྟག་པར་ཡང་། །\nབདག་གིས་མཉམ་པར་གཞག་པར་བྱ། །",
            "children": []
          }
        ]
      },
      {
        "level": "8.4",
        "title": "ལེའུའི་མཚན།",
        "lines_span": "665-665",
        "line_text_excerpt": "བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་ལས། །\nབསམ་གཏན་བསྟན་པ་ཞེས་བྱ་བ་སྟེ་ལེའུ་བརྒྱད་པའོ།། །།",
        "children": []
      }
    ]
  }
]