[
  {
    "level": "chapter-1",
    "title": "ལེའུ་དང་པོ། བྱང་ཆུབ་སེམས་ཀྱི་ཕན་ཡོན་བཤད་པ།",
    "lines_span": "1-106",
    "children": [
      {
        "level": "section-1.1",
        "title": "མཆོད་པར་བརྗོད་པ་དང་རྩོམ་པར་དམ་བཅའ་བ།",
        "lines_span": "1-12",
        "children": [
          {
            "level": "subsection-1.1.1",
            "title": "ཕྱག་འཚལ་བ།",
            "lines_span": "1-2",
            "line_text_excerpt": "བདེ་གཤེགས་ཆོས་ཀྱི་སྐུ་མངའ་སྲས་བཅས་དང་། །\nཕྱག་འོས་ཀུན་ལའང་གུས་པར་ཕྱག་འཚལ་ཏེ། །",
            "children": []
          },
          {
            "level": "subsection-1.1.2",
            "title": "བསྟན་བཅོས་རྩོམ་པར་དམ་བཅའ་བ།",
            "lines_span": "3-4",
            "line_text_excerpt": "བདེ་གཤེགས་སྲས་ཀྱི་སྡོམ་ལ་འཇུག་པ་ནི། །\nལུང་བཞིན་མདོར་བསྡུས་ནས་ནི་བརྗོད་པར་བྱ། །",
            "children": []
          },
          {
            "level": "subsection-1.1.3",
            "title": "ཚིག་དོན་ལ་མཁས་པའི་ང་རྒྱལ་སྤངས་པ།",
            "lines_span": "5-8",
            "line_text_excerpt": "སྔོན་ཆད་མ་བྱུང་བ་ཡང་འདིར་བརྗོད་མེད། །\nསྡེབ་སྦྱོར་མཁས་པའང་བདག་ལ་ཡོད་མིན་ཏེ། །\nདེ་ཕྱིར་གཞན་དོན་བསམ་པ་བདག་ལ་མེད། །\nརང་གི་ཡིད་ལ་བསྒོམ་ཕྱིར་ངས་འདི་བརྩམས། །",
            "children": []
          },
          {
            "level": "subsection-1.1.4",
            "title": "རང་གཞན་གྱི་དོན་དུ་རྩོམ་པ།",
            "lines_span": "9-12",
            "line_text_excerpt": "དགེ་བ་བསྒོམ་ཕྱིར་བདག་གི་དད་པའི་ཤུགས། །\nའདི་དག་གིས་ཀྱང་རེ་ཞིག་འཕེལ་འགྱུར་ལ། །\nབདག་དང་སྐལ་བ་མཉམ་པ་གཞན་གྱིས་ཀྱང་། །\nཅི་སྟེ་འདི་དག་མཐོང་ན་དོན་ཡོད་འགྱུར། །",
            "children": []
          }
        ]
      },
      {
        "level": "section-1.2",
        "title": "བྱང་ཆུབ་སེམས་ཀྱི་རྟེན་དང་བརྟེན་པའི་ཕན་ཡོན།",
        "lines_span": "13-106",
        "children": [
          {
            "level": "subsection-1.2.1",
            "title": "བྱང་ཆུབ་སེམས་ཀྱི་རྟེན།",
            "lines_span": "13-20",
            "children": [
              {
                "level": "subsubsection-1.2.1.1",
                "title": "ལུས་རྟེན་བཤད་པ།",
                "lines_span": "13-16",
                "line_text_excerpt": "དལ་འབྱོར་འདི་ནི་རྙེད་པར་ཤིན་ཏུ་དཀའ། །\nསྐྱེས་བུའི་དོན་སྒྲུབ་ཐོབ་པར་གྱུར་པ་ལ། །\nགལ་ཏེ་འདི་ལ་ཕན་པ་མ་བསྒྲུབས་ན། །\nཕྱིས་འདི་ཡང་དག་འབྱོར་པར་ག་ལ་འགྱུར། །",
                "children": []
              },
              {
                "level": "subsubsection-1.2.1.2",
                "title": "སེམས་རྟེན་བཤད་པ།",
                "lines_span": "17-20",
                "line_text_excerpt": "ཇི་ལྟར་མཚན་མོ་མུན་ནག་སྤྲིན་རུམ་ན། །\nགློག་འགྱུ་སྐད་ཅིག་རབ་སྣང་སྟོན་པ་ལྟར། །\nདེ་བཞིན་སངས་རྒྱས་མཐུ་ཡིས་བརྒྱ་ལམ་ན། །\nའཇིག་རྟེན་བསོད་ནམས་བློ་གྲོས་ཐང་འགའ་འབྱུང་། །",
                "children": []
              }
            ]
          },
          {
            "level": "subsection-1.2.2",
            "title": "བརྟེན་པ་སེམས་བསྐྱེད་ཀྱི་ཕན་ཡོན།",
            "lines_span": "21-106",
            "children": [
              {
                "level": "subsubsection-1.2.2.1",
                "title": "སེམས་བསྐྱེད་སྤྱིའི་ཕན་ཡོན།",
                "lines_span": "21-62",
                "children": [
                  {
                    "level": "paragraph-1.2.2.1.1",
                    "title": "དགེ་བ་གཞན་ལས་ཁྱད་པར་དུ་འཕགས་པའི་ཕན་ཡོན།",
                    "lines_span": "21-36",
                    "line_text_excerpt": "དེ་ལྟས་དགེ་བ་ཉམ་ཆུང་ཉིད་ལ་རྟག །\nསྡིག་པ་སྟོབས་ཆེན་ཤིན་ཏུ་མི་བཟད་པ། །\nདེ་ནི་རྫོགས་པའི་བྱང་ཆུབ་སེམས་མིན་པ། །\nདགེ་གཞན་གང་གིས་ཟིལ་གྱིས་གནོན་པར་འགྱུར། །\nབསྐལ་པ་དུ་མར་རབ་དགོངས་མཛད་པ་ཡི། །\nཐུབ་དབང་རྣམས་ཀྱིས་འདི་ཉིད་ཕན་པར་གཟིགས། །\nའདིས་ནི་ཚད་མེད་སྐྱེ་བོའི་ཚོགས་རྣམས་ཀྱིས། །\nབདེ་མཆོག་བདེ་བླག་ཉིད་དུ་ཐོབ་པར་བྱེད། །\nསྲིད་པའི་སྡུག་བསྔལ་བརྒྱ་ཕྲག་གཞོམ་འདོད་ཅིང་། །\nསེམས་ཅན་མི་བདེ་བསལ་བར་འདོད་པ་དང་། །\nབདེ་མང་བརྒྱ་ཕྲག་སྤྱོད་པར་འདོད་པས་ཀྱང་། །\nབྱང་ཆུབ་སེམས་ཉིད་རྟག་ཏུ་གཏང་མི་བྱ། །",
                    "children": []
                  },
                  {
                    "level": "paragraph-1.2.2.1.2",
                    "title": "མིང་དོན་གནས་འགྱུར་བའི་ཕན་ཡོན།",
                    "lines_span": "37-40",
                    "line_text_excerpt": "བྱང་ཆུབ་སེམས་སྐྱེས་གྱུར་ན་སྐད་ཅིག་གིས། །\nའཁོར་བའི་བཙོན་རར་བསྡམས་པའི་ཉམ་ཐག་རྣམས། །\nབདེ་གཤེགས་རྣམས་ཀྱི་སྲས་ཞེས་བརྗོད་བྱ་ཞིང་། །\nའཇིག་རྟེན་ལྷ་མིར་བཅས་པས་ཕྱག་བྱར་འགྱུར། །",
                    "children": []
                  },
                  {
                    "level": "paragraph-1.2.2.1.3",
                    "title": "ཕན་ཡོན་དཔེའི་སྒོ་ནས་བསྟན་པ།",
                    "lines_span": "41-62",
                    "children": [
                      {
                        "level": "subparagraph-1.2.2.1.3.1",
                        "title": "གསེར་འགྱུར་གྱི་དཔེ།",
                        "lines_span": "41-44",
                        "line_text_excerpt": "གསེར་འགྱུར་རྩི་ཡི་རྣམ་པ་མཆོག་ལྟ་བུ། །\nམི་གཙང་ལུས་འདི་བླངས་ནས་རྒྱལ་བའི་སྐུ། །\nརིན་ཆེན་རིང་ཐང་མེད་པར་བསྒྱུར་བས་ན། །\nབྱང་ཆུབ་སེམས་ཞེས་བྱ་བ་རབ་བརྟན་ཟུང་། །",
                        "children": []
                      },
                      {
                        "level": "subparagraph-1.2.2.1.3.2",
                        "title": "རིན་པོ་ཆེའི་དཔེ།",
                        "lines_span": "45-48",
                        "line_text_excerpt": "འགྲོ་བའི་དེད་དཔོན་གཅིག་པུ་ཚད་མེད་བློས། །\nལེགས་པར་ཡོངས་སུ་བརྟགས་ན་རིན་ཆེ་བས། །\nའགྲོ་བའི་གནས་དང་བྲལ་བར་འདོད་པ་རྣམས། །\nརིན་ཆེན་བྱང་ཆུབ་སེམས་ལེགས་བརྟན་པར་ཟུང་། །",
                        "children": []
                      },
                      {
                        "level": "subparagraph-1.2.2.1.3.3",
                        "title": "ལྗོན་ཤིང་གི་དཔེ།",
                        "lines_span": "49-52",
                        "line_text_excerpt": "དགེ་བ་གཞན་ཀུན་ཆུ་ཤིང་བཞིན་དུ་ནི། །\nའབྲས་བུ་བསྐྱེད་ནས་ཟད་པར་འགྱུར་བ་ཉིད། །\nབྱང་ཆུབ་སེམས་ཀྱི་ལྗོན་ཤིང་རྟག་པར་ཡང་། །\nའབྲས་བུ་འབྱིན་པས་མི་ཟད་འཕེལ་བར་འགྱུར། །",
                        "children": []
                      },
                      {
                        "level": "subparagraph-1.2.2.1.3.4",
                        "title": "དཔའ་བོའི་དཔེ།",
                        "lines_span": "53-56",
                        "line_text_excerpt": "སྡིག་པ་ཤིན་ཏུ་མི་བཟད་བྱས་ན་ཡང་། །\nདཔའ་ལ་བརྟེན་ནས་འཇིགས་པ་ཆེན་པོ་ལྟར། །\nགང་ལ་བརྟེན་ནས་ཡུད་ཀྱིས་སྒྲོལ་འགྱུར་བ། །\nདེ་ལ་བག་ཅན་རྣམས་ཀྱིས་ཅིས་མི་བརྟེན། །",
                        "children": []
                      },
                      {
                        "level": "subparagraph-1.2.2.1.3.5",
                        "title": "དུས་མཐའི་མེའི་དཔེ།",
                        "lines_span": "57-58",
                        "line_text_excerpt": "དེས་ནི་དུས་མཐའི་མེ་བཞིན་སྡིག་ཆེན་རྣམས། །\nསྐད་ཅིག་གཅིག་གིས་ངེས་པར་སྲེག་པར་བྱེད། །",
                        "children": []
                      },
                      {
                        "level": "subparagraph-1.2.2.1.3.6",
                        "title": "གཞུང་གཞན་དུ་ཞལ་འཕང་བ།",
                        "lines_span": "59-62",
                        "line_text_excerpt": "དེ་ཡི་ཕན་ཡོན་དཔག་ཏུ་མེད་པ་དག །\nབྱམས་མགོན་བློ་དང་ལྡན་པས་ནོར་བཟང་བཤད། །",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "level": "subsubsection-1.2.2.2",
                "title": "སྨོན་འཇུག་སོ་སོའི་ཕན་ཡོན།",
                "lines_span": "63-98",
                "children": [
                  {
                    "level": "paragraph-1.2.2.2.1",
                    "title": "སྨོན་འཇུག་གི་དབྱེ་བ།",
                    "lines_span": "63-70",
                    "line_text_excerpt": "བྱང་ཆུབ་སེམས་དེ་མདོར་བསྡུས་ན། །\nརྣམ་པ་གཉིས་སུ་ཤེས་བྱ་སྟེ། །\nབྱང་ཆུབ་སྨོན་པའི་སེམས་དང་ནི། །\nབྱང་ཆུབ་འཇུག་པ་ཉིད་ཡིན་ནོ། །\nའགྲོ་བར་འདོད་དང་འགྲོ་བ་ཡི། །\nབྱེ་བྲག་ཇི་ལྟར་ཤེས་པ་ལྟར། །\nདེ་བཞིན་མཁས་པས་འདི་གཉིས་ཀྱི། །\nབྱེ་བྲག་རིམ་བཞིན་ཤེས་པར་བྱ། །",
                    "children": []
                  },
                  {
                    "level": "paragraph-1.2.2.2.2",
                    "title": "ཕན་ཡོན་གྱི་ཁྱད་པར།",
                    "lines_span": "71-82",
                    "line_text_excerpt": "བྱང་ཆུབ་སྨོན་པའི་སེམས་ལས་ནི། །\nའཁོར་ཚེ་འབྲས་བུ་ཆེ་འབྱུང་ཡང་། །\nཇི་ལྟར་འཇུག་པའི་སེམས་བཞིན་དུ། །\nབསོད་ནམས་རྒྱུན་ཆགས་འབྱུང་བ་མིན། །\nགང་ནས་བཟུང་སྟེ་སེམས་ཅན་ཁམས། །\nམཐའ་ཡས་རབ་ཏུ་དགྲོལ་བའི་ཕྱིར། །\nམི་ལྡོག་པ་ཡི་སེམས་ཀྱིས་སུ། །\nསེམས་དེ་ཡང་དག་བླངས་གྱུར་པ། །\nདེང་ནས་བཟུང་སྟེ་གཉིད་ལོག་གམ། །\nབག་མེད་གྱུར་ཀྱང་བསོད་ནམས་ཤུགས། །\nརྒྱུན་མི་འཆད་པར་དུ་མ་ཞིག །\nནམ་མཁའ་མཉམ་པར་རབ་ཏུ་འབྱུང་། །",
                    "children": []
                  },
                  {
                    "level": "paragraph-1.2.2.2.3",
                    "title": "ལུང་རིགས་ཀྱི་སྒོ་ནས་བསྒྲུབ་པ།",
                    "lines_span": "83-98",
                    "children": [
                      {
                        "level": "subparagraph-1.2.2.2.3.1",
                        "title": "ལུང་གི་སྒོ་ནས་བསྒྲུབ་པ།",
                        "lines_span": "83-86",
                        "line_text_excerpt": "འདི་ནི་འཐད་པ་དང་བཅས་པར། །\nལག་བཟང་གིས་ནི་ཞུས་པ་ལས། །\nདམན་མོས་སེམས་ཅན་དོན་གྱི་ཕྱིར། །\nདེ་བཞིན་གཤེགས་པ་ཉིད་ཀྱིས་གསུངས། །",
                        "children": []
                      },
                      {
                        "level": "subparagraph-1.2.2.2.3.2",
                        "title": "རིགས་པའི་སྒོ་ནས་བསྒྲུབ་པ།",
                        "lines_span": "87-98",
                        "line_text_excerpt": "སེམས་ཅན་རྣམས་ཀྱི་ཀླད་ནད་ཙམ། །\nབསལ་ལོ་སྙམ་དུ་བསམས་ན་ཡང་། །\nཕན་འདོགས་བསམ་པ་དང་ལྡན་དེ། །\nབསོད་ནམས་དཔག་མེད་ལྡན་གྱུར་ན། །\nསེམས་ཅན་རེ་རེའི་མི་བདེ་བ། །\nདཔག་ཏུ་མེད་པ་བསལ་འདོད་ཅིང་། །\nརེ་རེའང་ཡོན་ཏན་དཔག་མེད་དུ། །\nབསྒྲུབ་པར་འདོད་པ་སྨོས་ཅི་དགོས། །",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "level": "subsubsection-1.2.2.3",
                "title": "སེམས་བསྐྱེད་རྒྱུད་ལྡན་གྱི་གང་ཟག་གི་ཆེ་བ་བཤད་པ།",
                "lines_span": "99-106",
                "line_text_excerpt": "ཕའམ་ཡང་ན་མ་ཡང་རུང་། །\nསུ་ལ་འདི་འདྲའི་ཕན་སེམས་ཡོད། །\nལྷ་དང་དྲང་སྲོང་རྣམས་ཀྱང་རུང་། །\nཚངས་པ་ལ་ཡང་འདི་ཡོད་དམ། །\nསེམས་ཅན་དེ་དག་ཉིད་ལ་སྔོན། །\nརང་གི་དོན་དུ་འདི་འདྲའི་སེམས། །\nརྨི་ལམ་དུ་ཡང་མ་རྨིས་ན། །\nགཞན་གྱི་དོན་དུ་ག་ལ་སྐྱེ། །\nགཞན་དག་རང་གི་དོན་དུ་ཡང་། །\nམི་འབྱུང་སེམས་ཅན་དོན་སེམས་གང་། །\nསེམས་ཀྱི་རིན་ཆེན་ཁྱད་པར་འདི། །\nསྔ་ན་མེད་པའི་རྨད་ཅིག་འཁྲུངས། །\nའགྲོ་བ་ཀུན་གྱི་དགའ་བའི་རྒྱུ། །\nསེམས་ཅན་སྡུག་བསྔལ་རྩིར་གྱུར་པ། །\nརིན་ཆེན་སེམས་ཀྱི་བསོད་ནམས་གང་། །\nདེ་ལ་ཇི་ལྟར་གཞལ་གྱིས་ལང་། །\nཕན་པར་བསམས་པ་ཙམ་གྱིས་ཀྱང་། །\nསངས་རྒྱས་མཆོད་ལས་ཁྱད་འཕགས་ན། །\nསེམས་ཅན་མ་ལུས་ཐམས་ཅད་ཀྱི། །\nབདེ་དོན་བརྩོན་པ་སྨོས་ཅི་དགོས། །\nསྡུག་བསྔལ་འདོར་འདོད་སེམས་ཡོད་ཀྱང་། །\nསྡུག་བསྔལ་ཉིད་ལ་མངོན་པར་རྒྱུག །\nབདེ་བ་འདོད་ཀྱང་གཏི་མུག་པས། །\nརང་གི་བདེ་བ་དགྲ་ལྟར་འཇོམས། །\nགང་ཞིག་བདེ་བས་ཕོངས་པ་དང་། །\nསྡུག་བསྔལ་མང་ལྡན་དེ་དག་ལ། །\nབདེ་བ་ཀུན་གྱིས་ཚིམ་པ་དང་། །\nསྡུག་བསྔལ་ཐམས་ཅད་གཅོད་བྱེད་ཅིང་། །\nགཏི་མུག་ཀྱང་ནི་སེལ་བྱེད་པ། །\nདེ་དང་དགེ་མཚུངས་ག་ལ་ཡོད། །\nདེ་འདྲའི་བཤེས་ཀྱང་ག་ལ་ཡོད། །\nབསོད་ནམས་དེ་འདྲའང་ག་ལ་ཡོད། །\nཕན་བཏགས་ལན་ལྡོན་གང་ཡིན་པ། །\nདེ་ཡང་རེ་ཞིག་བསྔགས་འོས་ན། །\nམ་བཅོལ་ལེགས་པར་བྱེད་པ་ཡི། །\nབྱང་ཆུབ་སེམས་དཔའ་སྨོས་ཅི་དགོས། །\nའགྲོ་བ་ཉུང་ཟད་ནར་མའི་ཟས་སྦྱོར་བ། །\nསྐད་ཅིག་ཟས་ཙམ་སྦྱིན་པར་བྱེད་པ་དང་། །\nབརྙས་བཅས་ཉིན་ཕྱེད་འགྲངས་པར་བྱེད་པ་ཡང་། །\nདགེ་བ་བྱེད་པ་ཡིན་ཞེས་སྐྱེ་བོས་བཀུར། །\nསེམས་ཅན་གྲངས་མཐའ་ཡས་ལ་དུས་རིང་དུ། །\nབདེ་བར་གཤེགས་ཀྱི་བདེ་བ་བླ་ན་མེད། །\nཡིད་ལ་བསམ་པ་མཐའ་དག་རྫོགས་བྱེད་པ། །\nརྟག་ཏུ་སྦྱིན་པ་ལྟ་ཞིག་སྨོས་ཅི་དགོས། །\nགང་ཞིག་དེ་འདྲའི་རྒྱལ་སྲས་སྦྱིན་བདག་ལ། །\nགལ་ཏེ་ངན་སེམས་སྐྱེད་པར་བྱེད་ན་དེ། །\nངན་སེམས་བསྐྱེད་པའི་གྲངས་བཞིན་བསྐལ་པར་ནི། །\nདམྱལ་བར་གནས་པར་འགྱུར་ཞེས་ཐུབ་པས་གསུངས། །\nའོན་ཏེ་གང་ཞིག་ཡིད་རབ་དང་བྱེད་ན། །\nདེ་ཡི་འབྲས་བུ་དེ་བས་ལྷག་པར་འཕེལ། །\nརྒྱལ་སྲས་རྣམས་ལ་དོ་གལ་ཆེན་པོས་ཀྱང་། །\nསྡིག་པ་མི་འབྱུང་དགེ་བ་ངང་གིས་འཕེལ། །\nགང་ལ་སེམས་ཀྱི་དམ་པ་རིན་ཆེན་དེ། །\nསྐྱེས་པ་དེ་ཡི་སྐུ་ལ་ཕྱག་འཚལ་ཞིང་། །\nགང་ལ་གནོད་པ་བྱས་ཀྱང་བདེ་འབྲེལ་བ། །\nབདེ་བའི་འབྱུང་གནས་དེ་ལ་སྐྱབས་སུ་མཆི། །",
                "children": []
              }
            ]
          }
        ]
      }
    ]
  }
]
