[
  {
    "level": "2",
    "title": "ལེའུ་གཉིས་པ་སྡིག་པ་བཤགས་པའི་ལེའུ།",
    "verses_span": "1-68",
    "children": [
      {
        "level": "2.1",
        "title": "མཆོད་པ་འབུལ་བའི་ཡན་ལག",
        "verses_span": "1-26",
        "children": [
          {
            "level": "2.1.1",
            "title": "དངོས་སུ་འབྱོར་པའི་མཆོད་པ།",
            "verses_span": "1-11",
            "children": [
              {
                "level": "2.1.1.1",
                "title": "བདག་པོས་ཡོངས་སུ་བཟུང་བའི་མཆོད་པ།",
                "verses_span": "1-1",
                "verse_text_excerpt": "རིན་ཆེན་སེམས་དེ་གཟུང་བར་བྱ་བའི་ཕྱིར། །དེ་བཞིན་གཤེགས་པ་རྣམས་དང་དམ་པའི་ཆོས། །དཀོན་མཆོག་དྲི་མ་མེད་དང་སངས་རྒྱས་སྲས། །ཡོན་ཏན་རྒྱ་མཚོ་རྣམས་ལ་ལེགས་པར་མཆོད། །",
                "children": []
              },
              {
                "level": "2.1.1.2",
                "title": "བདག་པོས་ཡོངས་སུ་མ་བཟུང་བའི་མཆོད་པ།",
                "verses_span": "2-8",
                "verse_text_excerpt": "མེ་ཏོག་འབྲས་བུ་ཇི་སྙེད་ཡོད་པ་དང་། །སྨན་གྱི་རྣམ་པ་གང་དག་ཡོད་པ་དང་། །འཇིག་རྟེན་རིན་ཆེན་ཇི་སྙེད་ཡོད་པ་དང་། །ཆུ་གཙང་ཡིད་དུ་འོང་བ་ཅི་ཡོད་དང་། །\nརིན་ཆེན་རི་བོ་དང་ནི་དེ་བཞིན་དུ། །ནགས་ཚལ་ས་ཕྱོགས་དབེན་ཞིང་ཉམས་དགའ་དང་། །ལྗོན་ཤིང་མེ་ཏོག་རྒྱན་སྤྲས་སྤུད་པ་དང་། །ཤིང་གང་འབྲས་བཟང་ཡལ་ག་དུད་པ་དང་། །\nལྷ་སོགས་འཇིག་རྟེན་ན་ཡང་དྲི་དང་ནི། །སྤོས་དང་དཔག་བསམ་ཤིང་དང་རིན་ཆེན་ཤིང་། །\nམ་རྨོས་འཁྲུངས་པའི་ལོ་ཏོག་རྣམ་པ་དང་། །གཞན་ཡང་མཆོད་པར་འོས་པའི་རྒྱན་རྣམས་ནི། །མཚོ་དང་རྫིང་བུ་པདྨས་བརྒྱན་པ་དག །ངང་པ་ཤིན་ཏུ་སྐད་སྙན་ཡིད་འོང་ལྡན། །\nནམ་མཁའ་རབ་འབྱམས་ཁམས་ཀྱི་མཐས་གཏུགས་པ། །ཡོངས་སུ་གཟུང་བ་མེད་པ་དེ་དག་ཀུན། །བློ་ཡིས་བླངས་ནས་ཐུབ་པ་སྐྱེས་ཀྱི་མཆོག །\nསྲས་དང་བཅས་པ་རྣམས་ལ་ལེགས་འབུལ་ན། །ཡོན་གནས་དམ་པ་ཐུགས་རྗེ་ཆེ་རྣམས་ཀྱིས། །བདག་ལ་བརྩེར་དགོངས་བདག་གི་འདི་དག་བཞེས། །\nབདག་ནི་བསོད་ནམས་མི་ལྡན་བཀྲེན་ཆེན་ཏེ། །མཆོད་པའི་ནོར་གཞན་བདག་ལ་ཅང་མ་མཆིས། །དེས་ན་གཞན་དོན་དགོངས་པའི་མགོན་གྱིས་འདི། །བདག་གི་དོན་སླད་ཉིད་ཀྱི་མཐུས་བཞེས་ཤིག །",
                "children": []
              },
              {
                "level": "2.1.1.3",
                "title": "ལུས་འབུལ་བའི་མཆོད་པ།",
                "verses_span": "9-11",
                "verse_text_excerpt": "རྒྱལ་དང་དེ་སྲས་རྣམས་ལ་བདག་གིས་ནི། །བདག་གི་ལུས་ཀུན་གཏན་དུ་དབུལ་བར་བགྱི། །སེམས་དཔའ་མཆོག་རྣམས་བདག་ནི་ཡོངས་བཞེས་ཤིག །གུས་པས་ཁྱེད་ཀྱི་འབངས་སུ་མཆི་བར་བགྱི། །\nབདག་ནི་ཁྱེད་ཀྱིས་ཡོངས་སུ་བཟུང་བས་ན། །སྲིད་ན་མི་འཇིགས་སེམས་ཅན་ཕན་པ་བགྱིད། །སྔོན་གྱི་སྡིག་ལས་ཡང་དག་འདའ་བགྱིད་ཅིང་། །སྡིག་པ་གཞན་ཡང་སླན་ཆད་མི་བགྱིད་དོ། །",
                "children": []
              }
            ]
          },
          {
            "level": "2.1.2",
            "title": "ཡིད་ཀྱིས་སྤྲུལ་པའི་མཆོད་པ།",
            "verses_span": "12-22",
            "children": [
              {
                "level": "2.1.2.1",
                "title": "ཁྲུས་དང་སྐུ་ཕྱི་སོགས་འབུལ་བ།",
                "verses_span": "12-16",
                "verse_text_excerpt": "ཁྲུས་ཀྱི་ཁང་པ་ཤིན་ཏུ་དྲི་ཞིམ་པ། །ཤེལ་གྱི་ས་གཞི་གསལ་ཞིང་འཚེར་བ་བསྟར། །རིན་ཆེན་འབར་བའི་ཀ་བ་ཡིད་འོང་ལྡན། །མུ་ཏིག་འོད་ཆགས་བླ་རེ་བྲེས་པ་དེར། །\nདེ་བཞིན་གཤེགས་དང་དེ་ཡི་སྲས་རྣམས་ལ། །རིན་ཆེན་བུམ་པ་མང་པོ་སྤོས་ཀྱི་ཆུ། །ཡིད་འོང་ལེགས་པར་བཀང་བ་གླུ་དང་ནི། །རོལ་མོར་བཅས་པ་དུ་མས་སྐུ་ཁྲུས་གསོལ། །\nདེ་དག་སྐུ་ལ་མཚུངས་པ་མེད་པའི་གོས། །གཙང་ལ་དྲི་རབ་བསྒོས་པས་སྐུ་ཕྱིའོ། །དེ་ནས་དེ་ལ་ཁ་དོག་ལེགས་བསྒྱུར་བའི། །ན་བཟའ་ཤིན་ཏུ་དྲི་ཞིམ་དམ་པ་འབུལ། །\nགོས་བཟང་སྲབ་ལ་འཇམ་པ་སྣ་ཚོགས་དང་། །རྒྱན་མཆོག་བརྒྱ་ཕྲག་དེ་དང་དེ་དག་གིས། །འཕགས་པ་ཀུན་ཏུ་བཟང་དང་འཇམ་དབྱངས་དང་། །འཇིག་རྟེན་དབང་ཕྱུག་སོགས་ལའང་བརྒྱན་པར་བགྱི། །",
                "children": []
              },
              {
                "level": "2.1.2.2",
                "title": "ཉེར་སྤྱོད་ཀྱི་མཆོད་པ།",
                "verses_span": "17-22",
                "verse_text_excerpt": "སྟོང་གསུམ་ཀུན་ཏུ་དྲི་ངད་ལྡང་བ་ཡི། །དྲི་མཆོག་རྣམས་ཀྱིས་ཐུབ་དབང་ཀུན་གྱི་སྐུ། །གསེར་སྦྱངས་བཙོ་མ་བྱི་དོར་བྱས་པ་ལྟར། །འོད་ཆགས་འབར་བ་དེ་དག་བྱུག་པར་བགྱི། །\nཐུབ་དབང་མཆོད་གནས་མཆོག་ལ་ཡིད་འོང་བའི། །མེ་ཏོག་མནྡ་ར་དང་པདྨ་དང་། །ཨུཏྤལ་ལ་སོགས་དྲི་ཞིམ་ཐམས་ཅད་དང་། །ཕྲེང་བ་སྤེལ་ལེགས་ཡིད་འོང་རྣམས་ཀྱིས་མཆོད། །\nསྤོས་མཆོག་ཡིད་འཕྲོག་དྲི་ངད་ཁྱབ་པ་ཡི། །བདུག་པའི་སྤྲིན་ཚོགས་རྣམས་ཀྱང་དེ་ལ་དབུལ། །ཞལ་ཟས་བཟའ་བཏུང་སྣ་ཚོགས་བཅས་པ་ཡི། །ལྷ་བཤོས་རྣམས་ཀྱང་དེ་ལ་དབུལ་བར་བགྱི། །\nགསེར་གྱི་པདྨ་ཚར་དུ་དངར་བ་ཡི། །རིན་ཆེན་སྒྲོན་མ་རྣམས་ཀྱང་དབུལ་བར་བགྱི། །\nས་གཞི་བསྟར་བ་སྤོས་ཀྱིས་བྱུགས་པ་དེར། །མེ་ཏོག་ཡིད་འོང་སིལ་མ་དགྲམ་པར་བྱ། །\nགཞལ་མེད་ཕོ་བྲང་བསྟོད་དབྱངས་ཡིད་འོང་ལྡན། །མུ་ཏིག་རིན་ཆེན་རྒྱན་འཕྱང་མཛེས་འབར་བ། །དཔག་ཡས་ནམ་མཁའི་རྒྱན་གྱུར་དེ་དག་ཀྱང་། །ཐུགས་རྗེའི་རང་བཞིན་ཅན་ལ་དབུལ་བར་བགྱི། །\nརིན་ཆེན་གདུགས་མཛེས་གསེར་གྱི་ཡུ་བ་ཅན། །ཁོར་ཡུག་རྒྱན་གྱི་རྣམ་པ་ཡིད་འོང་ལྡན། །དབྱིབས་ལེགས་བལྟ་ན་སྡུག་པ་བསྒྲེང་བ་ཡང་། །རྟག་ཏུ་ཐུབ་དབང་རྣམས་ལ་དབུལ་བར་བགྱི། །",
                "children": []
              }
            ]
          },
          {
            "level": "2.1.3",
            "title": "སྨོན་ལམ་སྟོབས་ཀྱི་མཆོད་པ།",
            "verses_span": "23-24",
            "verse_text_excerpt": "དེ་ལས་གཞན་ཡང་མཆོད་པའི་ཚོགས། །རོལ་མོ་དབྱངས་སྙན་ཡིད་འོང་ལྡན། །སེམས་ཅན་སྔག་བསྔལ་ཚིམ་བྱེད་པའི། །སྤྲིན་རྣམས་སོ་སོར་གནས་གྱུར་ཅིག །\nདམ་ཆོས་དཀོན་མཆོག་ཐམས་ཅད་དང་། །མཆོད་རྟེན་རྣམས་དང་སྐུ་གཟུགས་ལ། །རིན་ཆེན་མེ་ཏོག་ལ་སོགས་ཆར། །རྒྱུན་མི་འཆད་པར་འབབ་པར་ཤོག །",
            "children": []
          },
          {
            "level": "2.1.4",
            "title": "བླ་ན་མེད་པའི་མཆོད་པ།",
            "verses_span": "25-25",
            "verse_text_excerpt": "ཇི་ལྟར་འཇམ་དབྱངས་ལ་སོགས་པས། །རྒྱལ་བ་རྣམས་ལ་མཆོད་མཛད་པ། །དེ་བཞིན་བདག་གིས་དེ་བཞིན་གཤེགས། །མགོན་པོ་སྲས་དང་བཅས་རྣམས་མཆོད། །",
            "children": []
          },
          {
            "level": "2.1.5",
            "title": "བསྟོད་པ་དབྱངས་ཀྱི་མཆོད་པ།",
            "verses_span": "26-26",
            "verse_text_excerpt": "ཡོན་ཏན་རྒྱ་མཚོ་རྣམས་ལ་བདག །བསྟོད་དབྱངས་ཡན་ལག་རྒྱ་མཚོས་བསྟོད། །བསྟོད་དབྱངས་སྙན་སྤྲིན་དེ་དག་ལ། །ངེས་པར་ཀུན་དུ་འབྱུང་གྱུར་ཅིག །",
            "children": []
          }
        ]
      },
      {
        "level": "2.2",
        "title": "ཕྱག་འཚལ་བའི་ཡན་ལག",
        "verses_span": "27-28",
        "verse_text_excerpt": "དུས་གསུམ་གཤེགས་པའི་སངས་རྒྱས་ཀུན། །ཆོས་དང་ཚོགས་ཀྱི་མཆོག་བཅས་ལ། །ཞིང་རྡུལ་ཀུན་གྱི་གྲངས་སྙེད་ཀྱི། །ལུས་བཏུད་པ་ཡིས་བདག་ཕྱག་འཚལ། །\nབྱང་ཆུབ་སེམས་ཀྱི་གཞི་རྣམས་དང་། །མཆོད་རྟེན་རྣམས་ལ་བདག་ཕྱག་འཚལ། །མཁན་པོ་དེ་བཞིན་སློབ་དཔོན་དང་། །བརྟུལ་ཞུགས་མཆོག་ལ་ཕྱག་འཚལ་ལོ། །",
        "children": []
      },
      {
        "level": "2.3",
        "title": "སྐྱབས་སུ་འགྲོ་བའི་ཡན་ལག",
        "verses_span": "29-29",
        "verse_text_excerpt": "བྱང་ཆུབ་སྙིང་པོར་མཆིས་ཀྱི་བར། །སངས་རྒྱས་རྣམས་ལ་སྐྱབས་སུ་མཆི། །ཆོས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཡི། །ཚོགས་ལའང་དེ་བཞིན་སྐྱབས་སུ་མཆི། །",
        "children": []
      },
      {
        "level": "2.4",
        "title": "སྡིག་པ་བཤགས་པའི་ཡན་ལག",
        "verses_span": "30-68",
        "children": [
          {
            "level": "2.4.1",
            "title": "བཤགས་ཡུལ་མངོན་དུ་བྱ་བ།",
            "verses_span": "30-30",
            "verse_text_excerpt": "ཕྱོགས་རྣམས་ཀུན་ན་བཞུགས་པ་ཡི། །རྫོགས་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས། །ཐུགས་རྗེ་ཆེན་པོ་མངའ་རྣམས་ལ། །ཐལ་མོ་སྦྱར་ཏེ་གསོལ་བ་ནི། །",
            "children": []
          },
          {
            "level": "2.4.2",
            "title": "བཤགས་པ་དངོས།",
            "verses_span": "31-68",
            "children": [
              {
                "level": "2.4.2.1",
                "title": "སུན་འབྱིན་པའི་སྟོབས།",
                "verses_span": "31-49",
                "verse_text_excerpt": "ཐོག་མ་མེད་ལྡན་འཁོར་བ་ནས། །ཚེ་རབས་འདི་འམ་གཞན་དག་ཏུ། །བདག་གིས་མ་འཚལ་སྡིག་བགྱིས་པའམ། །བགྱིད་དུ་སྩལ་བ་ཉིད་དང་ནི། །\nགཏི་མུག་འཁྲུལ་པས་བདག་ནོན་ཏེ། །རྗེས་སུ་ཡི་རང་གང་བགྱིས་པ། །ནོངས་པ་དེ་ནི་མཐོང་བགྱིས་ནས། །བསམ་པ་ཐག་པས་མགོན་ལ་བཤགས། །\nབདག་གིས་དཀོན་མཆོག་གསུམ་དང་ནི། །ཕ་མའམ་བླ་མ་གཞན་དག་ལ། །ཉོན་མོངས་སྒོ་ནས་ལུས་ངག་དང་། །ཡིད་ཀྱིས་གནོད་བགྱིས་གང་ལགས་དང་། །\nཉེས་པ་དུ་མས་སྐྱོན་ཆགས་པའི། །སྡིག་ཅན་བདག་གིས་སྡིག་པ་གང་། །ཤིན་ཏུ་མི་བཟད་བགྱིས་པ་དེ། །ཐམས་ཅད་འདྲེན་པ་རྣམས་ལ་བཤགས། །\nབདག་ནི་སྡིག་པ་མ་བྱང་བར། །སྔོན་དུ་འགུམ་པར་འགྱུར་དུ་མཆི། །ཇི་ལྟར་འདི་ལས་ངེས་ཐར་བར། །མྱུར་བའི་ཚུལ་གྱིས་བསྐྱབ་ཏུ་གསོལ། །\nཡིད་བརྟན་མི་རུང་འཆི་བདག་འདི། །བྱས་དང་མ་བྱས་མི་སྡོད་པས། །ན་དང་མི་ན་ཀུན་གྱིས་ཀྱང་། །གློ་བུར་ཚེ་ལ་ཡིད་མི་བརྟན། །\nཐམས་ཅད་བོར་ཏེ་ཆས་དགོས་པར། །བདག་གིས་དེ་ལྟར་མ་ཤེས་ནས། །མཛའ་དང་མི་མཛའི་དོན་གྱི་ཕྱིར། །སྡིག་པ་རྣམ་པ་སྣ་ཚོགས་བྱས། །\nམི་མཛའ་རྣམས་ཀྱང་མེད་འགྱུར་ཞིང་། །མཛའ་བ་རྣམས་ཀྱང་མེད་པར་འགྱུར། །བདག་ཀྱང་མེད་པར་འགྱུར་བ་སྟེ། །དེ་བཞིན་ཐམས་ཅད་མེད་པར་འགྱུར། །\nརྨི་ལམ་ཉམས་སུ་མྱོང་བ་བཞིན། །དངོས་པོ་གང་དང་གང་སྤྱད་པ། །དེ་དེ་དྲན་པའི་ཡུལ་དུ་འགྱུར། །འདས་པ་ཐམས་ཅད་མཐོང་མི་འགྱུར། །\nརེ་ཞིག་གསོན་ཚེ་འདི་ཉིད་ལ། །མཛའ་དང་མི་མཛའ་དུ་མ་འདས། །དེ་དག་དོན་དུ་བྱས་པའི་སྡིག །མི་བཟད་གང་ཡིན་མདུན་ན་གནས། །\nདེ་ལྟར་བདག་ནི་གློ་བུར་ཞེས། །བདག་གིས་རྟོགས་པར་མ་གྱུར་པས། །གཏི་མུག་ཆགས་དང་ཞེ་སྡང་གིས། །སྡིག་པ་རྣམ་པ་དུ་མ་བྱས། །\nཉིན་མཚན་སྡོད་པ་ཡོང་མེད་པར། །ཚེ་འདི་རྟག་ཏུ་གོད་འགྱུར་ཞིང་། །སྣོན་པ་གུད་ནས་འོང་མེད་ན། །བདག་ལྟ་འཆི་བར་ཅིས་མི་འགྱུར། །\nབདག་ནི་མལ་ན་འདུག་བཞིན་དུ། །གཉེན་བཤེས་ཀུན་གྱིས་མཐའ་བསྐོར་ཀྱང་། །སྲོག་འཆད་པ་ཡི་ཚོར་བ་དག །བདག་ཉིད་གཅིག་པུས་མྱོང་བར་འགྱུར། །\nགཤིན་རྗེའི་ཕོ་ཉས་ཟིན་པ་ལ། །གཉེན་གྱིས་ཅི་ཕན་བཤེས་ཅི་ཕན། །དེ་ཚེ་བསོད་ནམས་གཅིག་བསྐྱབས་ན། །དེ་ཡང་བདག་གིས་མ་བསྟེན་ཏོ། །\nམགོན་པོ་བག་མེད་བདག་གིས་ནི། །འཇིགས་པ་འདི་འདྲ་མ་འཚལ་ནས། །མི་རྟག་ཚེ་འདིའི་ཆེད་དག་ཏུ། །སྡིག་པ་མང་པོ་ཉེ་བར་བསྒྲུབས། །\nསྐྱེ་བོ་ཡན་ལག་བཅད་པའི་སར། །དེ་རིང་ཁྲིད་པའང་བྲེད་འགྱུར་ཏེ། །ཁ་སྐམས་མིག་རྩ་ངན་ལ་སོགས། །སྔ་ལས་གཞན་དུ་འགྱུར་སྣང་ན། །\nགཤིན་རྗེའི་ཕོ་ཉ་འཇིགས་འཇིགས་ལྟའི། །ཤ་ཚུགས་ཅན་གྱིས་བཟུང་གྱུར་ཅིང་། །འཇིགས་ཆེན་ནད་ཀྱིས་ཐེབས་གྱུར་པ། །རབ་ཏུ་ཉམ་ཐག་སྨོས་ཅི་དགོས། །\nསུ་ཞིག་འཇིགས་ཆེན་འདི་ལས་བདག །ལེགས་པར་སྐྱོབ་པར་བྱེད་འགྱུར་ཞེས། །བྲེད་ཤ་ཐོན་པའི་མིག་བགྲད་ནས། །ཕྱོགས་བཞིར་སྐྱབས་དག་ཚོལ་བར་བྱེད། །\nཕྱོགས་བཞིར་སྐྱབས་མེད་མཐོང་ནས་ནི། །དེ་ནས་ཀུན་དུ་ཡི་མུག་འགྱུར། །གནས་དེར་སྐྱབས་ཡོད་མ་ཡིན་ན། །དེ་ཚེ་བདག་གིས་ཇི་ལྟར་བྱ། །",
                "children": []
              },
              {
                "level": "2.4.2.2",
                "title": "རྟེན་གྱི་སྟོབས།",
                "verses_span": "50-56",
                "verse_text_excerpt": "དེ་བས་རྒྱལ་བ་འགྲོ་བའི་མགོན། །འགྲོ་བ་སྐྱོབ་པའི་དོན་བརྩོན་པ། །སྟོབས་ཆེན་འཇིགས་པ་ཀུན་སེལ་ལ། །དེ་རིང་ཉིད་ནས་སྐྱབས་སུ་མཆི། །\nདེ་ཡི་ཐུགས་སུ་ཆུད་པའི་ཆོས། །འཁོར་བའི་འཇིགས་པ་སེལ་བ་དང་། །བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ལ་ཡང་། །དེ་བཞིན་ཡང་དག་སྐྱབས་སུ་མཆི། །\nབདག་ནི་འཇིགས་པས་རྣམ་སྐྲག་པས། །ཀུན་ཏུ་བཟང་ལ་བདག་ཉིད་འབུལ། །འཇམ་པའི་དབྱངས་ལ་བདག་ཉིད་ཀྱིས། །བདག་གི་ལུས་ནི་དབུལ་བར་བགྱི། །\nཐུགས་རྗེས་སྤྱོད་པ་མ་འཁྲུལ་བ། །སྤྱན་རས་གཟིགས་མགོན་དེ་ལ་ཡང་། །ཉམ་ཐག་ང་རོས་འོ་དོད་འབོད། །སྡིག་ལྡན་བདག་ལ་བསྐྱབ་ཏུ་གསོལ། །\nའཕགས་པ་ནམ་མཁའི་སྙིང་པོ་དང་། །ས་ཡི་སྙིང་པོ་དག་དང་ནི། །ཐུགས་རྗེ་ཆེ་མགོན་ཐམས་ཅད་ལ། །སྐྱབས་ཚོལ་སྙིང་ནས་འོ་དོད་འབོད། །\nགང་ཞིག་མཐོང་ནས་གཤིན་རྗེ་ཡི། །ཕོ་ཉ་ལ་སོགས་སྡང་བ་རྣམས། །སྐྲག་ནས་ཕྱོགས་བཞིར་འབྱེར་བྱེད་པ། །རྡོ་རྗེ་ཅན་ལ་སྐྱབས་སུ་མཆི། །\nསྔོན་ཆད་ཁྱེད་ཀྱི་བཀའ་ལས་འདས། །ད་ནི་འཇིགས་པ་ཆེ་མཐོང་ནས། །ཁྱེད་ལ་སྐྱབས་སུ་མཆི་ལགས་ཀྱིས། །འཇིགས་པ་མྱུར་དུ་བསལ་དུ་གསོལ། །",
                "children": []
              },
              {
                "level": "2.4.2.3",
                "title": "གཉེན་པོ་ཀུན་ཏུ་སྤྱོད་པའི་སྟོབས།",
                "verses_span": "57-67",
                "verse_text_excerpt": "ཐ་མལ་ནད་ཀྱིས་འཇིགས་ན་ཡང་། །སྨན་པའི་ངག་བཞིན་བྱ་དགོས་ན། །འདོད་ཆགས་ལ་སོགས་ཉེས་པ་བརྒྱའི། །ནད་ཀྱིས་རྟག་བཏབ་སྨོས་ཅི་དགོས། །\nདེ་གཅིག་གིས་ཀྱང་འཛམ་གླིང་ན། །གནས་པའི་མི་ཀུན་བརླག་བྱེད་ལ། །དེ་དག་གསོ་བའི་སྨན་གཞན་ནི། །ཕྱོགས་རྣམས་ཀུན་ནས་མི་རྙེད་ན། །\nདེ་ལ་སྨན་པ་ཐམས་ཅད་མཁྱེན། །ཟུག་རྔུ་ཐམས་ཅད་འབྱིན་པ་ཡི། །བཀའ་ལྟར་མི་བྱེད་སེམས་པ་ནི། །ཤིན་ཏུ་གཏི་མུག་སྨད་པའི་གནས། །\nགཡང་ས་ཐ་མལ་ཆུང་ངུ་ལའང་། །བག་ཡོད་གནས་པར་བྱ་དགོས་ན། །དཔག་ཚད་སྟོང་དུ་ལྷུང་བ་ཡི། །ཡུན་རིང་གཡང་སར་སྨོས་ཅི་དགོས། །\nདེ་རིང་ཁོ་ན་མི་འཆི་ཞེས། །བདེ་བར་འདུག་པ་རིགས་མ་ཡིན། །བདག་ནི་མེད་པར་འགྱུར་བའི་དུས། །དེ་ནི་གདོན་མི་ཟ་བར་འབྱུང་། །\nབདག་ལ་མི་འཇིགས་སུ་ཡིས་བྱིན། །འདི་ལས་ཇི་ལྟར་ངེས་ཐར་ཞེས། །གདོན་མི་ཟ་བར་མེད་འགྱུར་ན། །ཇི་ལྟར་བདག་ཡིད་བདེ་བར་འདུག །\nསྔོན་ཆད་མྱོང་སྟེ་ཞིག་པ་ལས། །བདག་ལ་ལྷག་པ་ཅི་ཡོད་ན། །བདག་ནི་དེ་ལ་མངོན་ཞེན་ནས། །བླ་མའི་བཀའ་དང་འགལ་བར་བྱས། །\nགསོན་ཚེ་འདི་དང་དེ་བཞིན་དུ། །གཉེན་དང་བཤེས་པ་རྣམ་སྤངས་ནས། །གཅིག་པུ་ག་ཤེད་འགྲོ་དགོས་ན། །མཛའ་དང་མི་མཛའ་ཀུན་ཅི་རུང་། །\nམི་དགེ་བ་ལས་སྡུག་བསྔལ་འབྱུང་། །དེ་ལས་ཇི་ལྟར་ངེས་ཐར་ཞེས། །ཉིན་མཚན་རྟག་ཏུ་བདག་གིས་ནི། །འདི་ཉིད་འབའ་ཞིག་བསམ་པའི་རིགས། །\nབདག་ནི་མི་ཤེས་གཏི་མུག་པས། །རང་བཞིན་ཁ་ན་མ་ཐོའམ། །བཅས་པའི་སྡིག་པ་གང་ཡིན་ལས། །གང་ཡང་རུང་བ་བགྱིས་པ་རྣམས། །\nམགོན་པོའི་སྤྱན་སྔར་མངོན་སུམ་དུ། །ཐལ་སྦྱར་སྡུག་བསྔལ་འཇིགས་སེམས་ཀྱིས། །ཡང་དང་ཡང་དུ་ཕྱག་འཚལ་ཏེ། །དེ་དག་ཐམས་ཅད་བཤགས་པར་བགྱི། །",
                "children": []
              },
              {
                "level": "2.4.2.4",
                "title": "སོར་ཆུད་པའི་སྟོབས།",
                "verses_span": "68-68",
                "verse_text_excerpt": "འདྲེན་པ་རྣམས་ཀྱིས་བདག་གི་སྡིག །ནོངས་པ་ལགས་པར་གཟུང་དུ་གསོལ། །འདི་ནི་བཟང་པོ་མ་ལགས་པས། །སླན་ཆད་བདག་ནི་ཡོང་མི་བགྱིད། །",
                "children": []
              }
            ]
          }
        ]
      }
    ]
  }
]